{
  "venue_type": "church",
  "song_count": 13,
  "songs": {
    "blackberry_creek_revival": {
      "title": "Blackberry Creek Revival",
      "status": "private",
      "lyrics": "Verse 1\nNo shoes on our feet, but we danced in the mud,\nSang hymns to the stars with our hearts full of blood.\nIn barns by the creek, where the hard times collide,\nWe found our salvation where the hopeless reside.\nPre-Chorus\nNo money, no mercy, just dreams in our veins,\nWe laughed through the hunger, we sang through the chains.\nChorus\nWe prayed in barns, we danced in rain,\nSang away hunger, laughed through pain.\nNo silver spoons, just dirt and dreams —\nOur Blackberry Creek revival streams.\nVerse 2\nOld men strummed banjos, kids clapped to the beat,\nMamas wove stories where the broken hearts meet.\nThe creek kept on flowin’, like our will to survive,\nTurned coal dust to diamonds in the firelight’s drive.\nPre-Chorus\nNo preacher, no riches, just souls intertwined,\nWe built our own heaven where the lost could still shine.\nChorus\nWe prayed in barns, we danced in rain,\nSang away hunger, laughed through pain.\nNo silver spoons, just dirt and dreams —\nOur Blackberry Creek revival streams.\nBridge\nEvery note was a fight, every song was a vow,\nWe rose from the ashes, we’re standin’ up now.\nThe creek’s still our witness, its waters still sing,\nOur revival’s the pulse of the hope we bring.\nChorus\nWe prayed in barns, we danced in rain,\nSang away hunger, laughed through pain.\nNo silver spoons, just dirt and dreams —\nOur Blackberry Creek revival streams.\nOutro\n*(Upbeat picking: E|-3-3-3-3-| A|-1-1-5-5-|)*\nBlackberry Creek… where my soul still sings.",
      "themes": [
        "faith_spirituality",
        "heartbreak_loss",
        "hometown_roots",
        "music_songwriting",
        "nature_outdoors",
        "resilience_survival",
        "working_class_labor"
      ]
    },
    "broken_hallelujah": {
      "title": "Broken Hallelujah",
      "status": "private",
      "lyrics": "Verse 1\nBack alley shadows, where the drunks lose their way,\nFound a splintered old box in the trash’s decay.\nSix rusted strings, neck warped like my dreams,\nBut it hummed like a savior in the moonlight’s beams.\nPre-Chorus\nNo angels in this town, just coal and despair,\nBut that guitar called my name through the cold, bitter air.\nChorus\nHeard a whisper in the wreckage, ‘neath the coffee grounds and rust,\nA broken Hallelujah risin’ from the dust.\nThis dumpster guitar salvation, ragged but it’s true,\nFound the song that saved my life right there inside of you.\nVerse 2\nDad’s fists were thunder, his bottle was king,\nBut I strummed my first chord, felt my heart start to sing.\nHid it in the shed where his eyes wouldn’t roam,\nEach note was a fire that was callin’ me home.\nPre-Chorus\nNo preacher could reach me, no sermon could mend,\nBut that guitar was my truth, my beginning, my friend.\nChorus\nHeard a whisper in the wreckage, ‘neath the coffee grounds and rust,\nA broken Hallelujah risin’ from the dust.\nThis dumpster guitar salvation, ragged but it’s true,\nFound the song that saved my life right there inside of you.\nBridge\nEvery scratch was a story, every crack was a fight,\nI coaxed out my soul in the dead of the night.\nFrom a boy lost in silence to a man with a voice,\nThis guitar was my freedom, my heart’s only choice.\nChorus\nHeard a whisper in the wreckage, ‘neath the coffee grounds and rust,\nA broken Hallelujah risin’ from the dust.\nThis dumpster guitar salvation, ragged but it’s true,\nFound the song that saved my life right there inside of you.\nOutro\n*(Slow picking: E|-3---3---|)*\nDumpster guitar… still singin’ me through.",
      "themes": [
        "abuse_trauma",
        "family",
        "faith_spirituality",
        "freedom_wandering",
        "hometown_roots",
        "music_songwriting",
        "nature_outdoors",
        "resilience_survival",
        "working_class_labor"
      ]
    },
    "guilt_and_grief": {
      "title": "Guilt and Grief",
      "status": "private",
      "lyrics": "Verse 1\nNever heard your voice, never felt your touch,\nJust a gravestone whisper in a mining town clutch.\nThey say I stole your breath when I took my first,\nNow I carry that weight like a lifelong curse.\nPre-Chorus\nI’d trade all my tomorrows for one yesterday,\nTo know the love you never got to say.\nChorus\nI dreamt of your hands, but I woke up cold —\nA cradle of silence, a story untold.\nI carry your voice in the spaces he left —\nGuilt and grief are all I have left.\nVerse 2\nDad’s eyes were daggers, blamin’ me for your end,\nBut I’d see you in dreams where my heart could mend.\nYour shadow’s my shelter when the nights get mean,\nI’m holdin’ onto love I’ve only ever seen.\nPre-Chorus\nI’d give all my songs for one moment with you,\nTo feel what a mother’s arms can do.\nChorus\nI dreamt of your hands, but I woke up cold —\nA cradle of silence, a story untold.\nI carry your voice in the spaces he left —\nGuilt and grief are all I have left.\nBridge\nEvery chord I play is a prayer to your name,\nEvery tear I hide is a candle’s flame.\nYou’re gone, but you’re woven in my every breath,\nI’m livin’ through the guilt to honor your death.\nChorus\nI dreamt of your hands, but I woke up cold —\nA cradle of silence, a story untold.\nI carry your voice in the spaces he left —\nGuilt and grief are all I have left.\nOutro\n*(Slow picking: E|-3---3---|)*\nGuilt and grief… my heart’s only theft.",
      "themes": [
        "abuse_trauma",
        "family",
        "faith_spirituality",
        "heartbreak_loss",
        "love_romance",
        "music_songwriting",
        "working_class_labor"
      ]
    },
    "kentucky_steel": {
      "title": "Kentucky Steel",
      "status": "private",
      "lyrics": "Verse 1\nBorn in the shadow of a coal-black vein,\nWhere the hollers weep and the skies bleed rain.\nDad’s fists were iron, his heart cold stone,\nBut I carved my soul from the roots I’ve known.\nPre-Chorus\nRaised by dust and gospel’s steady call,\nForged in shafts where shadows crawl,\nMy will hammered into iron walls.\nChorus\nForged in the hills where the wild winds howl,\nRaised by the mines and the gospel sound.\nI got coal dust blood and a hammer for a will—\nThis heart don’t break—it’s Kentucky steel.\nVerse 2\nSweat and grit built these hands of mine,\nCrawled through darkness for a dollar’s shine.\nEvery scar’s a story, every ache a fight,\nI’m standin’ tall in the fading light.\nPre-Chorus\nRaised by dust and gospel’s steady call,\nForged in shafts where shadows crawl,\nMy will hammered into iron walls.\nChorus\nForged in the hills where the wild winds howl,\nRaised by the mines and the gospel sound.\nI got coal dust blood and a hammer for a will—\nThis heart don’t break—it’s Kentucky steel.\nBridge\nFiddle cuts sharp like a miner’s blade,\nEach note’s a fire that the pain remade.\nI’m forged from the hollers, unyielding and true,\nThis spirit’s unbreakable, and it’s carryin’ through.\nChorus\nForged in the hills where the wild winds howl,\nRaised by the mines and the gospel sound.\nI got coal dust blood and a hammer for a will—\nThis heart don’t break—it’s Kentucky steel.\nPost-Chorus\nEvery strike on steel became my song,\nEach scar a verse that made me strong,\nI stand unbroken where I belong.\nOutro \nHollers still echo, but I’m holdin’ the line,\nKentucky steel runs deep in this heart of mine.",
      "themes": [
        "abuse_trauma",
        "family",
        "faith_spirituality",
        "hometown_roots",
        "music_songwriting",
        "nature_outdoors",
        "resilience_survival",
        "working_class_labor"
      ]
    },
    "the_music": {
      "title": "The Music",
      "status": "private",
      "lyrics": "Verse 1\nI was born in a holler where the coal dust sings,\nRaised on the ache of broke-down things.\nA trailer’s shadow, a father’s fist,\nFound my salvation in a six-string’s kiss.\nHid that guitar where the floorboards creak,\nPlayed ‘til my fingers bled, too scared to speak.\nChorus\nWhen the world talks too loud for a man to pray,\nI find my gospel in the strings I play.\nSound: fall like rain on a dust-dry field—\nThe music finds the parts I forgot to heal.\nIt’s my shield, my soul, my unbroken truth,\nThe music carries me when I’m black and blue.\nVerse 2\nFound a fiddle in a dumpster, strings half-dead,\nTaught it to cry for the dreams in my head.\nPiano keys I traced on a tabletop worn,\nBuilt me a hymn where my heart was torn.\nEvery scar’s a chord, every bruise a rhyme,\nMusic’s the only thing that’s mine all the time.\nChorus\nWhen the world talks too loud for a man to pray,\nI find my gospel in the strings I play.\nSound: fall like rain on a dust-dry field—\nThe music finds the parts I forgot to heal.\nIt’s my shield, my soul, my unbroken truth,\nThe music carries me when I’m black and blue.\nBridge\nWhen the bottle’s empty and the night’s too long,\nWhen love turns to lies and the road feels wrong,\nI don’t need a preacher, don’t need a sign—\nJust a battered Martin and a melody line.\nIt pulls me through the dark, it speaks my name,\nTurns my silence to a holy flame.\nVerse 3\nNow I’m runnin’ on roads where the maps don’t go,\nChasin’ a sound only my heart knows.\nStrangers hear my voice, they feel my pain,\nSay it’s like thunder callin’ down the rain.\nBut it ain’t for them, it’s for the boy I was—\nWho found his freedom in a guitar’s buzz.\nFinal Chorus\nWhen the world talks too loud for a man to pray,\nI find my gospel in the strings I play.\nSound: fall like rain on a dust-dry field—\nThe music finds the parts I forgot to heal.\nIt’s my shield, my soul, my unbroken truth,\nThe music carries me when I’m black and blue.\nOutro\nSo let the world keep screamin’, let the shadows fall,\nThe music’s my answer, my only call.\nFrom a trailer’s ruin to a stage unknown,\nThe music’s the fire that brings me home.",
      "themes": [
        "abuse_trauma",
        "family",
        "faith_spirituality",
        "freedom_wandering",
        "heartbreak_loss",
        "hometown_roots",
        "love_romance",
        "music_songwriting",
        "nature_outdoors",
        "resilience_survival",
        "working_class_labor"
      ]
    },
    "when_mountains_weep": {
      "title": "When Mountains Weep",
      "status": "private",
      "lyrics": "[Verse 1]\nCoal dust settles where the pines grow thin\nHollers whisper of the hurt within\nGraves unmarked beneath the ridge’s weight\nHold the dreams that time forgot to save\n[Pre-Chorus]\nRivers carve the scars my fathers wore\nSilent hollers crying out once more\nStone and sweat forever at war\n[Chorus]\nThe hollers cry where the coal veins died\nThe rivers mourn where our fathers lied\nWhen blood stains stone and secrets keep\nEven the mountains, even they weep\n[Verse 2]\nMama’s prayers sank in the valley’s shade\nPappa’s hands broke for the debts unpaid\nTheir ghosts still walk where the wildflowers fade\nIn the shadow of the lives they made\n[Pre-Chorus]\nRivers carve the scars my fathers wore\nSilent hollers crying out once more\nStone and sweat forever at war\n[Chorus]\nThe hollers cry where the coal veins died\nThe rivers mourn where our fathers lied\nWhen blood stains stone and secrets keep\nEven the mountains, even they weep\n[Bridge]\nEvery seam I crawled, I learned their pain\nEvery callus holds a family’s chain\nBetrayed by love, by land, by greed\nI sing for souls this world don’t need\n[Post-Chorus]\nWind carries tales of loss and shame\nEach echo bearing an unspoken name\nI sing their sorrow into lasting flame\n[Chorus]\nThe hollers cry where the coal veins died\nThe rivers mourn where our fathers lied\nWhen blood stains stone and secrets keep\nEven the mountains, even they weep\n[Outro]\nBeneath the peaks where the silence sleeps\nEven the mountains, even they weep",
      "themes": [
        "abuse_trauma",
        "family",
        "faith_spirituality",
        "heartbreak_loss",
        "hometown_roots",
        "love_romance",
        "music_songwriting",
        "nature_outdoors",
        "working_class_labor"
      ]
    },
    "hollow_turns_hallelujah": {
      "title": "Hollow Turns Hallelujah",
      "status": "private",
      "lyrics": "Hollow Turns Hallelujah\nVerse 1\nBoot prints fading, desert moon hanging low\nGuard duty whispers, stories we all know\nChopper blades turning, a melancholic drone\nThe campfire's out, brothers gone, too soon flown\nVerse 2\nWe built our bunkers, sandbags stacked up high\nDreamed of homecomings 'neath a foreign sky\nShared our rations, stories raw and true\nNow the echoes fade, a future we couldn't view\nChorus\nBut the hollow turns hallelujah, in the quiet of the years\nA symphony of service, washed away by bittersweet tears\nWe raise our voices, cracked and worn, a campfire choir once more\nSingin' hymns of resilience, from the scars that we bore\nVerse 3\nRifle shots echo, a bugle out of tune\nForgotten faces flicker beneath the desert moon\nThe camaraderie lingers, a ghost in the desert air\nA reminder of courage, a burden that we share\nBridge\nWe scattered like shrapnel, on the winds of war we flew\nChasing a mission's purpose, some lost, some seeing it through\nBut the bonds run deep, beneath the surface they reside\nBound by the campfire's glow, where our brothers' spirits abide\nChorus\nAnd the hollow turns hallelujah, in the quiet of the years\nA symphony of service, washed away by bittersweet tears\nWe raise our voices, cracked and worn, a campfire choir once more\nSingin' hymns of resilience, from the scars that we bore\nOutro\nHallelujah, hallelujah, from the hollow we rise\nHallelujah, hallelujah, with strength in our eyes\nThe campfire's memory burns, a beacon in the night\nGuiding us home, bathing our souls in its light.\nHallelujah.",
      "themes": [
        "abuse_trauma",
        "faith_spirituality",
        "heartbreak_loss",
        "hometown_roots",
        "music_songwriting",
        "nature_outdoors",
        "nostalgia",
        "resilience_survival"
      ]
    },
    "morning_after_rain": {
      "title": "Morning After Rain",
      "status": "private",
      "lyrics": "Morning After Rain\n(Verse 1)\nSunrise paints the valley gold, a mist hangs in the air\nThe creek bed whispers stories of the flood that raged through there\nThe earth drinks deep, the thirsty roots, reach down for grace anew\nAnd I remember every tear, that washed over me and you\n(Chorus)\nMorning after rain, the scars begin to bloom\nWildflowers in the canyons, pushing through the gloom\nBroken branches reach for light, a testament of will\nMorning after rain, His mercy fills me still\n(Verse 2)\nThe wind chimes sing a gentle song, a melody of peace\nThe broken fence post stands alone, a reminder grief will cease\nThe scent of honeysuckle sweet, a promise on the breeze\nThat even in the deepest hurt, there's solace in the trees\n(Bridge)\nI used to hide the broken parts, afraid to let them show\nBut every crack and every line, is how I learn to grow\nThe storm may rage, the thunder roar, but faith will see me through\n'Cause even shattered pieces, can reflect the morning dew\n(Chorus)\nMorning after rain, the scars begin to bloom\nWildflowers in the canyons, pushing through the gloom\nBroken branches reach for light, a testament of will\nMorning after rain, His mercy fills me still\n(Outro)\nMorning after rain, the sun breaks through the clouds\nMorning after rain, His love shouts out aloud.\nMorning after rain.",
      "themes": [
        "abuse_trauma",
        "faith_spirituality",
        "heartbreak_loss",
        "love_romance",
        "music_songwriting",
        "nature_outdoors",
        "nostalgia",
        "resilience_survival"
      ]
    },
    "wildflower_heart": {
      "title": "Wildflower Heart",
      "status": "private",
      "lyrics": "Title:  Wildflower Heart\n(Verse 1)\nGrandma's china, chipped and worn\nSitting pretty on a shelf, a life adorned\nWith stories whispered, dreams untold\nA legacy of strength, a heart of gold\nBut I wasn't born for porcelain and lace\nThis restless spirit needed open space\nTo find my own voice, my own design\nA different kind of beauty, a wilder vine\n(Chorus)\nI'm a wildflower heart, blooming late\nReaching for the sun, defying fate\nBreaking free from fences, painted white\nDancing in the moonlight, bathed in silver light\nI'm a wildflower heart, finally free\nThis untamed spirit, that's the real me\n(Verse 2)\nMama's wisdom, etched in lines\nOn her hands that worked, through sun and shine\nShe taught me kindness, grace, and how to pray\nBut sometimes silence stole my words away\nI traded whispers for a roaring sound\nMy roots ran deeper in unturned ground\nWhere shadows danced and secrets grew\nAnd I discovered truths, mama never knew\n(Bridge)\nMaybe it's the wind that carries seeds of change\nAcross the generations, rearranging\nThe patterns of our lives, the paths we roam\nUntil we finally find our way back home\nTo the heart that beats within, wild and strong\nWhere we belong, where we've belonged all along\n(Chorus)\nI'm a wildflower heart, blooming late\nReaching for the sun, defying fate\nBreaking free from fences, painted white\nDancing in the moonlight, bathed in silver light\nI'm a wildflower heart, finally free\nThis untamed spirit, that's the real me\n(Outro)\nYeah, this wildflower heart, it's finally free\nBlooming bright, for everyone to see\nThis untamed spirit, that's the real me\nThe real me.",
      "themes": [
        "abuse_trauma",
        "family",
        "faith_spirituality",
        "freedom_wandering",
        "hometown_roots",
        "love_romance",
        "music_songwriting",
        "nature_outdoors",
        "resilience_survival",
        "working_class_labor"
      ]
    },
    "church_of_country": {
      "title": "Church of Country",
      "status": "private",
      "lyrics": "Verse 1\nI hit the stage on red dirt, where the heartland’s callin’ me,\nFrom dive bar smoke to stadiums, this is where I’m free.\nHank’s ghost in my guitar, Dolly’s shine in my soul,\nCountry’s fire in my bones, it’s the only life I know.\n\nPre-Chorus\nSteel guitars are my pulpit, banjo’s my battle cry,\nEvery scar’s a song I sing, reachin’ for the sky.\n\nChorus\nThis is the Church of Country, where the faithful raise a spark,\nJohnny’s growl, Shania’s strut, lightin’ up the dark.\nSing for Patsy, for Stapleton, let the fiddle break the chains,\nCountry’s pulse is beatin’ loud, runnin’ wild in our veins!\n\nVerse 2\nI’m singin’ Loretta’s truth, Willie’s ramblin’ road,\nGeorge Jones’ whiskey heartache, carryin’ the load.\nFrom Waylon’s outlaw thunder to Miranda’s rebel flame,\nEvery note’s my hallelujah, country’s my true name.\n\nPre-Chorus\nBoots stomp the rhythm, my voice’ll shake the ground,\nIn this Church of Country, salvation’s what I’ve found.\n\nChorus\nThis is the Church of Country, where the faithful raise a spark,\nJohnny’s growl, Shania’s strut, lightin’ up the dark.\nSing for Patsy, for Stapleton, let the fiddle break the chains,\nCountry’s pulse is beatin’ loud, runnin’ wild in our veins!\n\nBridge\nIt’s a honky-tonk redemption, where the broken find their fight,\nCash’s truth, Kacey’s grace, guidin’ me through the night.\nFrom backroad hymns to neon dreams, I’ll carry on the sound,\nCountry’s heart is mine to hold, forever glory-bound!\n\nFinal Chorus\nThis is the Church of Country, where the roots will never fade,\nLoretta’s coal dust soul, Alan’s river escapade.\nRaise a glass for every dreamer, let the banjo’s fire roar,\nCountry’s callin’ me to sing, now and evermore!\n\nOutro\n*(Fiddle tears the roof off, steel guitar screams)*\nChurch of Country, hear my voice, let the whole world know,\nThis is my salvation, where my rebel heart’ll go!\n*(Pyro pops, crowd roars)*\nHallelujah, country soul, Alex takes the show!",
      "themes": [
        "abuse_trauma",
        "bar_setting",
        "faith_spirituality",
        "freedom_wandering",
        "heartbreak_loss",
        "hometown_roots",
        "music_songwriting",
        "nature_outdoors",
        "partying_celebration",
        "rebellion_outlaw",
        "resilience_survival",
        "working_class_labor"
      ]
    },
    "coal_dust_sunrise": {
      "title": "Coal Dust Sunrise",
      "status": "private",
      "lyrics": "Long shadows creep on the valley floor,\nAs the bleeding sky unveils what's in store.\nA cold breath sighs through the hollows deep,\nWhere old dreams stir and new promises keep.\nA shack stands weathered, a whisper of gray,\nBut a tender warmth chases shadows away.\nA soft hymn rises on the morning's chill,\nA silent plea, standing perfectly still.\n(Pre-Chorus)\nBeneath the grit, a spark ignites,\nChasing the ghosts of endless nights.\nThis ain't no Eden, raw and deep,\nBut promises the weary keep.\n(Chorus)\nThese coal dust sunrises, they stain the peaks in gray,\nBut hope's true fire still finds a way, yeah, it always finds a way.\nThe tired earth groans, a haunting, low refrain,\nYet grit-worn hands find strength to rise and live again.\nTo rise and breathe again.\n(Verse 2)\nThe earth gives freely, then demands its toll,\nEach dawn a testament to body and soul.\nRedemption's whisper in the morning's light,\nA bruising struggle, a constant, inner fight.\nA flicker of grace, a beacon in the night,\nA stubborn promise burning ever so bright.\nThe scars remain, a map of every pain,\nBut the spirit's song, a fierce, unbroken strain.\n(Pre-Chorus)\nBeneath the grit, a spark ignites,\nChasing the ghosts of endless nights.\nThis ain't no Eden, raw and deep,\nBut promises the weary keep.\n(Chorus)\nThese coal dust sunrises, they stain the peaks in gray,\nBut hope's true fire still finds a way, yeah, it always finds a way.\nThe tired earth groans, a haunting, low refrain,\nYet grit-worn hands find strength to rise and live again.\nTo rise and breathe again.\n(Bridge)\nThe mountain stands, a titan through the years,\nSwallowing hardship, conquering all fears.\nThis ain't the ending, just a beat in between,\nA chance to reclaim, to heal, to be seen.\n(Chorus)\nThese coal dust sunrises, they stain the peaks in gray,\nBut hope's true fire still finds a way, yeah, it always finds a way.\nThe tired earth groans, a haunting, low refrain,\nYet grit-worn hands find strength to rise and live again.\nTo rise and breathe again.\n(Outro)\nTo rise and breathe again,\nA coal dust sunrise, and we're all risin' again.",
      "themes": [
        "abuse_trauma",
        "faith_spirituality",
        "heartbreak_loss",
        "hometown_roots",
        "music_songwriting",
        "nature_outdoors",
        "resilience_survival",
        "working_class_labor"
      ]
    },
    "soul_food": {
      "title": "Soul Food",
      "status": "private",
      "lyrics": "Verse 1\nWalked through the door, grease poppin’ in the air,\nCornbread steamin’, love’s everywhere.\nMama’s in the kitchen, stirrin’ up a spell,\nPlates piled high, where the heart can dwell.\n\nChorus\nSoul food, oh, it’s lard and grace!\nFills my mind, my soul, my face!\nFrom the skillet to the heart, it’s healin’ me whole,\nSoul food, feedin’ body and soul!\n\nVerse 2\nCollard greens simmer, black-eyed peas sing,\nEvery bite’s a prayer, makes the spirit swing.\nRound that table, laughin’, stories unfold,\nWarmin’ up the weary, worth more than gold.\n\nChorus\nSoul food, oh, it’s lard and grace!\nFills my mind, my soul, my face!\nFrom the skillet to the heart, it’s healin’ me whole,\nSoul food, feedin’ body and soul!\n\nBridge\nPass the biscuits, pour the gravy high,\nFeel the love that lifts you to the sky!\nIn this sacred spot, where the good times roll,\nLard and grace gonna save your soul!\n\nChorus\nSoul food, oh, it’s lard and grace!\nFills my mind, my soul, my face!\nFrom the skillet to the heart, it’s healin’ me whole,\nSoul food, feedin’ body and soul!\n\nOutro\n(Claps, hollers, gospel hum)\nSoul food, yeah, it’s where I’m found,\nLard and grace, in that holy ground!",
      "themes": [
        "family",
        "faith_spirituality",
        "hometown_roots",
        "love_romance",
        "music_songwriting",
        "nostalgia",
        "partying_celebration"
      ]
    },
    "runnin_late_to_church": {
      "title": "Runnin’ Late to Church",
      "status": "private",
      "lyrics": "Verse 1\nWoke up with a stranger, tangled in the sheets,\nLipstick on my collar, boots stillMayor’s weight on my feet.\nClock’s tickin’ past nine, preacher’s gonna frown,\nGot a potluck dish to save my soul in this town.\n\nChorus\nRunnin’ late to church, with a sinner’s grin,\nLast night’s whiskey still burnin’ deep within.\nTater casserole’s ridin’ shotgun in my truck,\nPrayin’ for grace, hopin’ for luck.\n\nVerse 2\nHer perfume’s on my shirt, can’t shake the devil’s sway,\nDashboard Jesus judgin’ every mile I stray.\nGravy flies, I’m speedin’ down that old dirt road,\nGotta get to service ‘fore the choir sings.\n\nChorus\nRunnin’ late to church, with a sinner’s grin,\nLast night’s whiskey still burnin’ deep within.\nTater casserole’s ridin’ shotgun in my truck,\nPrayin’ for grace, hopin’ for luck.\n\nBridge\nBarstool confessions won’t cleanse my soul,\nBut a pan of cornbread might make the preacher whole.\nSlide in the back pew, dodge the deacon’s stare,\nLord, forgive me, I’m almost there.\n\nChorus\nRunnin’ late to church, with a sinner’s grin,\nLast night’s whiskey still burnin’ deep within.\nTater casserole’s ridin’ shotgun in my truck,\nPrayin’ for grace, hopin’ for luck.\n\nOutro\n(Claps, hollers, banjo twang)\nLate to church, but I’m here with my dish,\nSaved by the potluck, thank God for this wish!",
      "themes": [
        "bar_setting",
        "faith_spirituality",
        "hometown_roots",
        "love_romance",
        "partying_celebration",
        "rebellion_outlaw"
      ]
    }
  }
}