{
  "venue_type": "dive_bar",
  "song_count": 13,
  "songs": {
    "a_song_and_a_beer": {
      "title": "A Song and a Beer",
      "status": "private",
      "lyrics": "Verse 1\nDive bar buzzing, the city's aglow,\nPlaylist spinning songs we all know.\nBartender smiling, hands me a drink,\nTonight’s for forgetting, no time to think.\nPre-Chorus\nWearing life's marks, but the road stays clear,\nAll we need is good company and beer.\nChorus\nGive me a song and a beer, let the music play low,\nSing me a story everybody knows.\nThrough highs and lows, we find comfort right here,\nLife’s always better with a song and a beer.\nVerse 2\nWe share our laughter, let the heartaches unwind,\nMelodies lifting our hearts and our minds.\nRaise a toast to the good times we've had,\nTonight’s for the living, not feeling sad.\nPre-Chorus\nLife leaves its marks, but our spirits stay clear,\nGathered together with music and beer.\nChorus\nGive me a song and a beer, let the music play low,\nSing me a story everybody knows.\nThrough highs and lows, we find comfort right here,\nLife’s always better with a song and a beer.\nBridge\nEvery lyric’s a memory, each chorus our bond,\nFriendship and freedom, the music rolls on.\nThis place isn’t just bricks, it’s a feeling inside,\nStories unfolding beneath city lights.\nChorus\nGive me a song and a beer, let the music play low,\nSing me a story everybody knows.\nThrough highs and lows, we find comfort right here,\nLife’s always better with a song and a beer.\nOutro\nLift a glass to the night, watch the worries disappear,\nEverything’s alright with a song and a beer.",
      "themes": [
        "bar_setting",
        "freedom_wandering",
        "music_songwriting",
        "nostalgia",
        "partying_celebration",
        "resilience_survival"
      ]
    },
    "be_better_for_the_next_guy": {
      "title": "Be Better for the Next Guy",
      "status": "private",
      "lyrics": "Verse 1\nI’m three whiskeys deep, flingin’ darts at the back wall,\nLaughin’ at your name etched on my shot glass.\nNo more lonely nights curled up by the telephone—\nI’ve found new roads past the diner where we fought.\nChorus\nSo here’s to you, sweeter than cherry pie—\nHope he buys those roses you let wither and die.\nWhen he’s pourin’ out his heart baby-blue, don’t make him cry—\nBe better for the next guy.\nVerse 2\nI’ll catch her eye across the bar when the jukebox spins our song,\nShe’ll think you’re heaven ’til your lies come undone.\nI’ll lift her up with shots of bourbon ’til she’s singin’ along,\nWhile you learn too late how to love someone.\nChorus (variation)\nSo here’s to you, spicier than a jalapeño—\nHope he feels the jagged scars you left on my chest.\nWhen he’s pouring out his soul, don’t put it to the test—\nBe better for the next guy.\nVerse 3\nSaw you last weekend at the state fair midway,\nYour eyes lit up just like they did back then.\nHe wore that nervous grin I know all too well—\nYou led him ’round like he was your only friend.\nOne prayer for that poor boy’s all I’ve got to give—\nMay you hold his hand tighter than you ever held mine.\nBridge\nAnd if he wakes up cold in your empty bed,\nOr finds your lipstick stains on someone else instead,\nTell him to head back to this Tennessee roadhouse—\nWhere broken hearts learn how to lose and forget.\nFinal Chorus\nSo here’s to you, sweeter than a Georgia peach—\nDon’t leave him sobbin’ under that big open sky.\nWhen he’s layin’ down his love, make sure you don’t lie—\nBe better for the next guy.",
      "themes": [
        "abuse_trauma",
        "bar_setting",
        "heartbreak_loss",
        "hometown_roots",
        "love_romance",
        "music_songwriting"
      ]
    },
    "born_in_hell": {
      "title": "Born in Hell",
      "status": "private",
      "lyrics": "Verse 1\nCoal dust in my lungs, blood on the floor,\nDad’s fists kept time with the slam of the door.\nBorn in a town where the devil holds sway,\nI learned to take hits ‘fore I learned how to pray.\nPre-Chorus\nNo mercy in his eyes, no warmth in that house,\nJust a boy dodgin’ shadows, quiet as a mouse.\nChorus\nBorn in hell, where the sun don’t shine,\nTook my beatings daily, paid for his cheap wine.\nKicked out at sixteen, worked the mines to survive,\nIn the dark of that town, I kept my soul alive.\nVerse 2\nSchool by day, mines by night, no time to dream,\nRented a room with walls thin as a scream.\nSweat and black soot, my hands turned to stone,\nCarried my books and my scars all alone.\nPre-Chorus\nNo mother to hold me, no father to care,\nJust the weight of the world and the cold mountain air.\nChorus\nBorn in hell, where the sun don’t shine,\nTook my beatings daily, paid for his cheap wine.\nKicked out at sixteen, worked the mines to survive,\nIn the dark of that town, I kept my soul alive.\nBridge\nEvery bruise was a map of the hell I called home,\nEvery shift in the dark taught me how to roam.\nI wasn’t born to break, though they tried to bend,\nFound a spark in my heart that no devil could end.\nChorus\nBorn in hell, where the sun don’t shine,\nTook my beatings daily, paid for his cheap wine.\nKicked out at sixteen, worked the mines to survive,\nIn the dark of that town, I kept my soul alive.\nOutro\n*(Slow picking: E|-3---3---|)*\nBorn in hell… but I’m still breathin’",
      "themes": [
        "abuse_trauma",
        "bar_setting",
        "family",
        "faith_spirituality",
        "freedom_wandering",
        "hometown_roots",
        "nature_outdoors",
        "rebellion_outlaw",
        "resilience_survival",
        "working_class_labor"
      ]
    },
    "love_aint_enough": {
      "title": "Love Ain’t Enough",
      "status": "private",
      "lyrics": "Verse 1\nScreen lit up, your face in the glow,\nLaughin’ with shadows I ain’t meant to know.\nWhiskey’s burnin’, but it don’t kill the pain,\nYour voice, their hands, it’s tearin’ up my brain.\nPre-Chorus\nI trusted your lies, fell for every word,\nNow I’m drownin’ in the truth I wish I hadn’t heard.\nChorus\nYou gave me forever, but you meant it for a while —\nI gave you my heart, you gave me back a smile.\nLove isn’t enough when the storm clouds come —\nIt’s a promise in the sunlight, but it’s gone by the dawn.\nVerse 2\nI blocked your ass faster than a bullet leaves a gun,\nErased your sweet nothin’s, left your memory undone.\nBut this bottle’s still heavy, and the night’s still long,\nYour betrayal’s a chorus to a lonesome, bitter song.\nPre-Chorus\nI see it all now, the truth in the flame,\nBut I’m the damn fool who’s still cursin’ your name.\nChorus\nYou gave me forever, but you meant it for a while —\nI gave you my heart, you gave me back a smile.\nLove isn’t enough when the storm clouds come —\nIt’s a promise in the sunlight, but it’s gone by the dawn.\nBridge\nWas I just a spark you let burn out and fade?\nA heart you could steal, then toss in the shade?\nThis guitar’s my witness, these strings bleed my cry,\nI’m done with your games, but I’m too broke to lie.\nChorus\nYou gave me forever, but you meant it for a while —\nI gave you my heart, you gave me back a smile.\nLove isn’t enough when the storm clouds come —\nIt’s a promise in the sunlight, but it’s gone by the dawn.\nOutro\nScreen’s gone dark, but the hurt’s still alive,\nLove ain’t enough to keep this soul revived.\n*(Slow picking on low E)*\nGone by the dawn… gone by the dawn.",
      "themes": [
        "bar_setting",
        "faith_spirituality",
        "heartbreak_loss",
        "love_romance",
        "music_songwriting",
        "nature_outdoors",
        "resilience_survival"
      ]
    },
    "the_mourning_after": {
      "title": "The Mourning After",
      "status": "private",
      "lyrics": "Verse 1\nWoke up to a headache and your face in my mind,\nThat video call still burns like cheap red wine.\nI torched your old photos in a rusted tin can,\nBut your laugh keeps echoin’ through this broken man.\nPre-Chorus\nI’m half-dead, but I’m fightin’ to breathe,\nTradin’ tears for the strength to believe.\nChorus\nThe mournin’ after’s a cold, lonesome fight,\nScrapin’ up my heart in the pale morning light.\nI’m chasin’ new shadows where your ghost don’t roam,\nFindin’ my way, but I ain’t yet home.\nVerse 2\nNew bar down the highway, new smoke in the air,\nA girl’s crooked smile says she don’t know my care.\nI’m shakin’ off the weight of your cheatin’ disguise,\nBut your voice still cuts through the neon-lit skies.\nPre-Chorus\nI’m not healed, but I’m startin’ to mend,\nCarvin’ out a road where your lies gotta end.\nChorus\nThe mournin’ after’s a cold, lonesome fight,\nScrapin’ up my heart in the pale morning light.\nI’m chasin’ new shadows where your ghost don’t roam,\nFindin’ my way, but I ain’t yet home.\nBridge\nEvery mile I drive, I bury you deeper in the dust,\nEvery shot I take, I’m weldin’ back my trust.\nYour love was a blade that cut me to the core,\nBut I’m stitchin’ up my soul, I don’t need you no more.\nChorus\nThe mournin’ after’s a cold, lonesome fight,\nScrapin’ up my heart in the pale morning light.\nI’m chasin’ new shadows where your ghost don’t roam,\nFindin’ my way, but I ain’t yet home.\nOutro\nNew dives, new dawns, new battles to win,\nThe mournin’ after’s where I’m learnin’ to begin.\n*(Slow picking: E|-3---3---|)*\nMournin’ after you… I’m startin’ again.",
      "themes": [
        "abuse_trauma",
        "bar_setting",
        "faith_spirituality",
        "freedom_wandering",
        "heartbreak_loss",
        "hometown_roots",
        "love_romance",
        "nature_outdoors",
        "nostalgia",
        "resilience_survival"
      ]
    },
    "hell_and_hymns": {
      "title": "Hell and Hymns",
      "status": "private",
      "lyrics": "Verse 1\nFriday night, under neon’s roar,\nWhiskey’s pullin’ hard, settlin’ old scores.\nJukebox wails, hearts hit the floor,\nDancin’ through the haze, chasin’ something more.\nAnother week of grind, bones worn thin,\nSweat still burns where the work don’t end.\nBut tonight we’re alive, breakin’ every chain,\n‘Til the sunrise lights the sky with flame.\nPre-Chorus\nRunnin’ wild, but the soul’s still split,\nTorn between the dark and the holy lit.\nChorus\nHell and hymns, we’re caught in the fray,\nWhiskey sins, then we kneel to pray.\nThis heart keeps fightin’, searchin’ for release,\nBetween the devil’s fire and a savior’s peace.\nHell and hymns, our anthem’s cry,\nSaturday’s rebellion, Sunday’s sky.\nRisin’ from the ashes ‘neath a lonesome moon,\nLord, redeem these hands, scarred and strewn.\nVerse 2\nGuitar moans a lonesome plea,\nEmpty bottle spins, hauntin’ memories.\nFound that six-string in a junkyard’s shine,\nStrummed my soul where the wild winds whine.\nOld man’s shadow still stalks my days,\nHis bitter words like a hell that stays.\nBut mama’s prayers, they pull me through,\nWhisperin’ hope in the morning dew.\nPre-Chorus\nLivin’ rough, but the heart holds strong,\nSeekin’ light where the nights are long.\nChorus\nHell and hymns, we’re caught in the fray,\nWhiskey sins, then we kneel to pray.\nThis heart keeps fightin’, searchin’ for release,\nBetween the devil’s fire and a savior’s peace.\nHell and hymns, our anthem’s cry,\nSaturday’s rebellion, Sunday’s sky.\nRisin’ from the ashes ‘neath a lonesome moon,\nLord, redeem these hands, scarred and strewn.\nBridge\nNo preacher’s verse, just a worker’s call,\nCoal-dust dreams climbin’ past the fall.\nBeggin’ for a spark to break the night,\nFrom the shadows to salvation’s light.\nChorus\nHell and hymns, we’re caught in the fray,\nWhiskey sins, then we kneel to pray.\nThis heart keeps fightin’, searchin’ for release,\nBetween the devil’s fire and a savior’s peace.\nHell and hymns, our anthem’s cry,\nSaturday’s rebellion, Sunday’s sky.\nRisin’ from the ashes ‘neath a lonesome moon,\nLord, redeem these hands, scarred and strewn.\nOutro\n*(Fiddle soar, steady strum)*\nHell and hymns, my soul’s still tried,\nBut I’m risin’ up where the heart don’t hide.\nAmen.",
      "themes": [
        "abuse_trauma",
        "bar_setting",
        "family",
        "faith_spirituality",
        "heartbreak_loss",
        "music_songwriting",
        "nature_outdoors",
        "nostalgia",
        "partying_celebration",
        "rebellion_outlaw",
        "resilience_survival",
        "working_class_labor"
      ]
    },
    "when_you_cant_be_near_me": {
      "title": "When You Can't Be Near Me",
      "status": "private",
      "lyrics": "(Verse 1) When you can't be near me, please think of me, I'm starin' at the highway, where you used to be. You're gone, my darlin', chasin' some new flame, But my heart's still ramblin', callin' out your name.\n(Pre-Chorus) This whiskey's cold, it don't ease the pain, Without you here, I'm half insane.\n(Chorus) When you can't be near me, oh, my lonesome soul, Keep me in your rearview, where the heartaches roll. Sing my name like a jukebox, broken, wild, and free, When you can't be near me, please think of me.\n(Verse 2) I'm thumbin' through old photos, on this cracked phone screen, Your smile's a ghost now, in this lonesome scene. Got your voice in my head, like a steel guitar's cry, Keeps me holdin' on, beneath this empty sky.\n(Pre-Chorus) The barstool's creakin', but it ain't my home, Without your touch, I'm destined to roam.\n(Chorus) When you can't be near me, oh, my lonesome soul, Keep me in your rearview, where the heartaches roll. Sing my name like a jukebox, broken, wild, and free, When you can't be near me, please think of me.\n(Bridge) So raise a glass, wherever you ride, Send a prayer on the wind, to the lonesome side. We'll cross paths again, down some dusty road, Till then, I'm carryin' this heavy load.\n(Chorus) When you can't be near me, oh, my lonesome soul, Keep me in your rearview, where the heartaches roll. Sing my name like a jukebox, broken, wild, and free, When you can't be near me, please think of me.\n(Outro) So when you're out there, under neon's glow, I'm still your rebel, in the shadows, you know. Till we're back together, where we're meant to be, When you can't be near me... please think of me. Yeah, think of me. (Oh, my lonesome soul.) Think of me.",
      "themes": [
        "abuse_trauma",
        "bar_setting",
        "faith_spirituality",
        "freedom_wandering",
        "heartbreak_loss",
        "hometown_roots",
        "love_romance",
        "music_songwriting",
        "nature_outdoors",
        "nostalgia",
        "partying_celebration",
        "rebellion_outlaw"
      ]
    },
    "whiskey_dont_lie": {
      "title": "Whiskey Don't Lie",
      "status": "private",
      "lyrics": "(Verse 1)\nI’m sittin’ at this barstool, with a neon glow,\nPourin’ out my heartache, where the jukebox flows.\nThe bartender knows me, he don’t ask my name,\nJust slides another whiskey, to kill the pain.\n(Pre-Chorus)\nThis dive bar’s my church, where the sinners pray,\nSpillin’ out their stories, till the break of day.\n(Chorus)\nWhiskey don’t lie, it tells it straight,\nBurns like the truth, no need to wait!\nRaise your glass high, let the heartache fly,\nSing it loud, boys, whiskey don’t lie!\n(Verse 2)\nThe gal I loved, she’s gone, took my ramblin’ heart,\nLeft me with this bottle, and a brand-new scar.\nBut this amber fire, it don’t judge my sins,\nJust lights up the shadows, where my night begins.\n(Pre-Chorus)\nThe jukebox is wailin’, but it can’t compare,\nTo the truth in this glass, and the pain we share.\n(Chorus)\nWhiskey don’t lie, it tells it straight,\nBurns like the truth, no need to wait!\nRaise your glass high, let the heartache fly,\nSing it loud, boys, whiskey don’t lie!\n(Bridge)\nSo here’s to the lost, and the ones we miss,\nTo the fights and the nights, sealed with a kiss.\nEvery drop’s a preacher, every sip’s a song,\nSing it with me, brothers, we’ll howl all night long!\n(Chorus)\nWhiskey don’t lie, it tells it straight,\nBurns like the truth, no need to wait!\nRaise your glass high, let the heartache fly,\nSing it loud, boys, whiskey don’t lie!\n(Outro)\nWhen the barroom’s empty, and the stars burn low,\nI’ll stumble to the highway, with nowhere to go.\nBut I’ll carry this gospel, till the day I die,\nSing it one more time—whiskey don’t lie!\nYeah, whiskey don’t lie! (Raise ‘em up high!)\nWhiskey don’t lie!\nAcoustic sound: A stripped-down, raw acoustic arrangement with a steady strumming pattern highlights the song's heartache, while a mournful fiddle weaves in and out, emphasizing the lament. The vocal delivery is gritty and vulnerable, carrying the story's emotional weight with a conversational honesty.\nPotential Sound:\nOutlaw Country Vibe: The song channels the raw, rebellious spirit of outlaw country with vivid imagery (neon, jukeboxes, barstools) and a narrator who’s both broken and defiant. The whiskey serves as a metaphor for unfiltered truth, tying into the genre’s honesty. Singalong Energy: The repetitive chorus (“Whiskey don’t lie, it tells it straight”) and simple, anthemic hooks are designed for a crowd to shout along, with gang vocals and a bridge that rallies everyone to join in. Modern Touches: References to phones or modern heartbreak are subtle, keeping the focus on timeless barroom camaraderie, but the tone feels relatable for 2025. Performance: Picture this in a sweaty honky-tonk or a modern country musical, with a charismatic frontman leading a raucous band (electric guitar, fiddle, piano, drums). The crowd stomps boots, clinks bottles, and sings the chorus at the top of their lungs.",
      "themes": [
        "abuse_trauma",
        "bar_setting",
        "faith_spirituality",
        "freedom_wandering",
        "heartbreak_loss",
        "love_romance",
        "music_songwriting",
        "nature_outdoors",
        "partying_celebration",
        "rebellion_outlaw"
      ]
    },
    "under_a_southern_sky": {
      "title": "Under a Southern Sky",
      "status": "private",
      "lyrics": "(Verse 1)\nI was runnin’ on empty, down a two-lane road,\nChasin’ whiskey sunsets, with a heavy load.\nLeft my dreams in a dive bar, thought I’d lost my way,\nTill your smile lit the darkness, like a summer day.\n(Pre-Chorus)\nThis old heart was wanderin’, till you called my name,\nNow I’m standin’ in the starlight, and I’ll never be the same.\n(Chorus)\nI find my heart, find my soul, find you under a southern sky,\nWhere the pines whisper secrets, and the fireflies fly.\nWith your hand in mine, I’m alive, I’m whole,\nI find my heart, find my soul, under a southern sky.\n(Verse 2)\nWe danced in the moonlight, by a creek’s soft hum,\nBarefoot on the red dirt, to a banjo’s strum.\nYour laughter’s my compass, through the highs and lows,\nYou’re the home I never knew, where my restless spirit goes.\n(Pre-Chorus)\nNo more lone-star highways, no more lonesome fights,\nYou’re my rebel redemption, in the glow of the night.\n(Chorus)\nI find my heart, find my soul, find you under a southern sky,\nWhere the pines whisper secrets, and the fireflies fly.\nWith your hand in mine, I’m alive, I’m whole,\nI find my heart, find my soul, under a southern sky.\n(Bridge)\nWe’ve got scars from the battles, we’ve got stories to tell,\nFrom the honky-tonk heartaches to the heavens we fell.\nBut under these stars, with you by my side,\nI’ve found my forever, on this wild, sweet ride.\n(Chorus)\nI find my heart, find my soul, find you under a southern sky,\nWhere the pines whisper secrets, and the fireflies fly.\nWith your hand in mine, I’m alive, I’m whole,\nI find my heart, find my soul, under a southern sky.\n(Outro)\nSo let’s chase the horizon, where the dawn breaks wide,\nWith you, I’m unbroken, on this southern sky ride.\nI find my heart, find my soul, forever you and I,\nUnder a southern sky… under a southern sky.",
      "themes": [
        "abuse_trauma",
        "bar_setting",
        "faith_spirituality",
        "freedom_wandering",
        "heartbreak_loss",
        "hometown_roots",
        "love_romance",
        "music_songwriting",
        "nature_outdoors",
        "rebellion_outlaw",
        "resilience_survival"
      ]
    },
    "church_of_country": {
      "title": "Church of Country",
      "status": "private",
      "lyrics": "Verse 1\nI hit the stage on red dirt, where the heartland’s callin’ me,\nFrom dive bar smoke to stadiums, this is where I’m free.\nHank’s ghost in my guitar, Dolly’s shine in my soul,\nCountry’s fire in my bones, it’s the only life I know.\n\nPre-Chorus\nSteel guitars are my pulpit, banjo’s my battle cry,\nEvery scar’s a song I sing, reachin’ for the sky.\n\nChorus\nThis is the Church of Country, where the faithful raise a spark,\nJohnny’s growl, Shania’s strut, lightin’ up the dark.\nSing for Patsy, for Stapleton, let the fiddle break the chains,\nCountry’s pulse is beatin’ loud, runnin’ wild in our veins!\n\nVerse 2\nI’m singin’ Loretta’s truth, Willie’s ramblin’ road,\nGeorge Jones’ whiskey heartache, carryin’ the load.\nFrom Waylon’s outlaw thunder to Miranda’s rebel flame,\nEvery note’s my hallelujah, country’s my true name.\n\nPre-Chorus\nBoots stomp the rhythm, my voice’ll shake the ground,\nIn this Church of Country, salvation’s what I’ve found.\n\nChorus\nThis is the Church of Country, where the faithful raise a spark,\nJohnny’s growl, Shania’s strut, lightin’ up the dark.\nSing for Patsy, for Stapleton, let the fiddle break the chains,\nCountry’s pulse is beatin’ loud, runnin’ wild in our veins!\n\nBridge\nIt’s a honky-tonk redemption, where the broken find their fight,\nCash’s truth, Kacey’s grace, guidin’ me through the night.\nFrom backroad hymns to neon dreams, I’ll carry on the sound,\nCountry’s heart is mine to hold, forever glory-bound!\n\nFinal Chorus\nThis is the Church of Country, where the roots will never fade,\nLoretta’s coal dust soul, Alan’s river escapade.\nRaise a glass for every dreamer, let the banjo’s fire roar,\nCountry’s callin’ me to sing, now and evermore!\n\nOutro\n*(Fiddle tears the roof off, steel guitar screams)*\nChurch of Country, hear my voice, let the whole world know,\nThis is my salvation, where my rebel heart’ll go!\n*(Pyro pops, crowd roars)*\nHallelujah, country soul, Alex takes the show!",
      "themes": [
        "abuse_trauma",
        "bar_setting",
        "faith_spirituality",
        "freedom_wandering",
        "heartbreak_loss",
        "hometown_roots",
        "music_songwriting",
        "nature_outdoors",
        "partying_celebration",
        "rebellion_outlaw",
        "resilience_survival",
        "working_class_labor"
      ]
    },
    "coal_dust_on_the_lamb": {
      "title": "Coal Dust on the Lamb",
      "status": "private",
      "lyrics": "(Verse 1)\nSixteen summers bleedin' into fall,\nDaddy's shadow stretched across the wall.\nHis words like whiskey, burnin' down my throat,\nKicked me out to wander, wearin' a thin coat.\nPikeville hollers echoed with my shame,\nInnocence a flicker, dyin' in the flame.\n\n(Verse 2)\nFound a floor to sleep on, kindness in a stranger's eye,\nBut the mountain cold seeped in, beneath a starless sky.\nTraded school books for a pick and shovel's weight,\nCoal dust settled on my dreams, sealin' up their fate.\nThis broken arm, a constant ache, a twisted memory,\nOf a boy who used to dream beneath a dogwood tree.\n\n(Chorus)\nCoal dust on the lamb, a stain that won't come clean,\nLost my way back home, a forgotten, faded scene.\nThese coal-stained hands, they hold the weight of sin,\nPrayin' for redemption, hopin' God lets me in.\n\n(Verse 3)\nSunrise paints the mountain ridge, a fiery, bloody hue,\nAnother day of breakin' back, another debt to accrue.\nThe fields stretch out before me, endless rows of green,\nBut all I see is darkness, a fractured, broken scene.\nThis ain't the life I pictured,  beneath the mountain's gaze,\nJust a broken boy, lost in a lonely, hazy maze.\n\n(Bridge)\nMama's hymnals echo, a whisper in the wind,\nA memory of comfort, a peace I can't pretend.\nWill I ever feel that grace again, that gentle, lovin' hand?\nOr am I destined to wander, a ghost in this promised land?\n\n(Chorus)\nCoal dust on the lamb, a stain that won't come clean,\nLost my way back home, a forgotten, faded scene.\nThese coal-stained hands, they hold the weight of sin,\nPrayin' for redemption, hopin' God lets me in.\n\n(Outro)\nLord, have mercy, on this coal-stained soul,\nLead me back to the fold, make me whole. \nMake me whole.",
      "themes": [
        "abuse_trauma",
        "bar_setting",
        "family",
        "faith_spirituality",
        "freedom_wandering",
        "heartbreak_loss",
        "hometown_roots",
        "love_romance",
        "music_songwriting",
        "nature_outdoors",
        "nostalgia",
        "rebellion_outlaw",
        "working_class_labor"
      ]
    },
    "friday_night_lights_in_honky_tonk_heaven": {
      "title": "Friday Night Lights in Honky Tonk Heaven",
      "status": "private",
      "lyrics": "(Verse 1)\nSun sinkin' low, week's work is done\nDust off my boots, time for some fun\nGot my guitar, worn and well-loved\nReady to sing 'bout the heart I've been robbed\n(Chorus)\nFriday night lights in Honky Tonk Heaven, yeah\nWhiskey's flowin', music's playin' clear\nBroken hearts mendin', laughter ringin' true\nUnderneath the neon glow, me and you\n(Verse 2)\nSaw ol' Jimmy Joe, lookin' kinda blue\nLost his woman, don't know what to do\nBut tonight's for forgettin', leavin' troubles behind\nLet the music wash over, ease his weary mind\n(Chorus)\nFriday night lights in Honky Tonk Heaven, yeah\nWhiskey's flowin', music's playin' clear\nBroken hearts mendin', laughter ringin' true\nUnderneath the neon glow, me and you\n(Bridge)\nThis ain't no church, but souls find grace here\nIn the twangin' guitars and the clinking of beer\nWe share our stories, our joys and our pain\nFindin' solace 'til the sun shines again\n(Chorus)\nFriday night lights in Honky Tonk Heaven, yeah\nWhiskey's flowin', music's playin' clear\nBroken hearts mendin', laughter ringin' true\nUnderneath the neon glow, me and you\n(Outro)\nYeah, Friday night lights, burnin' bright and bold\nAnother story in this Honky Tonk's been told",
      "themes": [
        "bar_setting",
        "faith_spirituality",
        "heartbreak_loss",
        "love_romance",
        "music_songwriting",
        "partying_celebration",
        "working_class_labor"
      ]
    },
    "sound_of_silence": {
      "title": "Sound of Silence",
      "status": "private",
      "lyrics": "[Verse 1]\nOne AM, bar closed down\nTook a shot of whiskey, it ain't helpin' now\nTo shut my mind off, stop it from racin'\nI turn to what I've been chasin'\n\n[Chorus]\nThe sound of silence\nI find it on the road at night drivin'\nIn my bed when the storm is outside it\nIt's like a choir singin' to my soul\nI've been prayin' that I'll find it\nIn my head, so I can't deny it\nWhen I do, you know I'll invite it\nInto my heart and never let it go\nIt's the sound of silence\n\n[Verse 2]\n'Fore you know it, your life is half gone\nStill tryin' to figure out where you belong\nTo shut my mind off, stop it from racin'\nI turn to what I've been chasin'\n\n[Chorus]\nThe sound of silence\nI find it on the road at night drivin'\nIn my bed when the storm is outside it\nIt's like a choir singin' to my soul\nI've been prayin' that I'll find it\nIn my head, so I can't deny it\nWhen I do, you know I'll invite it\nInto my heart and never let it go\nIt's the sound of silence\n\n[Verse 3]\nEverywhere I go, everywhere I go\nIt never seems to leave me alone\nEverywhere I go, everywhere I go\nI'm drownin' in this world\n\n[Chorus]\nAnd I need the sound of silence\nI find it on the road at night drivin'\nIn my bed when the storm is outside it\nIt's like a choir singin' to my soul\nI've been prayin' that I'll find it\nIn my head, so I can't deny it\nWhen I do, you know I'll invite it\nInto my heart and never let it go\nIt's the sound of silence",
      "themes": [
        "bar_setting",
        "faith_spirituality",
        "freedom_wandering",
        "heartbreak_loss",
        "music_songwriting",
        "nature_outdoors",
        "resilience_survival"
      ]
    }
  }
}