{
  "venue_type": "stadium",
  "song_count": 11,
  "songs": {
    "born_in_hell": {
      "title": "Born in Hell",
      "status": "private",
      "lyrics": "Verse 1\nCoal dust in my lungs, blood on the floor,\nDad’s fists kept time with the slam of the door.\nBorn in a town where the devil holds sway,\nI learned to take hits ‘fore I learned how to pray.\nPre-Chorus\nNo mercy in his eyes, no warmth in that house,\nJust a boy dodgin’ shadows, quiet as a mouse.\nChorus\nBorn in hell, where the sun don’t shine,\nTook my beatings daily, paid for his cheap wine.\nKicked out at sixteen, worked the mines to survive,\nIn the dark of that town, I kept my soul alive.\nVerse 2\nSchool by day, mines by night, no time to dream,\nRented a room with walls thin as a scream.\nSweat and black soot, my hands turned to stone,\nCarried my books and my scars all alone.\nPre-Chorus\nNo mother to hold me, no father to care,\nJust the weight of the world and the cold mountain air.\nChorus\nBorn in hell, where the sun don’t shine,\nTook my beatings daily, paid for his cheap wine.\nKicked out at sixteen, worked the mines to survive,\nIn the dark of that town, I kept my soul alive.\nBridge\nEvery bruise was a map of the hell I called home,\nEvery shift in the dark taught me how to roam.\nI wasn’t born to break, though they tried to bend,\nFound a spark in my heart that no devil could end.\nChorus\nBorn in hell, where the sun don’t shine,\nTook my beatings daily, paid for his cheap wine.\nKicked out at sixteen, worked the mines to survive,\nIn the dark of that town, I kept my soul alive.\nOutro\n*(Slow picking: E|-3---3---|)*\nBorn in hell… but I’m still breathin’",
      "themes": [
        "abuse_trauma",
        "bar_setting",
        "family",
        "faith_spirituality",
        "freedom_wandering",
        "hometown_roots",
        "nature_outdoors",
        "rebellion_outlaw",
        "resilience_survival",
        "working_class_labor"
      ]
    },
    "the_devil_went_down_on_georgia": {
      "title": "The Devil Went Down on Georgia",
      "status": "private",
      "lyrics": "(inspired by but not the same music as the original )\nVerse\nThe Devil went down on Georgia,\nHe was lookin' for a soul to tease.\nHe was feelin' bold, and truth be told,\nHe was itchin' for a little release.\nWhen he came across this fiery girl,\nDancin' in the midnight air,\nThe Devil tipped his hat and said,\n\"Girl, you got that devil-may-care.\"\n\"I guess you didn't know it, but I'm a pleaser too,\" he grinned,\n\"And if you care to take a dare, I'll show you where I've been.\nNow you strut so sweet, and you taste so fine,\nI'll lay my pride upon the line —\nIf you let me under that southern sky,\nI'll show you a helluva time.\"\nGeorgia said, \"My daddy warned me 'bout your kind, you rogue,\nBut I've got a wild side too, so go on, strike your pose!\"\nShe slipped her hands along his jaw,\nAnd whispered low and sly,\n\"If you're gonna play down in my field,\nYou better kiss the ground goodbye.\"\nChorus\nFire in the bayou, heat on the breeze,\nMoonlight melting down through the trees.\nSatin and smoke, and a slow, low moan —\nThe Devil's got Georgia in a world of her own.\nThe Devil laid low with a wicked grin,\nTook his time with a Southern spin,\nEvery kiss a little sin,\nGeorgia just pulled him in.\nVerse\nWhen the morning broke through pine and oak,\nGeorgia laughed and twirled,\nShe'd played that Devil like a fiddle and bow —\nAnd she owned the whole damn world.\nHe said, \"Girl, you are a wildfire —\nYou burned me to the bone.\"\nShe just smiled and tipped her hat,\nSaid, \"That's what you get for comin' down my road.\"\n(Chorus Repeat)\nFire in the bayou, heat on the breeze,\nMoonlight melting down through the trees.\nSatin and smoke, and a slow, low moan —\nThe Devil's got Georgia in a world of her own.\n(Outro)\nThe Devil went down on Georgia,\nBut Georgia ran the show —\nShe turned that red-hot sinner\nInto a puddle on the floor.",
      "themes": [
        "faith_spirituality",
        "freedom_wandering",
        "hometown_roots",
        "love_romance",
        "music_songwriting",
        "nature_outdoors",
        "rebellion_outlaw",
        "resilience_survival",
        "working_class_labor"
      ]
    },
    "the_girl_in_the_summer_dress": {
      "title": "The Girl In The Summer Dress",
      "status": "private",
      "lyrics": "Verse 1\nShe sauntered in the diner, with a devilish sway,\nThat summer dress clingin’ in a dangerous way.\nOne wink over coffee, set my pulse to a race,\nGod makes the good stuff, and she owned that space.\nChorus\nOne look, one laugh, and the sparks flew free,\nA jolt of pure trouble meant just for me.\nHer touch was a tease, but it lit up my soul,\nThe girl in the summer dress took full control.\nVerse 2\nShe leaned in real close, stole my shades with a grin,\nHer whisper was velvet, brushed like fire on my skin.\nShe danced with a swagger, left my heart in a bind,\nOne graze of her fingers, and I lost my damn mind.\nChorus\nOne look, one laugh, and the sparks flew free,\nA jolt of pure trouble meant just for me.\nHer touch was a tease, but it lit up my soul,\nThe girl in the summer dress took full control.\nBridge\nNow the diner’s too tame, but her heat lingers on,\nThat mischievous glint in her eyes ain’t gone.\nI toast to the thrill, to the game that she played,\nOne taste of her magic, and my night was made.\nFinal Chorus\nOne look, one laugh, and I’m still feelin’ wild,\nA flash of her fire keeps this cowboy beguiled.\nHer touch was a tease, but it lit up my soul,\nThe girl in the summer dress—God, she was bold.",
      "themes": [
        "faith_spirituality",
        "love_romance",
        "partying_celebration",
        "rebellion_outlaw"
      ]
    },
    "drink_to_the_family": {
      "title": "Drink to the Family",
      "status": "private",
      "lyrics": "(Verse 1)\nDust on my boots from a road gone rough\nChased dreams that broke when the times got tough\nKin turned their backs, left scars on my hide\nBut I found my crew where the good vibes ride\nA shot of Jack burns the pain away\nThese friends are my home, they’re here to stay\n(Chorus)\nRaise a shot of Jack to the family that ain’t blood\nToast the ones who lift you from the mud\nWhen the world slams the door, they kick it in tight\nThese rowdy hearts blaze wild in the night\nHere’s to family, true and bold!\n(Verse 2)\nWorked ‘til my hands cracked, bones wore thin\nFelt every loss like a cold, hard sin\nGhosts try to drag me, but I ain’t alone\nMy posse’s my throne, this tailgate’s our zone\nA bottle of Bud, we pass it around\nLaugh ‘til we’re dizzy, no hurt to be found\n(Verse 3)\nMoonlight’s our spotlight, the stars set the stage\nRaisin’ hell together, we’re writin’ this page\nFights and hard nights, we’ve weathered the storm\nThese brothers and sisters, they keep my heart warm\nA jar of moonshine, it stings, but it’s sweet\nTo the kin that I chose, who make life complete\n(Bridge)\nThis old guitar wails a rebel’s tune\nSings of nights lit by a bonfire moon\nHere’s to the lost, the wild, the free\nThe ones who stood tall and drank with me\nThey’re my fight, my soul, my song\n(Chorus)\nRaise a shot of Jack to the family that ain’t blood\nToast the ones who lift you from the mud\nWhen the world slams the door, they kick it in tight\nThese rowdy hearts blaze wild in the night\nHere’s to family, true and bold!\n(Outro)\nYeah, true and bold, through the highs and the lows\nBottle of Bud, moonshine’s glow\nRaise a shot of Jack, let the good times roll",
      "themes": [
        "abuse_trauma",
        "bar_setting",
        "family",
        "faith_spirituality",
        "freedom_wandering",
        "heartbreak_loss",
        "hometown_roots",
        "music_songwriting",
        "nature_outdoors",
        "partying_celebration",
        "rebellion_outlaw",
        "resilience_survival",
        "working_class_labor"
      ]
    },
    "run_from_the_reaper": {
      "title": "Run From the Reaper",
      "status": "private",
      "lyrics": "(Verse 1)\nThe dust kicks up behind me, on this lonesome road,\nMy boots are worn to nothin’, carryin’ this load.\nGot a warrant in my pocket, and a devil on my trail,\nRunnin’ from the reaper, but I’m bound to fail.\n(Pre-Chorus)\nThe wind’s howlin’ my name, through the midnight air,\nGhosts of my sins, they’re closin’ in there.\n(Chorus)\nRun from the reaper, but he’s closin’ in,\nHears my heart a-beatin’, smells my every sin.\nThrough the canyons and the shadows, I’ll ride till I’m free,\nRun from the reaper, but he’s comin’ for me.\n(Verse 2)\nMy old Chevy’s screamin’, tires spittin’ gravel fast,\nChasin’ down redemption, but I’m haunted by the past.\nEvery milepost mocks me, every star burns cold,\nThis outlaw’s soul’s too heavy, for the stories I’ve told.\n(Pre-Chorus)\nThe law’s lights are flashin’, in my rearview glow,\nBut the reaper’s shadow’s darker, and he won’t let go.\n(Chorus)\nRun from the reaper, but he’s closin’ in,\nHears my heart a-beatin’, smells my every sin.\nThrough the canyons and the shadows, I’ll ride till I’m free,\nRun from the reaper, but he’s comin’ for me.\n(Bridge)\nI’ve burned too many bridges, left too many scars,\nStole a piece of heaven, under these cruel stars.\nBut if I keep on runnin’, maybe I’ll outsmart,\nThat cold hand of fate, tearin’ at my heart.\n(Chorus)\nRun from the reaper, but he’s closin’ in,\nHears my heart a-beatin’, smells my every sin.\nThrough the canyons and the shadows, I’ll ride till I’m free,\nRun from the reaper, but he’s comin’ for me.\n(Outro)\nSo I’ll race this endless highway, till my engine dies,\nWith the reaper in my mirror, and fire in my eyes.\nOne last shot at freedom, one last rebel plea,\nRun from the reaper… but he’s comin’ for me.\nYeah, he’s comin’ for me. (Keep on runnin’ free.)\nComin’ for me.\nAcoustic sound: A raw, heart-pounding acoustic ballad with an urgent, mid-tempo pulse blends stripped-down vulnerability with fierce intensity, anchored by driving guitar and weathered, urgent vocals that evoke a high-stakes personal journey.\nPotential Sound:\nA high-octane outlaw country rocker with a driving, mid-to-up-tempo pulse, blending gritty authenticity with cinematic intensity. Anchored by twangy electric guitars and a relentless acoustic strum, the track pulses with a galloping kick drum and a deep, rumbling bassline, evoking a fugitive’s desperate ride. A searing pedal steel wail and occasional banjo plucks add raw country soul, while sparse harmonica stabs heighten the tension. The vocal delivery is weathered and urgent, with gritty, conversational phrasing and subtle backing harmonies that carry a ghostly edge. The tone is rebellious, desperate, and vivid, conjuring a lone outlaw tearing through a desert under a blood-red sky, perfect for a high-stakes Western chase scene, a modern country musical climax, or a road-trip playlist staple.\nWhy It’s Not a Ballad:\nTempo and Energy: The song now has a faster, driving rhythm, with a galloping beat and urgent guitar riffs that evoke a chase rather than a slow, mournful ballad. The energy is high, pushing the narrative forward like a fugitive on the run. Outlaw Country Core: It retains the genre’s raw storytelling, with vivid imagery (dusty roads, warrants, Chevy trucks) and themes of regret and defiance, but the tempo and instrumentation (electric guitars, kick drum) give it a rocker’s edge, appealing to fans of both classic and modern country. Phrasing: The Bye Bye Birdie-inspired short, rhythmic lines (“Run from the reaper, but he’s closin’ in”) remain, delivered with a conversational, almost frantic cadence that suits the chase narrative and keeps the song catchy. Mainstream Potential: The driving beat, anthemic chorus, and cinematic vibe give it crossover appeal, similar to high-energy country hits that blend outlaw grit with radio-ready hooks. Sound::\nVibe: The song feels like a high-stakes escape, with the reaper as both a literal and metaphorical pursuer. It’s gritty enough for purists but polished enough for a broader audience, with a sound that could fit a modern country festival or a film soundtrack. Performance: Envision this in a smoky roadhouse or a dramatic musical scene, with a rugged singer in a leather jacket, backed by a tight band (electric guitar, banjo, pedal steel, drums). The chorus could ignite a crowd to stomp and sing along, while the bridge offers a moment of raw intensity. Imagery and Themes: The lyrics paint a vivid picture of a fugitive’s life—dusty trails, flashing lights, burning bridges—while hinting at redemption, keeping the emotional depth intact.",
      "themes": [
        "abuse_trauma",
        "faith_spirituality",
        "freedom_wandering",
        "heartbreak_loss",
        "nature_outdoors",
        "rebellion_outlaw"
      ]
    },
    "canyons_cry": {
      "title": "Canyon’s Cry",
      "status": "private",
      "lyrics": "(Verse 1)\nThere’s a storm in the canyon, tearin’ through my bones,\nThunder’s got my secrets, carved in jagged stones.\nIt howls to break the silence, begs to shake the sky,\nBut the sun’s a ruthless witness, and I’m scared to fly.\n(Pre-Chorus)\nThe wildfire’s callin’, it won’t let me hide,\nRagin’ for the truth, burnin’ deep inside.\n(Chorus)\nCanyon’s cry, roarin’ through the night,\nScreamin’ all my pain, in a blaze of light.\nIt’s wild, it’s fierce, gonna lift me high,\nCanyon’s cry, born to defy!\n(Verse 2)\nI’ve danced with desert shadows, where the vultures soar,\nClutchin’ truths too heavy, that I can’t ignore.\nThey claw to reach the heavens, like a river’s flood,\nBut the spotlight’s a vulture, circlin’ for my blood.\n(Pre-Chorus)\nThe lightning’s pushin’, it won’t let me stay,\nUrgin’ me to holler, chase the dark away.\n(Chorus)\nCanyon’s cry, roarin’ through the night,\nScreamin’ all my pain, in a blaze of light.\nIt’s wild, it’s fierce, gonna lift me high,\nCanyon’s cry, born to defy!\n(Bridge)\nI’ve seen the valley’s altar, where the brave ones fall,\nHeard the siren’s promise, but it steals it all.\nYet this fire in my veins, it’s a rebel’s spark,\nGonna shout my soul, tear the silence apart!\n(Chorus)\nCanyon’s cry, roarin’ through the night,\nScreamin’ all my pain, in a blaze of light.\nIt’s wild, it’s fierce, gonna lift me high,\nCanyon’s cry, born to defy!\n(Outro)\nSo I’ll ride this storm, where the wild winds wail,\nLet the canyon carry my truth’s old tale.\nWith the stars as my witness, I’ll set my pain free,\nCanyon’s cry… it’s livin’ in me.\nYeah, canyon’s cry! (Raise it to the sky!)\nLivin’ in me.\nVibe: The song feels like a thunderstorm in a desert canyon, with the narrator’s pain transforming into a defiant, uplifting cry. It’s intense enough for outlaw fans but anthemic for mainstream crowds, ideal for a festival climax or a movie’s triumphant moment. Performance: Picture the artist in a leather jacket, commanding a stage with a band (electric guitar, banjo, pedal steel, fiddle). The chorus sparks crowd chants, and the bridge could feature a dramatic guitar solo or vocal wail. For TikTok/busking, an acoustic version would rely on fierce strumming and raw vocals. Appeal: The blend of pain and empowerment, plus the driving energy, could make it a chart-climber or social media hit, resonating with listeners seeking catharsis.\nSounds Like\nFull Band/Studio: The polished production amplifies the song’s “raise you up” energy with a full ensemble (electric guitar, pedal steel, banjo, fiddle, drums), making it a radio-ready anthem with outlaw grit, ideal for a festival or soundtrack. Acoustic/Live/Busking: Stripped to a single acoustic guitar, the raw vocals and rhythmic strumming preserve the song’s intensity and pain, perfect for an intimate TikTok live stream or a Nashville street corner, where the allegorical lyrics shine.",
      "themes": [
        "abuse_trauma",
        "faith_spirituality",
        "heartbreak_loss",
        "music_songwriting",
        "nature_outdoors",
        "rebellion_outlaw",
        "resilience_survival"
      ]
    },
    "church_of_country": {
      "title": "Church of Country",
      "status": "private",
      "lyrics": "Verse 1\nI hit the stage on red dirt, where the heartland’s callin’ me,\nFrom dive bar smoke to stadiums, this is where I’m free.\nHank’s ghost in my guitar, Dolly’s shine in my soul,\nCountry’s fire in my bones, it’s the only life I know.\n\nPre-Chorus\nSteel guitars are my pulpit, banjo’s my battle cry,\nEvery scar’s a song I sing, reachin’ for the sky.\n\nChorus\nThis is the Church of Country, where the faithful raise a spark,\nJohnny’s growl, Shania’s strut, lightin’ up the dark.\nSing for Patsy, for Stapleton, let the fiddle break the chains,\nCountry’s pulse is beatin’ loud, runnin’ wild in our veins!\n\nVerse 2\nI’m singin’ Loretta’s truth, Willie’s ramblin’ road,\nGeorge Jones’ whiskey heartache, carryin’ the load.\nFrom Waylon’s outlaw thunder to Miranda’s rebel flame,\nEvery note’s my hallelujah, country’s my true name.\n\nPre-Chorus\nBoots stomp the rhythm, my voice’ll shake the ground,\nIn this Church of Country, salvation’s what I’ve found.\n\nChorus\nThis is the Church of Country, where the faithful raise a spark,\nJohnny’s growl, Shania’s strut, lightin’ up the dark.\nSing for Patsy, for Stapleton, let the fiddle break the chains,\nCountry’s pulse is beatin’ loud, runnin’ wild in our veins!\n\nBridge\nIt’s a honky-tonk redemption, where the broken find their fight,\nCash’s truth, Kacey’s grace, guidin’ me through the night.\nFrom backroad hymns to neon dreams, I’ll carry on the sound,\nCountry’s heart is mine to hold, forever glory-bound!\n\nFinal Chorus\nThis is the Church of Country, where the roots will never fade,\nLoretta’s coal dust soul, Alan’s river escapade.\nRaise a glass for every dreamer, let the banjo’s fire roar,\nCountry’s callin’ me to sing, now and evermore!\n\nOutro\n*(Fiddle tears the roof off, steel guitar screams)*\nChurch of Country, hear my voice, let the whole world know,\nThis is my salvation, where my rebel heart’ll go!\n*(Pyro pops, crowd roars)*\nHallelujah, country soul, Alex takes the show!",
      "themes": [
        "abuse_trauma",
        "bar_setting",
        "faith_spirituality",
        "freedom_wandering",
        "heartbreak_loss",
        "hometown_roots",
        "music_songwriting",
        "nature_outdoors",
        "partying_celebration",
        "rebellion_outlaw",
        "resilience_survival",
        "working_class_labor"
      ]
    },
    "workin_for_a_living": {
      "title": "Workin' for a Living",
      "status": "private",
      "lyrics": "Verse 1\nDawn breaks hard, boots hit the ground,\nSweat’s my pay where the work is found.\nNo silver spoon, just a will to fight,\nPushin’ through the long days into the night.\n\nPre-Chorus\nBlisters on my hands, fire in my chest,\nEvery drop of sweat’s a step toward the best.\n\nChorus\nWorkin’ for a livin’, sunup till the stars burn bright,\nRough hands, tired bones, holdin’ on with all my might.\nAin’t got much, but I got heart, a spark that won’t let go,\nWorkin’ for a livin’, buildin’ dreams from the ground below.\n\nVerse 2\nFields of dust, factory’s hum,\nHaulin’ loads till my body’s numb.\nEvery ache’s a badge, every scar’s a sign,\nI’m carvin’ out a life that’s proud and mine.\n\nPre-Chorus\nNo shortcut’s callin’, no easy way,\nJust the grind that shapes me, day by day.\n\nChorus\nWorkin’ for a livin’, sunup till the stars burn bright,\nRough hands, tired bones, holdin’ on with all my might.\nAin’t got much, but I got heart, a spark that won’t let go,\nWorkin’ for a livin’, buildin’ dreams from the ground below.\n\nBridge\nRound the fire’s glow, we share the load,\nLaughin’ through the hurt, on this long road.\nFor the ones who toil, for the ones who strive,\nThis song’s for the workers keepin’ hope alive.\n\nChorus\nWorkin’ for a livin’, sunup till the stars burn bright,\nRough hands, tired bones, holdin’ on with all my might.\nAin’t got much, but I got heart, a spark that won’t let go,\nWorkin’ for a livin’, buildin’ dreams from the ground below.\n\nOutro\n(Fiddle kicks, steady strum)\nWorkin’ for a livin’, that’s my truth, my fight,\nFrom the break of dawn to the end of night.",
      "themes": [
        "abuse_trauma",
        "freedom_wandering",
        "heartbreak_loss",
        "music_songwriting",
        "nature_outdoors",
        "resilience_survival",
        "working_class_labor"
      ]
    },
    "coal_dust_sunrise": {
      "title": "Coal Dust Sunrise",
      "status": "private",
      "lyrics": "Long shadows creep on the valley floor,\nAs the bleeding sky unveils what's in store.\nA cold breath sighs through the hollows deep,\nWhere old dreams stir and new promises keep.\nA shack stands weathered, a whisper of gray,\nBut a tender warmth chases shadows away.\nA soft hymn rises on the morning's chill,\nA silent plea, standing perfectly still.\n(Pre-Chorus)\nBeneath the grit, a spark ignites,\nChasing the ghosts of endless nights.\nThis ain't no Eden, raw and deep,\nBut promises the weary keep.\n(Chorus)\nThese coal dust sunrises, they stain the peaks in gray,\nBut hope's true fire still finds a way, yeah, it always finds a way.\nThe tired earth groans, a haunting, low refrain,\nYet grit-worn hands find strength to rise and live again.\nTo rise and breathe again.\n(Verse 2)\nThe earth gives freely, then demands its toll,\nEach dawn a testament to body and soul.\nRedemption's whisper in the morning's light,\nA bruising struggle, a constant, inner fight.\nA flicker of grace, a beacon in the night,\nA stubborn promise burning ever so bright.\nThe scars remain, a map of every pain,\nBut the spirit's song, a fierce, unbroken strain.\n(Pre-Chorus)\nBeneath the grit, a spark ignites,\nChasing the ghosts of endless nights.\nThis ain't no Eden, raw and deep,\nBut promises the weary keep.\n(Chorus)\nThese coal dust sunrises, they stain the peaks in gray,\nBut hope's true fire still finds a way, yeah, it always finds a way.\nThe tired earth groans, a haunting, low refrain,\nYet grit-worn hands find strength to rise and live again.\nTo rise and breathe again.\n(Bridge)\nThe mountain stands, a titan through the years,\nSwallowing hardship, conquering all fears.\nThis ain't the ending, just a beat in between,\nA chance to reclaim, to heal, to be seen.\n(Chorus)\nThese coal dust sunrises, they stain the peaks in gray,\nBut hope's true fire still finds a way, yeah, it always finds a way.\nThe tired earth groans, a haunting, low refrain,\nYet grit-worn hands find strength to rise and live again.\nTo rise and breathe again.\n(Outro)\nTo rise and breathe again,\nA coal dust sunrise, and we're all risin' again.",
      "themes": [
        "abuse_trauma",
        "faith_spirituality",
        "heartbreak_loss",
        "hometown_roots",
        "music_songwriting",
        "nature_outdoors",
        "resilience_survival",
        "working_class_labor"
      ]
    },
    "drivin_to_you": {
      "title": "Drivin' to You",
      "status": "private",
      "lyrics": "Verse 1\nKicked off from Kentucky, tires spinnin’ through the night,\nYour dream’s in California, girl, I’m racin’ toward your light.\nTennessee’s hills are callin’, with their banjo serenade,\nArkansas’ muddy delta’s where your memory’s never strayed.\n\nPre-Chorus\nRadio’s buzzin’, but your voice is my guide,\nEvery state’s a promise, I’m crossin’ the divide.\n\nChorus\nFrom Texas to California, I’m ridin’ into LA!\nDrivin’ to you, darlin’, no state’s too far away!\nOklahoma to Nevada, I’m burnin’ up the miles,\nSing it loud, I’m comin’ for your heart and your smile!\nYour dream’s my compass, I’m chasin’ your glow,\nFrom Texas to California, girl, here I go!\n\nVerse 2\nOklahoma’s plains are screamin’, wind tearin’ at my soul,\nTexas stars light the way, your face in their fiery roll.\nMissouri’s rivers churn wild, reflectin’ your sweet spark,\nNew Mexico’s desert heat can’t stop this racin’ heart.\n\nPre-Chorus\nCoffee’s cold as stone, but my heart’s runnin’ hot,\nThis highway’s my heartstring, tyin’ all I got.\n\nChorus\nFrom Texas to California, I’m ridin’ into LA!\nDrivin’ to you, darlin’, no state’s too far away!\nOklahoma to Nevada, I’m burnin’ up the miles,\nSing it loud, I’m comin’ for your heart and your smile!\nYour dream’s my compass, I’m chasin’ your glow,\nFrom Texas to California, girl, here I go!\n\nBridge\nColorado’s peaks stand tall, Arizona’s canyons wail,\nNevada’s neon flickers, but your love’s my holy grail.\nI’d blaze through every state line, fight the wind and the storm,\nFor one night in your arms, keepin’ my heart warm.\n\nChorus\nFrom Texas to California, I’m ridin’ into LA!\nDrivin’ to you, darlin’, no state’s too far away!\nOklahoma to Nevada, I’m burnin’ up the miles,\nSing it loud, I’m comin’ for your heart and your smile!\nYour dream’s my compass, I’m chasin’ your glow,\nFrom Texas to California, girl, here I go!\n\nOutro\nFrom Texas to California, sunrise breakin’ through,\nThis road’s my love, and it’s leadin’ to you.",
      "themes": [
        "faith_spirituality",
        "freedom_wandering",
        "hometown_roots",
        "love_romance",
        "music_songwriting",
        "nature_outdoors"
      ]
    },
    "the_road_to_nashville": {
      "title": "The Road to Nashville",
      "status": "private",
      "lyrics": "Verse 1\nGot a beat-up truck and a guitar case,\nDreams burnin’ hotter than a summer’s blaze.\nLeavin’ small-town dust in my rearview glow,\nHeaded where the neon lights call my soul.\n\nChorus\nOn the road to Nashville, sing it loud and free!\nChasin’ stars and honky-tonks, where I’m meant to be!\nFrom the backroads to the bright lights, feel the thrill,\nOn the road to Nashville, I’m climbin’ that hill!\n\nVerse 2\nSweet tea sippin’, boots tappin’ the floor,\nSingin’ my heart out, knockin’ on doors.\nEvery mile’s a story, every note’s a fight,\nSouthern grit’s pushin’ me through the night.\n\nChorus\nOn the road to Nashville, sing it loud and free!\nChasin’ stars and honky-tonks, where I’m meant to be!\nFrom the backroads to the bright lights, feel the thrill,\nOn the road to Nashville, I’m climbin’ that hill!\n\nBridge\nRaise a bottle, let the fiddle wail,\nEvery dreamer’s got a tale to tell!\nWith a song in my soul and fire in my veins,\nNashville’s callin’, breakin’ all my chains!\n\nChorus\nOn the road to Nashville, sing it loud and free!\nChasin’ stars and honky-tonks, where I’m meant to be!\nFrom the backroads to the bright lights, feel the thrill,\nOn the road to Nashville, I’m climbin’ that hill!\n\nOutro\n(Claps, hollers, banjo rolls)\nOn the road to Nashville, never standin’ still,\nSing it proud, keep pushin’, got a dream to fill!\nFrom the heartland to the stage, I’m risin’ high,\nOn the road to Nashville, reachin’ for the sky!",
      "themes": [
        "bar_setting",
        "faith_spirituality",
        "freedom_wandering",
        "hometown_roots",
        "music_songwriting",
        "nature_outdoors",
        "partying_celebration",
        "resilience_survival"
      ]
    }
  }
}