{
  "theme": "abuse_trauma",
  "song_count": 48,
  "songs": {
    "be_better_for_the_next_guy": {
      "title": "Be Better for the Next Guy",
      "status": "private",
      "lyrics": "Verse 1\nI’m three whiskeys deep, flingin’ darts at the back wall,\nLaughin’ at your name etched on my shot glass.\nNo more lonely nights curled up by the telephone—\nI’ve found new roads past the diner where we fought.\nChorus\nSo here’s to you, sweeter than cherry pie—\nHope he buys those roses you let wither and die.\nWhen he’s pourin’ out his heart baby-blue, don’t make him cry—\nBe better for the next guy.\nVerse 2\nI’ll catch her eye across the bar when the jukebox spins our song,\nShe’ll think you’re heaven ’til your lies come undone.\nI’ll lift her up with shots of bourbon ’til she’s singin’ along,\nWhile you learn too late how to love someone.\nChorus (variation)\nSo here’s to you, spicier than a jalapeño—\nHope he feels the jagged scars you left on my chest.\nWhen he’s pouring out his soul, don’t put it to the test—\nBe better for the next guy.\nVerse 3\nSaw you last weekend at the state fair midway,\nYour eyes lit up just like they did back then.\nHe wore that nervous grin I know all too well—\nYou led him ’round like he was your only friend.\nOne prayer for that poor boy’s all I’ve got to give—\nMay you hold his hand tighter than you ever held mine.\nBridge\nAnd if he wakes up cold in your empty bed,\nOr finds your lipstick stains on someone else instead,\nTell him to head back to this Tennessee roadhouse—\nWhere broken hearts learn how to lose and forget.\nFinal Chorus\nSo here’s to you, sweeter than a Georgia peach—\nDon’t leave him sobbin’ under that big open sky.\nWhen he’s layin’ down his love, make sure you don’t lie—\nBe better for the next guy.",
      "suggested_venues": [
        "coffee_shop",
        "dive_bar",
        "honky_tonk",
        "listening_room",
        "roadhouse",
        "small_theater"
      ]
    },
    "born_in_hell": {
      "title": "Born in Hell",
      "status": "private",
      "lyrics": "Verse 1\nCoal dust in my lungs, blood on the floor,\nDad’s fists kept time with the slam of the door.\nBorn in a town where the devil holds sway,\nI learned to take hits ‘fore I learned how to pray.\nPre-Chorus\nNo mercy in his eyes, no warmth in that house,\nJust a boy dodgin’ shadows, quiet as a mouse.\nChorus\nBorn in hell, where the sun don’t shine,\nTook my beatings daily, paid for his cheap wine.\nKicked out at sixteen, worked the mines to survive,\nIn the dark of that town, I kept my soul alive.\nVerse 2\nSchool by day, mines by night, no time to dream,\nRented a room with walls thin as a scream.\nSweat and black soot, my hands turned to stone,\nCarried my books and my scars all alone.\nPre-Chorus\nNo mother to hold me, no father to care,\nJust the weight of the world and the cold mountain air.\nChorus\nBorn in hell, where the sun don’t shine,\nTook my beatings daily, paid for his cheap wine.\nKicked out at sixteen, worked the mines to survive,\nIn the dark of that town, I kept my soul alive.\nBridge\nEvery bruise was a map of the hell I called home,\nEvery shift in the dark taught me how to roam.\nI wasn’t born to break, though they tried to bend,\nFound a spark in my heart that no devil could end.\nChorus\nBorn in hell, where the sun don’t shine,\nTook my beatings daily, paid for his cheap wine.\nKicked out at sixteen, worked the mines to survive,\nIn the dark of that town, I kept my soul alive.\nOutro\n*(Slow picking: E|-3---3---|)*\nBorn in hell… but I’m still breathin’",
      "suggested_venues": [
        "arena",
        "coffee_shop",
        "dive_bar",
        "honky_tonk",
        "house_concert",
        "listening_room",
        "roadhouse",
        "stadium"
      ]
    },
    "broken_hallelujah": {
      "title": "Broken Hallelujah",
      "status": "private",
      "lyrics": "Verse 1\nBack alley shadows, where the drunks lose their way,\nFound a splintered old box in the trash’s decay.\nSix rusted strings, neck warped like my dreams,\nBut it hummed like a savior in the moonlight’s beams.\nPre-Chorus\nNo angels in this town, just coal and despair,\nBut that guitar called my name through the cold, bitter air.\nChorus\nHeard a whisper in the wreckage, ‘neath the coffee grounds and rust,\nA broken Hallelujah risin’ from the dust.\nThis dumpster guitar salvation, ragged but it’s true,\nFound the song that saved my life right there inside of you.\nVerse 2\nDad’s fists were thunder, his bottle was king,\nBut I strummed my first chord, felt my heart start to sing.\nHid it in the shed where his eyes wouldn’t roam,\nEach note was a fire that was callin’ me home.\nPre-Chorus\nNo preacher could reach me, no sermon could mend,\nBut that guitar was my truth, my beginning, my friend.\nChorus\nHeard a whisper in the wreckage, ‘neath the coffee grounds and rust,\nA broken Hallelujah risin’ from the dust.\nThis dumpster guitar salvation, ragged but it’s true,\nFound the song that saved my life right there inside of you.\nBridge\nEvery scratch was a story, every crack was a fight,\nI coaxed out my soul in the dead of the night.\nFrom a boy lost in silence to a man with a voice,\nThis guitar was my freedom, my heart’s only choice.\nChorus\nHeard a whisper in the wreckage, ‘neath the coffee grounds and rust,\nA broken Hallelujah risin’ from the dust.\nThis dumpster guitar salvation, ragged but it’s true,\nFound the song that saved my life right there inside of you.\nOutro\n*(Slow picking: E|-3---3---|)*\nDumpster guitar… still singin’ me through.",
      "suggested_venues": [
        "church",
        "coffee_shop",
        "house_concert",
        "listening_room",
        "revival",
        "small_theater"
      ]
    },
    "guilt_and_grief": {
      "title": "Guilt and Grief",
      "status": "private",
      "lyrics": "Verse 1\nNever heard your voice, never felt your touch,\nJust a gravestone whisper in a mining town clutch.\nThey say I stole your breath when I took my first,\nNow I carry that weight like a lifelong curse.\nPre-Chorus\nI’d trade all my tomorrows for one yesterday,\nTo know the love you never got to say.\nChorus\nI dreamt of your hands, but I woke up cold —\nA cradle of silence, a story untold.\nI carry your voice in the spaces he left —\nGuilt and grief are all I have left.\nVerse 2\nDad’s eyes were daggers, blamin’ me for your end,\nBut I’d see you in dreams where my heart could mend.\nYour shadow’s my shelter when the nights get mean,\nI’m holdin’ onto love I’ve only ever seen.\nPre-Chorus\nI’d give all my songs for one moment with you,\nTo feel what a mother’s arms can do.\nChorus\nI dreamt of your hands, but I woke up cold —\nA cradle of silence, a story untold.\nI carry your voice in the spaces he left —\nGuilt and grief are all I have left.\nBridge\nEvery chord I play is a prayer to your name,\nEvery tear I hide is a candle’s flame.\nYou’re gone, but you’re woven in my every breath,\nI’m livin’ through the guilt to honor your death.\nChorus\nI dreamt of your hands, but I woke up cold —\nA cradle of silence, a story untold.\nI carry your voice in the spaces he left —\nGuilt and grief are all I have left.\nOutro\n*(Slow picking: E|-3---3---|)*\nGuilt and grief… my heart’s only theft.",
      "suggested_venues": [
        "church",
        "coffee_shop",
        "listening_room",
        "small_theater"
      ]
    },
    "heres_to_the_ghosts_i_leave_behind": {
      "title": "Here’s to the Ghosts I Leave Behind",
      "status": "private",
      "lyrics": "Verse 1\nI’ve walked through the ashes of a life torn apart,\nCarried the weight of a coal-black heart.\nSome ghosts held me close, some cut like a blade,\nBut each one’s a shadow that my soul’s outstayed.\nPre-Chorus\nThe road taught me mercy, the pain taught me grace,\nEach step’s a new story writ on my face.\nChorus\nWe raise our glasses to the ones who stayed —\nAnd tip our hats to the ones we outgrew with age.\nThere’s grace in the leavin’, mercy in the signs —\nHere’s to the ghosts we leave behind.\nVerse 2\nMom’s in the stars, Dad’s in the dust,\nOne gave me love, one broke my trust.\nBut I’m more than their echoes, more than their chains,\nI’m the man I built through the joys and the pains.\nPre-Chorus\nThe past ain’t my prison, it’s just where I’ve been,\nEach goodbye’s a door to begin again.\nChorus\nWe raise our glasses to the ones who stayed —\nAnd tip our hats to the ones we outgrew with age.\nThere’s grace in the leavin’, mercy in the signs —\nHere’s to the ghosts we leave behind.\nBridge\nTo the boy I was, scared and alone,\nTo the man I am, who found a home.\nEvery ghost’s a lesson, every scar’s a line,\nI’m singin’ my freedom, leavin’ ghosts behind.\nChorus\nWe raise our glasses to the ones who stayed —\nAnd tip our hats to the ones we outgrew with age.\nThere’s grace in the leavin’, mercy in the signs —\nHere’s to the ghosts we leave behind.\nOutro\n*(Slow picking: E|-3---3---|)*\nHere’s to the ghosts… I’m leavin’ behind.",
      "suggested_venues": [
        "amphitheater",
        "coffee_shop",
        "festival",
        "house_concert",
        "listening_room",
        "outdoor_venue",
        "small_theater"
      ]
    },
    "i_raised_myself": {
      "title": "I Raised Myself",
      "status": "private",
      "lyrics": "Verse 1\nCoal dust on my boots, blood on my hands,\nGrew up in a hell where no one understands.\nDad’s fist was his gospel, his bottle his creed,\nI learned to stand tall while my heart learned to bleed.\nPre-Chorus\nNo soft words, no shelter from the storm,\nJust a boy and a guitar keepin’ my soul warm.\nChorus\nNo lullabies, no ‘good job, son’ —\nJust the sound of doors slammin’ when the hard times come.\nScraped my knees and stitched my pride —\nI raised myself, and I survived.\nVerse 2\nKentucky nights taught me how to fight,\nDodgin’ his shadow in the dim porch light.\nStrummed my pain on strings rusted and worn,\nTurned my scars into songs before the dawn was born.\nPre-Chorus\nNo roadmap, no hand to hold me tight,\nJust a fire in my chest burnin’ through the night.\nChorus\nNo lullabies, no ‘good job, son’ —\nJust the sound of doors slammin’ when the hard times come.\nScraped my knees and stitched my pride —\nI raised myself, and I survived.\nBridge\nEvery bruise was a lesson, every tear was a flame,\nBuilt a man from the wreckage of a cursed last name.\nThis guitar’s my salvation, my truth, my fight,\nI raised myself to sing into the night.\nChorus\nNo lullabies, no ‘good job, son’ —\nJust the sound of doors slammin’ when the hard times come.\nScraped my knees and stitched my pride —\nI raised myself, and I survived.\nOutro\n*(Slow picking: E|-3---3---|)*\nI raised myself… and I’m still alive.",
      "suggested_venues": [
        "coffee_shop",
        "honky_tonk",
        "listening_room",
        "roadhouse",
        "small_theater"
      ]
    },
    "kentucky_steel": {
      "title": "Kentucky Steel",
      "status": "private",
      "lyrics": "Verse 1\nBorn in the shadow of a coal-black vein,\nWhere the hollers weep and the skies bleed rain.\nDad’s fists were iron, his heart cold stone,\nBut I carved my soul from the roots I’ve known.\nPre-Chorus\nRaised by dust and gospel’s steady call,\nForged in shafts where shadows crawl,\nMy will hammered into iron walls.\nChorus\nForged in the hills where the wild winds howl,\nRaised by the mines and the gospel sound.\nI got coal dust blood and a hammer for a will—\nThis heart don’t break—it’s Kentucky steel.\nVerse 2\nSweat and grit built these hands of mine,\nCrawled through darkness for a dollar’s shine.\nEvery scar’s a story, every ache a fight,\nI’m standin’ tall in the fading light.\nPre-Chorus\nRaised by dust and gospel’s steady call,\nForged in shafts where shadows crawl,\nMy will hammered into iron walls.\nChorus\nForged in the hills where the wild winds howl,\nRaised by the mines and the gospel sound.\nI got coal dust blood and a hammer for a will—\nThis heart don’t break—it’s Kentucky steel.\nBridge\nFiddle cuts sharp like a miner’s blade,\nEach note’s a fire that the pain remade.\nI’m forged from the hollers, unyielding and true,\nThis spirit’s unbreakable, and it’s carryin’ through.\nChorus\nForged in the hills where the wild winds howl,\nRaised by the mines and the gospel sound.\nI got coal dust blood and a hammer for a will—\nThis heart don’t break—it’s Kentucky steel.\nPost-Chorus\nEvery strike on steel became my song,\nEach scar a verse that made me strong,\nI stand unbroken where I belong.\nOutro \nHollers still echo, but I’m holdin’ the line,\nKentucky steel runs deep in this heart of mine.",
      "suggested_venues": [
        "amphitheater",
        "church",
        "outdoor_venue",
        "revival"
      ]
    },
    "running_free": {
      "title": "Running Free",
      "status": "private",
      "lyrics": "Verse 1\nHighway hums low, just me and the sky,\nThat video call’s just a ghost in my mind.\nLeft the roadhouse behind, let the whiskey burn clean,\nI’m carryin’ my scars, but my heart’s runnin’ lean.\nPre-Chorus\nNo chains, no pain, just the road up ahead,\nI’m livin’ for me, not the tears that I shed.\nChorus\nRunnin’ free, with the fire in my soul,\nNo more chasin’ your lies down a dead-end road.\nBuilt a man from the wreckage you left in your wake,\nThis heart’s still alive, and it’s runnin’ free today.\nVerse 2\nPass that old diner where we scratched our dreams,\nNow it’s dust on my boots, just a faded old scene.\nThe jukebox don’t haunt me, the nights don’t bite,\nThese strings sing my freedom in the pale starlight.\nPre-Chorus\nNo ghosts, no grief, just the wind at my back,\nI’m writin’ my story on this endless black track.\nChorus\nRunnin’ free, with the fire in my soul,\nNo more chasin’ your lies down a dead-end road.\nBuilt a man from the wreckage you left in your wake,\nThis heart’s still alive, and it’s runnin’ free today.\nBridge\nI forgave the fool I was for lovin’ you blind,\nFound a steel in my bones that your betrayal refined.\nThe road ain’t salvation, but it’s honest and wide,\nI’m runnin’ toward freedom with my head held high.\nChorus\nRunnin’ free, with the fire in my soul,\nNo more chasin’ your lies down a dead-end road.\nBuilt a man from the wreckage you left in your wake,\nThis heart’s still alive, and it’s runnin’ free today.\nOutro\n*(Slow picking: E|-3---3---|)*\nHighway keeps callin’, I ain’t lookin’ behind,\nRunnin’ free, with a strong, steady mind.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue",
        "roadhouse"
      ]
    },
    "skin_on_mine": {
      "title": "Skin On Mine",
      "status": "private",
      "lyrics": "Verse 1\nWorn boots on the porch, dust on the vine,\nYour shadow’s my shelter in this heart of mine.\nEvery wound I carry, you trace with care,\nFindin’ redemption in the weight we share.\nPre-Chorus\nYour touch maps secrets on my scars,\nSoft confession under midnight stars,\nI learn salvation in your arms.\nChorus\nA whisper in the dark, a brush on the spine,\nThe only prayers I believe in tonight are your skin on mine.\nNo angels needed, no preacher’s sign —\nJust your hands reading verses down my broken lines.\nPost-Chorus\nHeat lingers where your breath once played,\nEvery ache and longing unafraid,\nI find my home in the debt we’ve paid.\nVerse 2\nOld truck radio hums a lonesome tune,\nMoonlight paints us in a silver cocoon.\nYour eyes hold forgiveness for the roads I’ve roamed,\nIn your arms, I’m more than the miles I’ve known.\nPre-Chorus\nYour touch maps secrets on my scars,\nSoft confession under midnight stars,\nI learn salvation in your arms.\nChorus\nA whisper in the dark, a brush on the spine,\nThe only prayers I believe in tonight are your skin on mine.\nNo angels needed, no preacher’s sign —\nJust your hands reading verses down my broken lines.\nBridge\nWe’ve burned through sins, we’ve paid the cost,\nFound our heaven in the love we’ve lost.\nNo church could hold what we’ve designed,\nJust two souls tangled, your skin on mine.\nChorus\nA whisper in the dark, a brush on the spine,\nThe only prayers I believe in tonight are your skin on mine.\nNo angels needed, no preacher’s sign —\nJust your hands reading verses down my broken lines.\nOutro\nHeat lingers where your breath once played,\nEvery ache and longing unafraid.\nUnder these stars, we’ll never resign,\nI’ll keep on prayin’ with your skin on mine.",
      "suggested_venues": [
        "amphitheater",
        "coffee_shop",
        "house_concert",
        "listening_room",
        "outdoor_venue",
        "small_theater"
      ]
    },
    "sometimes_cowboys_stay": {
      "title": "Sometimes Cowboys Stay",
      "status": "private",
      "lyrics": "(Classic Country Standard)\nVerse 1\nI’ve roamed the wide plains where the wild winds call,\nChased dreams ‘cross canyons, watched the mighty fall.\nBut your gentle touch stopped this drifter’s heart,\nShowed me a horizon where forever could start.\nNo lonesome trail could pull me away,\n‘Cause darlin’, I learned that sometimes cowboys stay.\nChorus\nWe don’t ride off into sunsets alone —\nSome of us plant our boots and build a home.\nWith every nail, with every prayer,\nWe carve a life from the love we share.\nThrough storms and years, come what may,\nI’m yours, my love, ‘cause sometimes cowboys stay.\nVerse 2\nThe old songs sing of the wanderer’s road,\nA heart unbound, carryin’ a lonesome load.\nBut I found my freedom in the vows we made,\nIn the porch we built and the plans we laid.\nYour hand in mine is my promised land,\nA stronger call than the open sand.\nChorus\nWe don’t ride off into sunsets alone —\nSome of us plant our boots and build a home.\nWith every nail, with every prayer,\nWe carve a life from the love we share.\nThrough storms and years, come what may,\nI’m yours, my love, ‘cause sometimes cowboys stay.\nBridge\nLet the world keep spinnin’, let the rivers run,\nWe’ll raise our babies ‘neath this prairie sun.\nNo fence can hold us, but we choose to stand,\nRooted together on this sacred land.\nEvery scar, every laugh, every tear we’ve known,\nProves a cowboy’s heart can call one place home.\nChorus\nWe don’t ride off into sunsets alone —\nSome of us plant our boots and build a home.\nWith every nail, with every prayer,\nWe carve a life from the love we share.\nThrough storms and years, come what may,\nI’m yours, my love, ‘cause sometimes cowboys stay.\nVerse 3\nWhen the years have silvered your hair and mine,\nWhen the stars look down on this life divine,\nI’ll still be here, by your side I’ll stand,\nHoldin’ the heart that still holds my hand.\nFrom our first dance to our final day,\nI’ll love you, darlin’, ‘cause cowboys stay.\nFinal Chorus\nWe don’t ride off into sunsets alone —\nSome of us plant our boots and build a home.\nWith every nail, with every prayer,\nWe carve a life from the love we share.\nThrough storms and years, come what may,\nI’m yours, my love, ‘cause sometimes cowboys stay.\nOutro\nYeah, through storms and years, come what may,\nMy heart’s right here, ‘cause sometimes cowboys stay.\nThis song is designed to be a country standard, with a timeless melody (imagined in the vein of a waltz or slow ballad) and lyrics that resonate across generations.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "the_mourning_after": {
      "title": "The Mourning After",
      "status": "private",
      "lyrics": "Verse 1\nWoke up to a headache and your face in my mind,\nThat video call still burns like cheap red wine.\nI torched your old photos in a rusted tin can,\nBut your laugh keeps echoin’ through this broken man.\nPre-Chorus\nI’m half-dead, but I’m fightin’ to breathe,\nTradin’ tears for the strength to believe.\nChorus\nThe mournin’ after’s a cold, lonesome fight,\nScrapin’ up my heart in the pale morning light.\nI’m chasin’ new shadows where your ghost don’t roam,\nFindin’ my way, but I ain’t yet home.\nVerse 2\nNew bar down the highway, new smoke in the air,\nA girl’s crooked smile says she don’t know my care.\nI’m shakin’ off the weight of your cheatin’ disguise,\nBut your voice still cuts through the neon-lit skies.\nPre-Chorus\nI’m not healed, but I’m startin’ to mend,\nCarvin’ out a road where your lies gotta end.\nChorus\nThe mournin’ after’s a cold, lonesome fight,\nScrapin’ up my heart in the pale morning light.\nI’m chasin’ new shadows where your ghost don’t roam,\nFindin’ my way, but I ain’t yet home.\nBridge\nEvery mile I drive, I bury you deeper in the dust,\nEvery shot I take, I’m weldin’ back my trust.\nYour love was a blade that cut me to the core,\nBut I’m stitchin’ up my soul, I don’t need you no more.\nChorus\nThe mournin’ after’s a cold, lonesome fight,\nScrapin’ up my heart in the pale morning light.\nI’m chasin’ new shadows where your ghost don’t roam,\nFindin’ my way, but I ain’t yet home.\nOutro\nNew dives, new dawns, new battles to win,\nThe mournin’ after’s where I’m learnin’ to begin.\n*(Slow picking: E|-3---3---|)*\nMournin’ after you… I’m startin’ again.",
      "suggested_venues": [
        "dive_bar"
      ]
    },
    "the_music": {
      "title": "The Music",
      "status": "private",
      "lyrics": "Verse 1\nI was born in a holler where the coal dust sings,\nRaised on the ache of broke-down things.\nA trailer’s shadow, a father’s fist,\nFound my salvation in a six-string’s kiss.\nHid that guitar where the floorboards creak,\nPlayed ‘til my fingers bled, too scared to speak.\nChorus\nWhen the world talks too loud for a man to pray,\nI find my gospel in the strings I play.\nSound: fall like rain on a dust-dry field—\nThe music finds the parts I forgot to heal.\nIt’s my shield, my soul, my unbroken truth,\nThe music carries me when I’m black and blue.\nVerse 2\nFound a fiddle in a dumpster, strings half-dead,\nTaught it to cry for the dreams in my head.\nPiano keys I traced on a tabletop worn,\nBuilt me a hymn where my heart was torn.\nEvery scar’s a chord, every bruise a rhyme,\nMusic’s the only thing that’s mine all the time.\nChorus\nWhen the world talks too loud for a man to pray,\nI find my gospel in the strings I play.\nSound: fall like rain on a dust-dry field—\nThe music finds the parts I forgot to heal.\nIt’s my shield, my soul, my unbroken truth,\nThe music carries me when I’m black and blue.\nBridge\nWhen the bottle’s empty and the night’s too long,\nWhen love turns to lies and the road feels wrong,\nI don’t need a preacher, don’t need a sign—\nJust a battered Martin and a melody line.\nIt pulls me through the dark, it speaks my name,\nTurns my silence to a holy flame.\nVerse 3\nNow I’m runnin’ on roads where the maps don’t go,\nChasin’ a sound only my heart knows.\nStrangers hear my voice, they feel my pain,\nSay it’s like thunder callin’ down the rain.\nBut it ain’t for them, it’s for the boy I was—\nWho found his freedom in a guitar’s buzz.\nFinal Chorus\nWhen the world talks too loud for a man to pray,\nI find my gospel in the strings I play.\nSound: fall like rain on a dust-dry field—\nThe music finds the parts I forgot to heal.\nIt’s my shield, my soul, my unbroken truth,\nThe music carries me when I’m black and blue.\nOutro\nSo let the world keep screamin’, let the shadows fall,\nThe music’s my answer, my only call.\nFrom a trailer’s ruin to a stage unknown,\nThe music’s the fire that brings me home.",
      "suggested_venues": [
        "church",
        "coffee_shop",
        "house_concert",
        "listening_room",
        "revival",
        "small_theater"
      ]
    },
    "the_way_you_make_me_feel": {
      "title": "The Way You Make Me Feel",
      "status": "private",
      "lyrics": "Verse 1\nYour silhouette’s a spark in the twilight’s glow,\nLeather and lace, where the wild things grow.\nOne look from you, and my defenses all reel,\nYou’re a storm Marie Antoinette, and I’m under your spell.\nChorus\nWhiskey on your lips, sunset on your skin —\nEvery ‘no’ I ever said, you pull it out again.\nThe way you move, the way you steal —\nGod help me, girl, the way you make me feel.\nVerse 2\nBoots on the floor, rhythm slow and unkind,\nYou’re a temptation that’s burnin’ my mind.\nYour touch is a fuse, lightin’ fires I conceal,\nThis heart’s runnin’ hot, and it’s losin’ the wheel.\nChorus\nWhiskey on your lips, sunset on your skin —\nEvery ‘no’ I ever said, you pull it out again.\nThe way you move, the way you steal —\nGod help me, girl, the way you make me feel.\nBridge\nNo salvation in sight, no way to repent,\nYou’re a sin I’d commit, every dollar I’ve spent.\nYour kiss is a chain, and I’m locked in your thrill,\nI’d fall a thousand times just to feel that chill.\nVerse 3\nStarlight’s fadin’, but your eyes still burn,\nEvery curve of you makes my whole world turn.\nYou’re the devil’s own dance, yet you’re all that’s ideal,\nI’m a goner, sweet darlin’, the way you make me feel.\nChorus\nWhiskey on your lips, sunset on your skin —\nEvery ‘no’ I ever said, you pull it out again.\nThe way you move, the way you steal —\nGod help me, girl, the way you make me feel.\nOutro\nWhen the night calls soft, and the shadows get real,\nYou’re the only truth that my soul wants to feel.\nFrom your wicked sweet smile to the heat you reveal,\nI’m yours, my love, the way you make me feel.",
      "suggested_venues": [
        "coffee_shop",
        "house_concert",
        "listening_room",
        "small_theater"
      ]
    },
    "the_weight_of_silence": {
      "title": "The Weight of Silence",
      "status": "private",
      "lyrics": "Verse 1\nWords we never spoke cut deeper than his belt,\nEvery silent scream was a wound I felt.\nLearned to bite my tongue ‘fore I learned to pray,\nCarried that quiet through each hellbound day.\nPre-Chorus\nTruth was a ghost in that house of pain,\nBut silence was the chain I broke to stay sane.\nChorus\nScreamin’ would’ve been easier than bitin’ my tongue,\nBut I learned early silence wins when the hurt’s been sung.\nEvery heavy word we never said still shines —\nIn the weight of silence left behind.\nVerse 2\nDad’s liquor breath was louder than his care,\nHis fists wrote stories in the midnight air.\nI built my strength in the spaces he ignored,\nTurned my mute defiance to a warrior’s sword.\nPre-Chorus\nPain was a language we both understood,\nBut I chose the quiet to carve my own good.\nChorus\nScreamin’ would’ve been easier than bitin’ my tongue,\nBut I learned early silence wins when the hurt’s been sung.\nEvery heavy word we never said still shines —\nIn the weight of silence left behind.\nBridge\nNow I sing the truths I buried as a boy,\nEach note’s a spark, each chord’s a joy.\nThe weight of silence taught me how to stand,\nI’m breakin’ its chains with these calloused hands.\nChorus\nScreamin’ would’ve been easier than bitin’ my tongue,\nBut I learned early silence wins when the hurt’s been sung.\nEvery heavy word we never said still shines —\nIn the weight of silence left behind.\nOutro\n*(Slow picking: E|-3---3---|)*\nThe weight of silence… I’m leavin’ it behind.",
      "suggested_venues": []
    },
    "what_dad_left_behind": {
      "title": "What Dad Left Behind",
      "status": "private",
      "lyrics": "Verse 1\nYour name’s a bruise I wore like a brand,\nCarved in my bones by your heavy hand.\nA house full of echoes, a heart full of rust,\nYou left me your anger, but never your trust.\nPre-Chorus\nI walked through your fire, I carried your blame,\nBut I’m done bendin’ under your cursed last name.\nChorus\nA hollow house, a heavy name —\nI carry your lessons and your shame.\nBut you can’t chain down a storm or a mind —\nI’m not just what Dad left behind.\nVerse 2\nYour whiskey-soaked rants were my lullaby,\nEach swing of your fist was a reason to try.\nI built my own road from the wreckage you made,\nTurned your broken legacy to a debt I’ve repaid.\nPre-Chorus\nI fought through your darkness, I found my own light,\nI’m claimin’ my freedom in the dead of the night.\nChorus\nA hollow house, a heavy name —\nI carry your lessons and your shame.\nBut you can’t chain down a storm or a mind —\nI’m not just what Dad left behind.\nBridge\nEvery scar’s a story, every fight’s a song,\nI’m stronger for the pain you heaped on so long.\nYour ghost don’t own me, I’m cuttin’ the ties,\nI’m risin’ above what Dad left in his lies.\nChorus\nA hollow house, a heavy name —\nI carry your lessons and your shame.\nBut you can’t chain down a storm or a mind —\nI’m not just what Dad left behind.\nOutro\n*(Slow picking: E|-3---3---|)*\nNot just what Dad left behind… I’m free.",
      "suggested_venues": []
    },
    "when_mountains_weep": {
      "title": "When Mountains Weep",
      "status": "private",
      "lyrics": "[Verse 1]\nCoal dust settles where the pines grow thin\nHollers whisper of the hurt within\nGraves unmarked beneath the ridge’s weight\nHold the dreams that time forgot to save\n[Pre-Chorus]\nRivers carve the scars my fathers wore\nSilent hollers crying out once more\nStone and sweat forever at war\n[Chorus]\nThe hollers cry where the coal veins died\nThe rivers mourn where our fathers lied\nWhen blood stains stone and secrets keep\nEven the mountains, even they weep\n[Verse 2]\nMama’s prayers sank in the valley’s shade\nPappa’s hands broke for the debts unpaid\nTheir ghosts still walk where the wildflowers fade\nIn the shadow of the lives they made\n[Pre-Chorus]\nRivers carve the scars my fathers wore\nSilent hollers crying out once more\nStone and sweat forever at war\n[Chorus]\nThe hollers cry where the coal veins died\nThe rivers mourn where our fathers lied\nWhen blood stains stone and secrets keep\nEven the mountains, even they weep\n[Bridge]\nEvery seam I crawled, I learned their pain\nEvery callus holds a family’s chain\nBetrayed by love, by land, by greed\nI sing for souls this world don’t need\n[Post-Chorus]\nWind carries tales of loss and shame\nEach echo bearing an unspoken name\nI sing their sorrow into lasting flame\n[Chorus]\nThe hollers cry where the coal veins died\nThe rivers mourn where our fathers lied\nWhen blood stains stone and secrets keep\nEven the mountains, even they weep\n[Outro]\nBeneath the peaks where the silence sleeps\nEven the mountains, even they weep",
      "suggested_venues": [
        "amphitheater",
        "church",
        "coffee_shop",
        "listening_room",
        "outdoor_venue",
        "small_theater"
      ]
    },
    "yes_boys_do_cry_sometimes": {
      "title": "Yes, Boys Do Cry Sometimes",
      "status": "private",
      "lyrics": "Yes, Boys Do Cry Sometimes\n(Verse 1) Shoulders built like mountains, jaw carved out of stone Walk this Pikeville dirt path feelin' quite alone Got the kind of blue eyes make the girls all stare Wear these calloused knuckles like a cross I bear Down on Blackberry Creek, in that rusty double-wide Hid that broke-string guitar deep down safe inside Found it by the highway, six years old and scared Played out Daddy's liquor snores, a secret life I shared Heard him slur, \"You killed her,\" felt the belt bite deep and low Learned to choke the music back, not let the feelin' show\n(Chorus) They tell you build the walls high, boy, be a man of stone Keep the hurtin' buried, deep inside the bone Straighten up that backbone, don't you show the fear But some floods rise too heavy, year after lonely year Yeah, the dam can break, the ocean starts to rise Yes, boys do cry sometimes, behind these fighter's eyes\n(Verse 2) Left home at sixteen, punch fresh on my face Found a room with Jonesy, another sorry place Crawled the seams on bloody knees, breathed the black-lung air Worked the fields till sundown, showin' you I cared Every eighteen-hour day, scrapin' dirt and coal Was sendin' you to college, tryin' to make you whole You were my one soft place, my only whispered dream My anchor 'gainddddst the current of that dark Kentucky stream Then that movin' picture, shinin' on the screen Showed my anchor draggin' through a place I'd never been\n(Chorus) They tell you build the walls high, boy, be a man of stone Keep the hurtin' buried, deep inside the bone Straighten up that backbone, don't you show the fear But some floods rise too heavy, year after lonely year Yeah, the dam can break, the ocean starts to rise Yes, boys do cry sometimes, behind these fighter's eyes\n(Bridge) This body's built for battle, muscle hard and tight Thought I'd carved out somethin' that could stand against the night But muscle can't stop memories, can't outrun the fear And betrayal's got a sharp edge, cuts you ear to ear This choked-up voice inside me, the songs I couldn't free Screamin' silent thunder, now spillin' out of me It ain't weakness breakin', maybe it's the start Of lettin' out the poet trapped inside this bleedin' heart\n(Chorus) They tell you build the walls high, boy, be a man of stone Keep the hurtin' buried, deep inside the bone Straighten up that backbone, don't you show the fear But some floods rise too heavy, year after lonely year Yeah, the dam can break, the ocean starts to rise Yes, boys do cry sometimes, behind these fighter's eyes\n(Outro) So I hold this rescued six-string, scarred up just like me Let the teardrops fall like acid rain, finally runnin' free Underneath this coal town moon, lettin' the pain bleed through... Yes, boys do cry sometimes... tonight, this boy does too. (Guitar fades out slowly, leaving a resonant, aching chord)",
      "suggested_venues": [
        "coffee_shop",
        "listening_room",
        "small_theater"
      ]
    },
    "hollow_turns_hallelujah": {
      "title": "Hollow Turns Hallelujah",
      "status": "private",
      "lyrics": "Hollow Turns Hallelujah\nVerse 1\nBoot prints fading, desert moon hanging low\nGuard duty whispers, stories we all know\nChopper blades turning, a melancholic drone\nThe campfire's out, brothers gone, too soon flown\nVerse 2\nWe built our bunkers, sandbags stacked up high\nDreamed of homecomings 'neath a foreign sky\nShared our rations, stories raw and true\nNow the echoes fade, a future we couldn't view\nChorus\nBut the hollow turns hallelujah, in the quiet of the years\nA symphony of service, washed away by bittersweet tears\nWe raise our voices, cracked and worn, a campfire choir once more\nSingin' hymns of resilience, from the scars that we bore\nVerse 3\nRifle shots echo, a bugle out of tune\nForgotten faces flicker beneath the desert moon\nThe camaraderie lingers, a ghost in the desert air\nA reminder of courage, a burden that we share\nBridge\nWe scattered like shrapnel, on the winds of war we flew\nChasing a mission's purpose, some lost, some seeing it through\nBut the bonds run deep, beneath the surface they reside\nBound by the campfire's glow, where our brothers' spirits abide\nChorus\nAnd the hollow turns hallelujah, in the quiet of the years\nA symphony of service, washed away by bittersweet tears\nWe raise our voices, cracked and worn, a campfire choir once more\nSingin' hymns of resilience, from the scars that we bore\nOutro\nHallelujah, hallelujah, from the hollow we rise\nHallelujah, hallelujah, with strength in our eyes\nThe campfire's memory burns, a beacon in the night\nGuiding us home, bathing our souls in its light.\nHallelujah.",
      "suggested_venues": [
        "amphitheater",
        "church",
        "outdoor_venue",
        "revival"
      ]
    },
    "lantern_i_left_behind": {
      "title": "Lantern I Left Behind",
      "status": "private",
      "lyrics": "Lantern I Left Behind\n(Verse 1)\nSunrise spills across the ridge, paints the valley gold\nAnother day breaks on this farm, a story left untold\nOf restless nights and whispered dreams beneath a moonless sky\nAnd the lantern I left burning low, the night you said goodbye.\nThe crickets chirped a lonely tune, the wind sighed through the trees\nI watched your shadow disappear, carried on the breeze.\n(Chorus)\nLantern I left behind, a flickering ember glow\nA beacon in the darkness, watchin' where you go\nA fragile flame against the dawn, a hope I couldn't keep\nJust a memory now, a promise I couldn't sleep.\n(Verse 2)\nThe rooster crows, a mournful sound, echoes through the air\nAnother day to plow these fields, another burden to bear\nThe coffee's strong and bitter black, like the taste in my mouth now\nRemember how we used to laugh, beneath the apple bough?\nWe carved our initials in the bark, swore it'd always be\nBut time and distance took their toll, and stole you away from me.\n(Bridge)\nMaybe someday down the road, our paths will cross again\nMaybe someday I'll understand, and forgive the hurt and pain\nMaybe someday the lantern's light won't sting my eyes so bright\nMaybe someday I'll find my peace, in the stillness of the night.\n(Chorus)\nLantern I left behind, a flickering ember glow\nA beacon in the darkness, watchin' where you go\nA fragile flame against the dawn, a hope I couldn't keep\nJust a memory now, a promise I couldn't sleep.\n(Outro)\nJust a memory now, a lantern I left behind\nBurning in the morning light, a love I couldn't find.\nBurning in the morning light…",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "morning_after_rain": {
      "title": "Morning After Rain",
      "status": "private",
      "lyrics": "Morning After Rain\n(Verse 1)\nSunrise paints the valley gold, a mist hangs in the air\nThe creek bed whispers stories of the flood that raged through there\nThe earth drinks deep, the thirsty roots, reach down for grace anew\nAnd I remember every tear, that washed over me and you\n(Chorus)\nMorning after rain, the scars begin to bloom\nWildflowers in the canyons, pushing through the gloom\nBroken branches reach for light, a testament of will\nMorning after rain, His mercy fills me still\n(Verse 2)\nThe wind chimes sing a gentle song, a melody of peace\nThe broken fence post stands alone, a reminder grief will cease\nThe scent of honeysuckle sweet, a promise on the breeze\nThat even in the deepest hurt, there's solace in the trees\n(Bridge)\nI used to hide the broken parts, afraid to let them show\nBut every crack and every line, is how I learn to grow\nThe storm may rage, the thunder roar, but faith will see me through\n'Cause even shattered pieces, can reflect the morning dew\n(Chorus)\nMorning after rain, the scars begin to bloom\nWildflowers in the canyons, pushing through the gloom\nBroken branches reach for light, a testament of will\nMorning after rain, His mercy fills me still\n(Outro)\nMorning after rain, the sun breaks through the clouds\nMorning after rain, His love shouts out aloud.\nMorning after rain.",
      "suggested_venues": [
        "amphitheater",
        "church",
        "coffee_shop",
        "house_concert",
        "listening_room",
        "outdoor_venue",
        "revival",
        "small_theater"
      ]
    },
    "if_youre_breathing_youre_worth_saving": {
      "title": "If You’re Breathing, You’re Worth Saving",
      "status": "private",
      "lyrics": "If You’re Breathing, You’re Worth Saving\nVerse 1\nDust motes dancing in the faded light\nOf a single bulb hanging low tonight\nEmpty bottle whispers stories untold\nAnother heart grown weary and old\nHe sits and stares at the cracked window pane\nRain streaks down like tears, washing away the stain\nOf a life lived hard, a path gone astray\nLost in the shadows, afraid of the day\nChorus\nBut if you’re breathing, you’re worth saving\nA flicker of hope in the darkness waving\nEven when the whispers tell you you’re done\nThere’s a sunrise waiting, a battle to be won\nIf you’re breathing, you’re worth saving\nDon’t let the shadows keep you from craving\nThe light that’s within, the strength you possess\nRise from the ashes, find your blessedness\nVerse 2\nShe walks the streets with her head held down\nInvisible wounds in this bustling town\nA silent scream trapped behind her eyes\nLost in the echoes of a thousand lies\nCarries the weight of a broken promise made\nA fractured dream that slowly decayed\nShe searches for solace, a hand to hold tight\nA beacon of hope in the darkest of night\nChorus\nBut if you’re breathing, you’re worth saving\nA flicker of hope in the darkness waving\nEven when the whispers tell you you’re done\nThere’s a sunrise waiting, a battle to be won\nIf you’re breathing, you’re worth saving\nDon’t let the shadows keep you from craving\nThe light that’s within, the strength you possess\nRise from the ashes, find your blessedness\nBridge\nThe world may judge you, may turn away its face\nBut grace finds its way to the most desolate place\nDon’t give up now, there’s still time to mend\nA broken heart can learn to love again\nChorus\nIf you’re breathing, you’re worth saving\nA flicker of hope in the darkness waving\nEven when the whispers tell you you’re done\nThere’s a sunrise waiting, a battle to be won\nIf you’re breathing, you’re worth saving\nDon’t let the shadows keep you from craving\nThe light that’s within, the strength you possess\nRise from the ashes, find your blessedness\nOutro\nIf you’re breathing… you’re worth saving…\nYou’re worth saving…\nYou’re worth saving…",
      "suggested_venues": []
    },
    "red_dirt_road": {
      "title": "Red Dirt Road",
      "status": "private",
      "lyrics": "Red Dirt Road\n(Verse 1)\nSunrise paints the cotton fields a hazy shade of gold\nAnother town I can't recall, another story told\nOf a restless heart and wandering feet, a shadow in the night\nSearching for a place to land, a flicker of guiding light\nThey call me outlaw, rebel soul, a drifter through and through\nBut beneath this hardened shell, a homesick heart beats true\n(Chorus)\nRed dirt road, windin' back to where I belong\nWhere the cypress trees stand tall and the mockingbird's sweet song\nEchoes through the valleys, a memory so clear\nRed dirt road, whisperin' \"you're finally here\"\n(Verse 2)\nRan from the whispers, the judgment in their eyes\nFrom the expectations heavy, beneath these southern skies\nThought I could outrun the past, the ghosts that held me down\nBut freedom's just a hollow word in every nameless town\nTraded family for the highway, love for open space\nNow I see the emptiness etched upon my weary face\n(Bridge)\nThe asphalt ribbon stretched on, a promise never kept\nOf something more, something different, a secret I had slept\nWith for too long, a restless dream that turned into a lie\nNow I'm turnin' 'round, headin' back, beneath the open sky\n(Chorus)\nRed dirt road, windin' back to where I belong\nWhere the cypress trees stand tall and the mockingbird's sweet song\nEchoes through the valleys, a memory so clear\nRed dirt road, whisperin' \"you're finally here\"\n(Outro)\nDust devils dancin' in the afternoon sun's glow\nRed dirt road, takin' me home, slow and low\nYeah, takin' me home, slow and low.\nRed dirt road, I'm finally home, I know.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "scars_and_smoke": {
      "title": "Scars and Smoke",
      "status": "private",
      "lyrics": "Verse 1\nSunrise bleeds red over coal-dust hills, another day’s begun,\nGravel crunches under boots, chasin’ a merciless sun.\nAin’t the life I dreamed, boy, ain’t the hand I aimed to draw,\nBut ghosts of broken yesterdays still claw me raw.\nPre-Chorus\nNo preacher’s words could save me, no bottle drowns the pain,\nJust me and these old scars, walkin’ through the rain.\nChorus\nScars and smoke, heart carved to stone, that’s all they think I am,\nA rambler’s soul, bound to roam, with a rebel’s give-a-damn.\nBut deep beneath this busted shell, a spark still fights to burn,\nScratchin’ through the gates of hell, for peace I’ll never earn.\nVerse 2\nHighway’s a lonesome thread, gray as a miner’s grave,\nEach mile a cut that memory’s blade never forgave.\nBurned my bridges, paid in blood, for choices I can’t mend,\nHuntin’ grace in ghost-town dust, where the lost roads end.\nPre-Chorus\nNo mercy in the mirror, just a boy who learned to fight,\nCarvin’ truth from shattered years, under cold starlight.\nChorus\nScars and smoke, heart carved to stone, that’s all they think I am,\nA rambler’s soul, bound to roam, with a rebel’s give-a-damn.\nBut deep beneath this busted shell, a spark still fights to burn,\nScratchin’ through the gates of hell, for peace I’ll never earn.\nBridge\nThey say time stitches wounds, but mine still bleed and scream,\nEchoes of a daddy’s fist haunt every damn dream.\nI won’t let the dark win, won’t lay down and die,\nGonna claw toward that faint light, till I touch the sky.\nChorus\nScars and smoke, heart carved to stone, that’s all they think I am,\nA rambler’s soul, bound to roam, with a rebel’s give-a-damn.\nBut deep beneath this busted shell, a spark still fights to burn,\nScratchin’ through the gates of hell, for peace I’ll never earn.\nOutro\n*(Slow picking, low E drone)*\nJust a flicker of peace tonight, under this lonesome moon so bright.\nScars and smoke, it’s all I’ve known,\nKeep walkin’ these roads, till I call ‘em home.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue",
        "roadhouse"
      ]
    },
    "wildflower_heart": {
      "title": "Wildflower Heart",
      "status": "private",
      "lyrics": "Title:  Wildflower Heart\n(Verse 1)\nGrandma's china, chipped and worn\nSitting pretty on a shelf, a life adorned\nWith stories whispered, dreams untold\nA legacy of strength, a heart of gold\nBut I wasn't born for porcelain and lace\nThis restless spirit needed open space\nTo find my own voice, my own design\nA different kind of beauty, a wilder vine\n(Chorus)\nI'm a wildflower heart, blooming late\nReaching for the sun, defying fate\nBreaking free from fences, painted white\nDancing in the moonlight, bathed in silver light\nI'm a wildflower heart, finally free\nThis untamed spirit, that's the real me\n(Verse 2)\nMama's wisdom, etched in lines\nOn her hands that worked, through sun and shine\nShe taught me kindness, grace, and how to pray\nBut sometimes silence stole my words away\nI traded whispers for a roaring sound\nMy roots ran deeper in unturned ground\nWhere shadows danced and secrets grew\nAnd I discovered truths, mama never knew\n(Bridge)\nMaybe it's the wind that carries seeds of change\nAcross the generations, rearranging\nThe patterns of our lives, the paths we roam\nUntil we finally find our way back home\nTo the heart that beats within, wild and strong\nWhere we belong, where we've belonged all along\n(Chorus)\nI'm a wildflower heart, blooming late\nReaching for the sun, defying fate\nBreaking free from fences, painted white\nDancing in the moonlight, bathed in silver light\nI'm a wildflower heart, finally free\nThis untamed spirit, that's the real me\n(Outro)\nYeah, this wildflower heart, it's finally free\nBlooming bright, for everyone to see\nThis untamed spirit, that's the real me\nThe real me.",
      "suggested_venues": [
        "amphitheater",
        "church",
        "outdoor_venue",
        "revival"
      ]
    },
    "full_and_gone": {
      "title": "Full and Gone",
      "status": "private",
      "lyrics": "Verse 1\nI packed my scars in a beat-up truck, left Pikeville in the dust,\nCoal-black memories clingin’ tight, like rust that won’t unrust.\nAin’t no fixin’ what that town broke, no mendin’ what it stole,\nBut I rolled out with a heart still beatin’, battered but whole.\nPre-Chorus\nNo tears for that trailer, no love for its chains,\nJust a boy’s old ghosts and a man’s new pains.\nChorus\nI left this town full, not fixed, but full,\nCarried my dreams past the weight of its pull.\nWith a rusted guitar and a fire inside,\nI’m gone from the holler, but I’m still alive.\nVerse 2\nBlackberry Creek’s where I learned to bleed, where fists taught me to stand,\nFound a six-string in a dumpster’s wreck, salvation in my hands.\nEvery bruise a map of hurt, every street a dead-end lie,\nBut I’m haulin’ hope down this open road, under a clearer sky.\nPre-Chorus\nNo preacher could save me, no bottle could drown,\nThe screams of that double-wide, that ghost-ridden town.\nChorus\nI left this town full, not fixed, but full,\nCarried my dreams past the weight of its pull.\nWith a rusted guitar and a fire inside,\nI’m gone from the holler, but I’m still alive.\nBridge\nI ain’t healed, but I’m heavy with fight,\nHer spark lit the way through my darkest night.\nFrom the mines’ cold grip to the stage’s raw glow,\nI’m full of the strength that only leavin’ can show.\nChorus\nI left this town full, not fixed, but full,\nCarried my dreams past the weight of its pull.\nWith a rusted guitar and a fire inside,\nI’m gone from the holler, but I’m still alive.\nOutro\n*(Slow picking, low E drone)*\nFull and gone, with the mountain’s old hum,\nSingin’ my truth, till the new day comes.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "blackberry_creek_blues": {
      "title": "Blackberry Creek Blues",
      "status": "private",
      "lyrics": "Title: Blackberry Creek Blues\n(Verse 1)\nSun bleeds orange through the pines, 'nother day done broke\nDown Blackberry Creek Road, where the silence only spoke\nOf broken promises and ghosts that linger in the air\nDaddy's shadow on the porch, a weight I couldn't bear.\nSixteen years and a busted arm, a guitar and a suitcase old\nWalked away from that hollow, a story yet untold.\n(Chorus)\nBlackberry Creek Blues, singin' in my soul\nA melody of hardship, a story to unfold\nOf coal dust and callouses, a heart both tough and worn\nBlackberry Creek Blues, the day that I was born.\n(Verse 2)\nFound a shack down by the river, traded work for bed\nPickin' beans and diggin' coal, a roof above my head\nThis rusted six-string sings my sorrow, sings my pain\nA broken boy from broken mountains, singin' in the rain.\nAin't lookin' for no pity, ain't lookin' for no fame\nJust tryin' to find my own damn rhythm in this life's hard game.\n(Bridge)\nMama used to hum a hymn, a whisper in the dark\nSaid, \"Boy, find your own damn light, leave your own damn mark.\"\nHer words echo in the hollers, a comfort and a guide\nAs I wrestle with the demons that I keep locked inside.\n(Chorus)\nBlackberry Creek Blues, singin' in my soul\nA melody of hardship, a story to unfold\nOf coal dust and callouses, a heart both tough and worn\nBlackberry Creek Blues, the day that I was born.\n(Outro)\nYeah, Blackberry Creek Blues, they run deep and strong\nLike the roots of these old mountains, where I belong.\nWhere I belong.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "faded_mountain_truths": {
      "title": "Faded Mountain Truths",
      "status": "private",
      "lyrics": "Title:  Faded Mountain Truths\n(Verse 1)\nFaded photographs in a dusty frame\nMama's smilin' face, ain't nothin' changed\n'Cept the lines etched deeper, like the cracks on these hills\nYears of worry and winters' chills\nDaddy's shadow, a storm cloud gray\nHangin' heavy, never went away\nLearned my lessons in the holler's shade\nMountain wisdom, hard earned and paid\n(Chorus)\nThese mountains whisper secrets old and true\nTough as the roots that see 'em through\nLike the wind that bends the pine so low\nGotta bend, not break, to weather the blow\nFaded mountain truths, etched in stone\nA legacy of hardship, a heart I call my own\n(Verse 2)\nSixteen years, Blackberry Creek Road dust on my boots\nKicked out the door, nothin' but the clothes on my back, and a few faded roots\nFound shelter in a tin can shack, leaks when it rained\nWorked the fields, the mines, felt the body ache and pain\nThis broken arm, a constant reminder of his rage\nBut these calloused hands, they turned a new page\nFound solace in the strings of a rusted guitar\nSingin' my sorrows, beneath the evenin' star\n(Bridge)\nHe tried to break me, spirit and bone\nBut the mountain in me wouldn't be overthrown\nLike the coal that burns, a fire within\nI rose from the ashes, learned to begin\n(Chorus)\nThese mountains whisper secrets old and true\nTough as the roots that see 'em through\nLike the wind that bends the pine so low\nGotta bend, not break, to weather the blow\nFaded mountain truths, etched in stone\nA legacy of hardship, a heart I call my own\n(Outro)\nSun's comin' up, paintin' the sky gold\nA new day breakin', a story yet untold\nAnd though the shadows linger, I ain't afraid no more\nGot faded mountain truths, to guide me to the shore.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "drink_to_the_family": {
      "title": "Drink to the Family",
      "status": "private",
      "lyrics": "(Verse 1)\nDust on my boots from a road gone rough\nChased dreams that broke when the times got tough\nKin turned their backs, left scars on my hide\nBut I found my crew where the good vibes ride\nA shot of Jack burns the pain away\nThese friends are my home, they’re here to stay\n(Chorus)\nRaise a shot of Jack to the family that ain’t blood\nToast the ones who lift you from the mud\nWhen the world slams the door, they kick it in tight\nThese rowdy hearts blaze wild in the night\nHere’s to family, true and bold!\n(Verse 2)\nWorked ‘til my hands cracked, bones wore thin\nFelt every loss like a cold, hard sin\nGhosts try to drag me, but I ain’t alone\nMy posse’s my throne, this tailgate’s our zone\nA bottle of Bud, we pass it around\nLaugh ‘til we’re dizzy, no hurt to be found\n(Verse 3)\nMoonlight’s our spotlight, the stars set the stage\nRaisin’ hell together, we’re writin’ this page\nFights and hard nights, we’ve weathered the storm\nThese brothers and sisters, they keep my heart warm\nA jar of moonshine, it stings, but it’s sweet\nTo the kin that I chose, who make life complete\n(Bridge)\nThis old guitar wails a rebel’s tune\nSings of nights lit by a bonfire moon\nHere’s to the lost, the wild, the free\nThe ones who stood tall and drank with me\nThey’re my fight, my soul, my song\n(Chorus)\nRaise a shot of Jack to the family that ain’t blood\nToast the ones who lift you from the mud\nWhen the world slams the door, they kick it in tight\nThese rowdy hearts blaze wild in the night\nHere’s to family, true and bold!\n(Outro)\nYeah, true and bold, through the highs and the lows\nBottle of Bud, moonshine’s glow\nRaise a shot of Jack, let the good times roll",
      "suggested_venues": [
        "amphitheater",
        "festival",
        "honky_tonk",
        "house_concert",
        "outdoor_venue",
        "roadhouse",
        "stadium"
      ]
    },
    "mamma_make_him_stop": {
      "title": "Mamma Make Him Stop",
      "status": "private",
      "lyrics": "Verse\nDaddy’s yellin’ loud, his hands they hurt me so,\nI hide under my bed, where the shadows grow.\nBottle’s on the floor, it’s breakin’ up our home,\nI’m scared and all alone, wishin’ he’d be gone.\nChorus\nMama, make him stop, please make him go away,\nI’m prayin’ through my tears, for a brighter day.\nMama, hear my song, I’m beggin’ you to try,\nMake him stop the hurt, so I don’t have to cry.",
      "suggested_venues": []
    },
    "hell_and_hymns": {
      "title": "Hell and Hymns",
      "status": "private",
      "lyrics": "Verse 1\nFriday night, under neon’s roar,\nWhiskey’s pullin’ hard, settlin’ old scores.\nJukebox wails, hearts hit the floor,\nDancin’ through the haze, chasin’ something more.\nAnother week of grind, bones worn thin,\nSweat still burns where the work don’t end.\nBut tonight we’re alive, breakin’ every chain,\n‘Til the sunrise lights the sky with flame.\nPre-Chorus\nRunnin’ wild, but the soul’s still split,\nTorn between the dark and the holy lit.\nChorus\nHell and hymns, we’re caught in the fray,\nWhiskey sins, then we kneel to pray.\nThis heart keeps fightin’, searchin’ for release,\nBetween the devil’s fire and a savior’s peace.\nHell and hymns, our anthem’s cry,\nSaturday’s rebellion, Sunday’s sky.\nRisin’ from the ashes ‘neath a lonesome moon,\nLord, redeem these hands, scarred and strewn.\nVerse 2\nGuitar moans a lonesome plea,\nEmpty bottle spins, hauntin’ memories.\nFound that six-string in a junkyard’s shine,\nStrummed my soul where the wild winds whine.\nOld man’s shadow still stalks my days,\nHis bitter words like a hell that stays.\nBut mama’s prayers, they pull me through,\nWhisperin’ hope in the morning dew.\nPre-Chorus\nLivin’ rough, but the heart holds strong,\nSeekin’ light where the nights are long.\nChorus\nHell and hymns, we’re caught in the fray,\nWhiskey sins, then we kneel to pray.\nThis heart keeps fightin’, searchin’ for release,\nBetween the devil’s fire and a savior’s peace.\nHell and hymns, our anthem’s cry,\nSaturday’s rebellion, Sunday’s sky.\nRisin’ from the ashes ‘neath a lonesome moon,\nLord, redeem these hands, scarred and strewn.\nBridge\nNo preacher’s verse, just a worker’s call,\nCoal-dust dreams climbin’ past the fall.\nBeggin’ for a spark to break the night,\nFrom the shadows to salvation’s light.\nChorus\nHell and hymns, we’re caught in the fray,\nWhiskey sins, then we kneel to pray.\nThis heart keeps fightin’, searchin’ for release,\nBetween the devil’s fire and a savior’s peace.\nHell and hymns, our anthem’s cry,\nSaturday’s rebellion, Sunday’s sky.\nRisin’ from the ashes ‘neath a lonesome moon,\nLord, redeem these hands, scarred and strewn.\nOutro\n*(Fiddle soar, steady strum)*\nHell and hymns, my soul’s still tried,\nBut I’m risin’ up where the heart don’t hide.\nAmen.",
      "suggested_venues": [
        "dive_bar",
        "festival",
        "honky_tonk",
        "roadhouse"
      ]
    },
    "when_you_cant_be_near_me": {
      "title": "When You Can't Be Near Me",
      "status": "private",
      "lyrics": "(Verse 1) When you can't be near me, please think of me, I'm starin' at the highway, where you used to be. You're gone, my darlin', chasin' some new flame, But my heart's still ramblin', callin' out your name.\n(Pre-Chorus) This whiskey's cold, it don't ease the pain, Without you here, I'm half insane.\n(Chorus) When you can't be near me, oh, my lonesome soul, Keep me in your rearview, where the heartaches roll. Sing my name like a jukebox, broken, wild, and free, When you can't be near me, please think of me.\n(Verse 2) I'm thumbin' through old photos, on this cracked phone screen, Your smile's a ghost now, in this lonesome scene. Got your voice in my head, like a steel guitar's cry, Keeps me holdin' on, beneath this empty sky.\n(Pre-Chorus) The barstool's creakin', but it ain't my home, Without your touch, I'm destined to roam.\n(Chorus) When you can't be near me, oh, my lonesome soul, Keep me in your rearview, where the heartaches roll. Sing my name like a jukebox, broken, wild, and free, When you can't be near me, please think of me.\n(Bridge) So raise a glass, wherever you ride, Send a prayer on the wind, to the lonesome side. We'll cross paths again, down some dusty road, Till then, I'm carryin' this heavy load.\n(Chorus) When you can't be near me, oh, my lonesome soul, Keep me in your rearview, where the heartaches roll. Sing my name like a jukebox, broken, wild, and free, When you can't be near me, please think of me.\n(Outro) So when you're out there, under neon's glow, I'm still your rebel, in the shadows, you know. Till we're back together, where we're meant to be, When you can't be near me... please think of me. Yeah, think of me. (Oh, my lonesome soul.) Think of me.",
      "suggested_venues": [
        "dive_bar",
        "festival",
        "honky_tonk",
        "roadhouse"
      ]
    },
    "whiskey_dont_lie": {
      "title": "Whiskey Don't Lie",
      "status": "private",
      "lyrics": "(Verse 1)\nI’m sittin’ at this barstool, with a neon glow,\nPourin’ out my heartache, where the jukebox flows.\nThe bartender knows me, he don’t ask my name,\nJust slides another whiskey, to kill the pain.\n(Pre-Chorus)\nThis dive bar’s my church, where the sinners pray,\nSpillin’ out their stories, till the break of day.\n(Chorus)\nWhiskey don’t lie, it tells it straight,\nBurns like the truth, no need to wait!\nRaise your glass high, let the heartache fly,\nSing it loud, boys, whiskey don’t lie!\n(Verse 2)\nThe gal I loved, she’s gone, took my ramblin’ heart,\nLeft me with this bottle, and a brand-new scar.\nBut this amber fire, it don’t judge my sins,\nJust lights up the shadows, where my night begins.\n(Pre-Chorus)\nThe jukebox is wailin’, but it can’t compare,\nTo the truth in this glass, and the pain we share.\n(Chorus)\nWhiskey don’t lie, it tells it straight,\nBurns like the truth, no need to wait!\nRaise your glass high, let the heartache fly,\nSing it loud, boys, whiskey don’t lie!\n(Bridge)\nSo here’s to the lost, and the ones we miss,\nTo the fights and the nights, sealed with a kiss.\nEvery drop’s a preacher, every sip’s a song,\nSing it with me, brothers, we’ll howl all night long!\n(Chorus)\nWhiskey don’t lie, it tells it straight,\nBurns like the truth, no need to wait!\nRaise your glass high, let the heartache fly,\nSing it loud, boys, whiskey don’t lie!\n(Outro)\nWhen the barroom’s empty, and the stars burn low,\nI’ll stumble to the highway, with nowhere to go.\nBut I’ll carry this gospel, till the day I die,\nSing it one more time—whiskey don’t lie!\nYeah, whiskey don’t lie! (Raise ‘em up high!)\nWhiskey don’t lie!\nAcoustic sound: A stripped-down, raw acoustic arrangement with a steady strumming pattern highlights the song's heartache, while a mournful fiddle weaves in and out, emphasizing the lament. The vocal delivery is gritty and vulnerable, carrying the story's emotional weight with a conversational honesty.\nPotential Sound:\nOutlaw Country Vibe: The song channels the raw, rebellious spirit of outlaw country with vivid imagery (neon, jukeboxes, barstools) and a narrator who’s both broken and defiant. The whiskey serves as a metaphor for unfiltered truth, tying into the genre’s honesty. Singalong Energy: The repetitive chorus (“Whiskey don’t lie, it tells it straight”) and simple, anthemic hooks are designed for a crowd to shout along, with gang vocals and a bridge that rallies everyone to join in. Modern Touches: References to phones or modern heartbreak are subtle, keeping the focus on timeless barroom camaraderie, but the tone feels relatable for 2025. Performance: Picture this in a sweaty honky-tonk or a modern country musical, with a charismatic frontman leading a raucous band (electric guitar, fiddle, piano, drums). The crowd stomps boots, clinks bottles, and sings the chorus at the top of their lungs.",
      "suggested_venues": [
        "dive_bar",
        "festival",
        "honky_tonk",
        "roadhouse"
      ]
    },
    "run_from_the_reaper": {
      "title": "Run From the Reaper",
      "status": "private",
      "lyrics": "(Verse 1)\nThe dust kicks up behind me, on this lonesome road,\nMy boots are worn to nothin’, carryin’ this load.\nGot a warrant in my pocket, and a devil on my trail,\nRunnin’ from the reaper, but I’m bound to fail.\n(Pre-Chorus)\nThe wind’s howlin’ my name, through the midnight air,\nGhosts of my sins, they’re closin’ in there.\n(Chorus)\nRun from the reaper, but he’s closin’ in,\nHears my heart a-beatin’, smells my every sin.\nThrough the canyons and the shadows, I’ll ride till I’m free,\nRun from the reaper, but he’s comin’ for me.\n(Verse 2)\nMy old Chevy’s screamin’, tires spittin’ gravel fast,\nChasin’ down redemption, but I’m haunted by the past.\nEvery milepost mocks me, every star burns cold,\nThis outlaw’s soul’s too heavy, for the stories I’ve told.\n(Pre-Chorus)\nThe law’s lights are flashin’, in my rearview glow,\nBut the reaper’s shadow’s darker, and he won’t let go.\n(Chorus)\nRun from the reaper, but he’s closin’ in,\nHears my heart a-beatin’, smells my every sin.\nThrough the canyons and the shadows, I’ll ride till I’m free,\nRun from the reaper, but he’s comin’ for me.\n(Bridge)\nI’ve burned too many bridges, left too many scars,\nStole a piece of heaven, under these cruel stars.\nBut if I keep on runnin’, maybe I’ll outsmart,\nThat cold hand of fate, tearin’ at my heart.\n(Chorus)\nRun from the reaper, but he’s closin’ in,\nHears my heart a-beatin’, smells my every sin.\nThrough the canyons and the shadows, I’ll ride till I’m free,\nRun from the reaper, but he’s comin’ for me.\n(Outro)\nSo I’ll race this endless highway, till my engine dies,\nWith the reaper in my mirror, and fire in my eyes.\nOne last shot at freedom, one last rebel plea,\nRun from the reaper… but he’s comin’ for me.\nYeah, he’s comin’ for me. (Keep on runnin’ free.)\nComin’ for me.\nAcoustic sound: A raw, heart-pounding acoustic ballad with an urgent, mid-tempo pulse blends stripped-down vulnerability with fierce intensity, anchored by driving guitar and weathered, urgent vocals that evoke a high-stakes personal journey.\nPotential Sound:\nA high-octane outlaw country rocker with a driving, mid-to-up-tempo pulse, blending gritty authenticity with cinematic intensity. Anchored by twangy electric guitars and a relentless acoustic strum, the track pulses with a galloping kick drum and a deep, rumbling bassline, evoking a fugitive’s desperate ride. A searing pedal steel wail and occasional banjo plucks add raw country soul, while sparse harmonica stabs heighten the tension. The vocal delivery is weathered and urgent, with gritty, conversational phrasing and subtle backing harmonies that carry a ghostly edge. The tone is rebellious, desperate, and vivid, conjuring a lone outlaw tearing through a desert under a blood-red sky, perfect for a high-stakes Western chase scene, a modern country musical climax, or a road-trip playlist staple.\nWhy It’s Not a Ballad:\nTempo and Energy: The song now has a faster, driving rhythm, with a galloping beat and urgent guitar riffs that evoke a chase rather than a slow, mournful ballad. The energy is high, pushing the narrative forward like a fugitive on the run. Outlaw Country Core: It retains the genre’s raw storytelling, with vivid imagery (dusty roads, warrants, Chevy trucks) and themes of regret and defiance, but the tempo and instrumentation (electric guitars, kick drum) give it a rocker’s edge, appealing to fans of both classic and modern country. Phrasing: The Bye Bye Birdie-inspired short, rhythmic lines (“Run from the reaper, but he’s closin’ in”) remain, delivered with a conversational, almost frantic cadence that suits the chase narrative and keeps the song catchy. Mainstream Potential: The driving beat, anthemic chorus, and cinematic vibe give it crossover appeal, similar to high-energy country hits that blend outlaw grit with radio-ready hooks. Sound::\nVibe: The song feels like a high-stakes escape, with the reaper as both a literal and metaphorical pursuer. It’s gritty enough for purists but polished enough for a broader audience, with a sound that could fit a modern country festival or a film soundtrack. Performance: Envision this in a smoky roadhouse or a dramatic musical scene, with a rugged singer in a leather jacket, backed by a tight band (electric guitar, banjo, pedal steel, drums). The chorus could ignite a crowd to stomp and sing along, while the bridge offers a moment of raw intensity. Imagery and Themes: The lyrics paint a vivid picture of a fugitive’s life—dusty trails, flashing lights, burning bridges—while hinting at redemption, keeping the emotional depth intact.",
      "suggested_venues": [
        "amphitheater",
        "arena",
        "festival",
        "honky_tonk",
        "outdoor_venue",
        "roadhouse",
        "stadium"
      ]
    },
    "under_a_southern_sky": {
      "title": "Under a Southern Sky",
      "status": "private",
      "lyrics": "(Verse 1)\nI was runnin’ on empty, down a two-lane road,\nChasin’ whiskey sunsets, with a heavy load.\nLeft my dreams in a dive bar, thought I’d lost my way,\nTill your smile lit the darkness, like a summer day.\n(Pre-Chorus)\nThis old heart was wanderin’, till you called my name,\nNow I’m standin’ in the starlight, and I’ll never be the same.\n(Chorus)\nI find my heart, find my soul, find you under a southern sky,\nWhere the pines whisper secrets, and the fireflies fly.\nWith your hand in mine, I’m alive, I’m whole,\nI find my heart, find my soul, under a southern sky.\n(Verse 2)\nWe danced in the moonlight, by a creek’s soft hum,\nBarefoot on the red dirt, to a banjo’s strum.\nYour laughter’s my compass, through the highs and lows,\nYou’re the home I never knew, where my restless spirit goes.\n(Pre-Chorus)\nNo more lone-star highways, no more lonesome fights,\nYou’re my rebel redemption, in the glow of the night.\n(Chorus)\nI find my heart, find my soul, find you under a southern sky,\nWhere the pines whisper secrets, and the fireflies fly.\nWith your hand in mine, I’m alive, I’m whole,\nI find my heart, find my soul, under a southern sky.\n(Bridge)\nWe’ve got scars from the battles, we’ve got stories to tell,\nFrom the honky-tonk heartaches to the heavens we fell.\nBut under these stars, with you by my side,\nI’ve found my forever, on this wild, sweet ride.\n(Chorus)\nI find my heart, find my soul, find you under a southern sky,\nWhere the pines whisper secrets, and the fireflies fly.\nWith your hand in mine, I’m alive, I’m whole,\nI find my heart, find my soul, under a southern sky.\n(Outro)\nSo let’s chase the horizon, where the dawn breaks wide,\nWith you, I’m unbroken, on this southern sky ride.\nI find my heart, find my soul, forever you and I,\nUnder a southern sky… under a southern sky.",
      "suggested_venues": [
        "amphitheater",
        "dive_bar",
        "honky_tonk",
        "outdoor_venue",
        "roadhouse"
      ]
    },
    "whispers_from_the_hemlock_holler": {
      "title": "Whispers from the Hemlock Holler",
      "status": "private",
      "lyrics": "(Verse 1)\nCreek water whisperin' secrets low,\n'Bout the mountain's wisdom, slow and slow.\nHemlock shadows stretchin' long and deep,\nPeace in the silence, secrets to keep.\nCampfire light a-flickerin' in the night,\nStars above, burnin' ever so bright.\n(Chorus)\nOld man mountain, he don't speak a word,\nBut lessons learned, ain't never heard\nIn no dusty book or preacher's plea,\nJust the wind's sigh in the old oak tree.\nTruth ain't found in the city's glare,\nIt's here in the hollers, hangin' in the air.\n(Verse 2)\nDaddy's anger, a thunderin' storm,\nLeft scars deeper than any coal mine's form.\nSixteen years, kicked out in the cold,\nThese Kentucky hollers, stories untold.\nBroken arm, achin' bone and all,\nBut this rusted guitar, answered my call.\n(Bridge)\nFound solace in the strings, a mournful cry,\nEchoin' the pain I couldn't deny.\nEach note a whisper, a prayer sent high,\nTo the mountain's spirit, beneath the sky.\n(Chorus)\nOld man mountain, he don't speak a word,\nBut lessons learned, ain't never heard\nIn no dusty book or preacher's plea,\nJust the wind's sigh in the old oak tree.\nTruth ain't found in the city's glare,\nIt's here in the hollers, hangin' in the air.\n(Outro)\nYeah, hangin' in the air, like the mountain mist,\nA quiet knowin', that can't be missed.\nWhispers from the hemlock, soft and low,\nThe mountain's wisdom, helpin' me grow...",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "shadows_holler": {
      "title": "Shadow’s Holler",
      "status": "private",
      "lyrics": "(Verse 1)\nIn the hollow where the river bends,\nA whisper fights the wind’s old trends.\nIt claws at the silence, sharp as a knife,\nBeggin’ to sing, but it fears the light.\n(Pre-Chorus)\nThe crows keep circlin’, they know my name,\nCallin’ me out, but I dodge the flame.\n(Chorus)\nShadow’s holler, screamin’ through the pines,\nCarries my truth, where the moonlight shines.\nIt roars in the dark, but it hides from the day,\nShadow’s holler, got too much to say.\n(Verse 2)\nThere’s a fire in the valley, burnin’ deep and low,\nWords carved in my bones, that the river knows.\nThey churn like a current, wild and untamed,\nBut the spotlight’s a hunter, and I’m the game.\n(Pre-Chorus)\nThose black wings hover, they won’t let me be,\nUrgin’ me loud, but I long to stay free.\n(Chorus)\nShadow’s holler, screamin’ through the pines,\nCarries my truth, where the moonlight shines.\nIt roars in the dark, but it hides from the day,\nShadow’s holler, got too much to say.\n(Bridge)\nI’ve seen the stage’s glow, a siren’s call,\nPromisin’ glory, but it takes it all.\nYet the echo in my chest, it won’t stay still,\nLike a ghost in the canyon, it’s hauntin’ me still.\n(Chorus)\nShadow’s holler, screamin’ through the pines,\nCarries my truth, where the moonlight shines.\nIt roars in the dark, but it hides from the day,\nShadow’s holler, got too much to say.\n(Outro)\nSo I’ll sing to the shadows, where the wild things roam,\nLet the river carry my heart back home.\nIn the quiet of the night, my truth’ll still fly,\nShadow’s holler, under a lonesome sky.\nYeah, shadow’s holler… forever I’ll hide.\nVibe: The song feels like a late-night confession in a pine forest, balancing the songwriter’s hidden truth with a universal yearning for expression. It’s introspective yet anthemic, fitting for both a dive bar and a festival stage. Performance: Picture the rugged artist in a flannel, strumming under stage lights with a band (acoustic, electric, pedal steel, banjo). The chorus invites quiet singalongs, and the bridge offers a raw, spotlight moment. For TikTok or busking, an acoustic version would emphasize the guitar’s twang and the vocals’ grit. Appeal: The allegorical storytelling and emotional depth resonate with country purists, while the melody and production could catch mainstream ears, potentially climbing charts or going viral on social media.\nSounds Like\nA mid-tempo outlaw country anthem with a brooding, soulful edge, blending gritty authenticity with mainstream polish for radio and festival appeal. Anchored by a twangy acoustic guitar’s rhythmic strum and a haunting electric guitar riff, the track pulses with a steady kick drum and a deep, rolling bassline. A mournful pedal steel weaves through the verses, while subtle banjo plucks and a distant harmonica wail in the bridge add rural depth. The vocal delivery is raw, emotive, and slightly weathered, with conversational phrasing and soaring harmonies that lift the chorus into an anthemic cry. The tone is introspective, yearning, and allegorical, evoking a lone songwriter wrestling with his truth under a moonlit pine forest, perfect for a modern country playlist, a cinematic drama, or a heartfelt live performance.",
      "suggested_venues": [
        "amphitheater",
        "festival",
        "honky_tonk",
        "outdoor_venue",
        "roadhouse"
      ]
    },
    "canyons_cry": {
      "title": "Canyon’s Cry",
      "status": "private",
      "lyrics": "(Verse 1)\nThere’s a storm in the canyon, tearin’ through my bones,\nThunder’s got my secrets, carved in jagged stones.\nIt howls to break the silence, begs to shake the sky,\nBut the sun’s a ruthless witness, and I’m scared to fly.\n(Pre-Chorus)\nThe wildfire’s callin’, it won’t let me hide,\nRagin’ for the truth, burnin’ deep inside.\n(Chorus)\nCanyon’s cry, roarin’ through the night,\nScreamin’ all my pain, in a blaze of light.\nIt’s wild, it’s fierce, gonna lift me high,\nCanyon’s cry, born to defy!\n(Verse 2)\nI’ve danced with desert shadows, where the vultures soar,\nClutchin’ truths too heavy, that I can’t ignore.\nThey claw to reach the heavens, like a river’s flood,\nBut the spotlight’s a vulture, circlin’ for my blood.\n(Pre-Chorus)\nThe lightning’s pushin’, it won’t let me stay,\nUrgin’ me to holler, chase the dark away.\n(Chorus)\nCanyon’s cry, roarin’ through the night,\nScreamin’ all my pain, in a blaze of light.\nIt’s wild, it’s fierce, gonna lift me high,\nCanyon’s cry, born to defy!\n(Bridge)\nI’ve seen the valley’s altar, where the brave ones fall,\nHeard the siren’s promise, but it steals it all.\nYet this fire in my veins, it’s a rebel’s spark,\nGonna shout my soul, tear the silence apart!\n(Chorus)\nCanyon’s cry, roarin’ through the night,\nScreamin’ all my pain, in a blaze of light.\nIt’s wild, it’s fierce, gonna lift me high,\nCanyon’s cry, born to defy!\n(Outro)\nSo I’ll ride this storm, where the wild winds wail,\nLet the canyon carry my truth’s old tale.\nWith the stars as my witness, I’ll set my pain free,\nCanyon’s cry… it’s livin’ in me.\nYeah, canyon’s cry! (Raise it to the sky!)\nLivin’ in me.\nVibe: The song feels like a thunderstorm in a desert canyon, with the narrator’s pain transforming into a defiant, uplifting cry. It’s intense enough for outlaw fans but anthemic for mainstream crowds, ideal for a festival climax or a movie’s triumphant moment. Performance: Picture the artist in a leather jacket, commanding a stage with a band (electric guitar, banjo, pedal steel, fiddle). The chorus sparks crowd chants, and the bridge could feature a dramatic guitar solo or vocal wail. For TikTok/busking, an acoustic version would rely on fierce strumming and raw vocals. Appeal: The blend of pain and empowerment, plus the driving energy, could make it a chart-climber or social media hit, resonating with listeners seeking catharsis.\nSounds Like\nFull Band/Studio: The polished production amplifies the song’s “raise you up” energy with a full ensemble (electric guitar, pedal steel, banjo, fiddle, drums), making it a radio-ready anthem with outlaw grit, ideal for a festival or soundtrack. Acoustic/Live/Busking: Stripped to a single acoustic guitar, the raw vocals and rhythmic strumming preserve the song’s intensity and pain, perfect for an intimate TikTok live stream or a Nashville street corner, where the allegorical lyrics shine.",
      "suggested_venues": [
        "amphitheater",
        "festival",
        "honky_tonk",
        "outdoor_venue",
        "roadhouse",
        "stadium"
      ]
    },
    "church_of_country": {
      "title": "Church of Country",
      "status": "private",
      "lyrics": "Verse 1\nI hit the stage on red dirt, where the heartland’s callin’ me,\nFrom dive bar smoke to stadiums, this is where I’m free.\nHank’s ghost in my guitar, Dolly’s shine in my soul,\nCountry’s fire in my bones, it’s the only life I know.\n\nPre-Chorus\nSteel guitars are my pulpit, banjo’s my battle cry,\nEvery scar’s a song I sing, reachin’ for the sky.\n\nChorus\nThis is the Church of Country, where the faithful raise a spark,\nJohnny’s growl, Shania’s strut, lightin’ up the dark.\nSing for Patsy, for Stapleton, let the fiddle break the chains,\nCountry’s pulse is beatin’ loud, runnin’ wild in our veins!\n\nVerse 2\nI’m singin’ Loretta’s truth, Willie’s ramblin’ road,\nGeorge Jones’ whiskey heartache, carryin’ the load.\nFrom Waylon’s outlaw thunder to Miranda’s rebel flame,\nEvery note’s my hallelujah, country’s my true name.\n\nPre-Chorus\nBoots stomp the rhythm, my voice’ll shake the ground,\nIn this Church of Country, salvation’s what I’ve found.\n\nChorus\nThis is the Church of Country, where the faithful raise a spark,\nJohnny’s growl, Shania’s strut, lightin’ up the dark.\nSing for Patsy, for Stapleton, let the fiddle break the chains,\nCountry’s pulse is beatin’ loud, runnin’ wild in our veins!\n\nBridge\nIt’s a honky-tonk redemption, where the broken find their fight,\nCash’s truth, Kacey’s grace, guidin’ me through the night.\nFrom backroad hymns to neon dreams, I’ll carry on the sound,\nCountry’s heart is mine to hold, forever glory-bound!\n\nFinal Chorus\nThis is the Church of Country, where the roots will never fade,\nLoretta’s coal dust soul, Alan’s river escapade.\nRaise a glass for every dreamer, let the banjo’s fire roar,\nCountry’s callin’ me to sing, now and evermore!\n\nOutro\n*(Fiddle tears the roof off, steel guitar screams)*\nChurch of Country, hear my voice, let the whole world know,\nThis is my salvation, where my rebel heart’ll go!\n*(Pyro pops, crowd roars)*\nHallelujah, country soul, Alex takes the show!",
      "suggested_venues": [
        "arena",
        "church",
        "coffee_shop",
        "dive_bar",
        "festival",
        "honky_tonk",
        "house_concert",
        "listening_room",
        "revival",
        "roadhouse",
        "stadium"
      ]
    },
    "workin_for_a_living": {
      "title": "Workin' for a Living",
      "status": "private",
      "lyrics": "Verse 1\nDawn breaks hard, boots hit the ground,\nSweat’s my pay where the work is found.\nNo silver spoon, just a will to fight,\nPushin’ through the long days into the night.\n\nPre-Chorus\nBlisters on my hands, fire in my chest,\nEvery drop of sweat’s a step toward the best.\n\nChorus\nWorkin’ for a livin’, sunup till the stars burn bright,\nRough hands, tired bones, holdin’ on with all my might.\nAin’t got much, but I got heart, a spark that won’t let go,\nWorkin’ for a livin’, buildin’ dreams from the ground below.\n\nVerse 2\nFields of dust, factory’s hum,\nHaulin’ loads till my body’s numb.\nEvery ache’s a badge, every scar’s a sign,\nI’m carvin’ out a life that’s proud and mine.\n\nPre-Chorus\nNo shortcut’s callin’, no easy way,\nJust the grind that shapes me, day by day.\n\nChorus\nWorkin’ for a livin’, sunup till the stars burn bright,\nRough hands, tired bones, holdin’ on with all my might.\nAin’t got much, but I got heart, a spark that won’t let go,\nWorkin’ for a livin’, buildin’ dreams from the ground below.\n\nBridge\nRound the fire’s glow, we share the load,\nLaughin’ through the hurt, on this long road.\nFor the ones who toil, for the ones who strive,\nThis song’s for the workers keepin’ hope alive.\n\nChorus\nWorkin’ for a livin’, sunup till the stars burn bright,\nRough hands, tired bones, holdin’ on with all my might.\nAin’t got much, but I got heart, a spark that won’t let go,\nWorkin’ for a livin’, buildin’ dreams from the ground below.\n\nOutro\n(Fiddle kicks, steady strum)\nWorkin’ for a livin’, that’s my truth, my fight,\nFrom the break of dawn to the end of night.",
      "suggested_venues": [
        "arena",
        "festival",
        "honky_tonk",
        "roadhouse",
        "stadium"
      ]
    },
    "coal_dust_sunrise": {
      "title": "Coal Dust Sunrise",
      "status": "private",
      "lyrics": "Long shadows creep on the valley floor,\nAs the bleeding sky unveils what's in store.\nA cold breath sighs through the hollows deep,\nWhere old dreams stir and new promises keep.\nA shack stands weathered, a whisper of gray,\nBut a tender warmth chases shadows away.\nA soft hymn rises on the morning's chill,\nA silent plea, standing perfectly still.\n(Pre-Chorus)\nBeneath the grit, a spark ignites,\nChasing the ghosts of endless nights.\nThis ain't no Eden, raw and deep,\nBut promises the weary keep.\n(Chorus)\nThese coal dust sunrises, they stain the peaks in gray,\nBut hope's true fire still finds a way, yeah, it always finds a way.\nThe tired earth groans, a haunting, low refrain,\nYet grit-worn hands find strength to rise and live again.\nTo rise and breathe again.\n(Verse 2)\nThe earth gives freely, then demands its toll,\nEach dawn a testament to body and soul.\nRedemption's whisper in the morning's light,\nA bruising struggle, a constant, inner fight.\nA flicker of grace, a beacon in the night,\nA stubborn promise burning ever so bright.\nThe scars remain, a map of every pain,\nBut the spirit's song, a fierce, unbroken strain.\n(Pre-Chorus)\nBeneath the grit, a spark ignites,\nChasing the ghosts of endless nights.\nThis ain't no Eden, raw and deep,\nBut promises the weary keep.\n(Chorus)\nThese coal dust sunrises, they stain the peaks in gray,\nBut hope's true fire still finds a way, yeah, it always finds a way.\nThe tired earth groans, a haunting, low refrain,\nYet grit-worn hands find strength to rise and live again.\nTo rise and breathe again.\n(Bridge)\nThe mountain stands, a titan through the years,\nSwallowing hardship, conquering all fears.\nThis ain't the ending, just a beat in between,\nA chance to reclaim, to heal, to be seen.\n(Chorus)\nThese coal dust sunrises, they stain the peaks in gray,\nBut hope's true fire still finds a way, yeah, it always finds a way.\nThe tired earth groans, a haunting, low refrain,\nYet grit-worn hands find strength to rise and live again.\nTo rise and breathe again.\n(Outro)\nTo rise and breathe again,\nA coal dust sunrise, and we're all risin' again.",
      "suggested_venues": [
        "amphitheater",
        "church",
        "coffee_shop",
        "festival",
        "house_concert",
        "listening_room",
        "outdoor_venue",
        "revival",
        "small_theater",
        "stadium"
      ]
    },
    "my_kentucky_heartbeat": {
      "title": "My Kentucky Heartbeat",
      "status": "private",
      "lyrics": "(Verse 1)\nSunrise paints these Blue Ridge Mountains, but I'm already caked in mine grime\nAnother shift done, countin' pennies, losin' track of time.\nThis old pickup's my four walls now, under the Kentucky moon so wide\nBut thinkin' of your West Coast smile, girl, eases the ache inside.\n(Chorus)\nHey, Shay, my Kentucky Heartbeat, my steady ground so true,\nMiles can't change this rhythm I only find in you.\nEvery sunrise I fight for, every dollar I make,\nIs for your California dream, no matter what it takes.\n(Verse 2)\nRemember Blackberry Creek, dust devils dancin' in the summer heat?\nFelt like magic then, your hand in mine, oh, bitter and so sweet.\nNow your picture on the dash, it guides me through the dark and lonely road\nHelps me carry every burden, helps me lift this heavy load.\n(Chorus)\nHey, Shay, my Kentucky Heartbeat, my steady ground so true,\nMiles can't change this rhythm I only find in you.\nEvery sunrise I fight for, every dollar I make,\nIs for your California dream, no matter what it takes.\n(Bridge)\nThese calloused hands have known the sting of cold and burnin' steel\nPlayed a rusted, found guitar, makin' all this heartache real.\nBut you heard the truth within the noise, a song beneath the pain\nMy Shay Bear, your belief in me, it washes off the stains.\n(Chorus)\nHey, Shay, my Kentucky Heartbeat, my steady ground so true,\nMiles can't change this rhythm I only find in you.\nEvery sunrise I fight for, every dollar I make,\nIs for your California dream, no matter what it takes.\n(Outro)\nYeah, my Kentucky Heartbeat, thumpin' just for you, Shay Bear. \nMore than just some words, girl, this is my earnest prayer.\nMy truth, my song, for you",
      "suggested_venues": [
        "amphitheater",
        "honky_tonk",
        "outdoor_venue",
        "roadhouse"
      ]
    },
    "through_the_silence": {
      "title": "Through the Silence",
      "status": "private",
      "lyrics": "Verse 1:\nBorn in the shadow of a rusted cage,\nCoal dust scars and a heart’s old rage.\nWords stayed locked where the hurt runs deep,\nWhispers in the dark were mine to keep.\nChorus:\nYou gotta walk through silence to sing the truth,\nFeel the ache in your bones, let it carve your youth.\nEvery scar’s a note, every wound’s a song,\nThrough the silence, I found where I belong.\nVerse 2:\nNights on the mountain, just me and the wind,\nStrummed my pain where the pines don’t end.\nEach string I broke was a chain let go,\nTruth came alive where the quiet grows.\nChorus:\nYou gotta walk through silence to sing the truth,\nFeel the ache in your bones, let it carve your youth.\nEvery scar’s a note, every wound’s a song,\nThrough the silence, I found where I belong.\nBridge:\nNo crowd, no stage, just a heart laid bare,\nSang to the stars ‘cause they always cared.\nThe hurt runs deep, but the truth runs free,\nSilence taught the song that’s savin’ me.\nChorus:\nYou gotta walk through silence to sing the truth,\nFeel the ache in your bones, let it carve your youth.\nEvery scar’s a note, every wound’s a song,\nThrough the silence, I found where I belong.\nOutro:\nNow I sing my truth, let the echoes fly,\nBorn in the silence ‘neath a Kentucky sky.\nYou gotta walk through silence, let it break you loose,\nTo find the song that’s livin’ in your truth.",
      "suggested_venues": [
        "amphitheater",
        "coffee_shop",
        "house_concert",
        "listening_room",
        "outdoor_venue",
        "small_theater"
      ]
    },
    "keep_singin_on": {
      "title": "Keep Singin’ On",
      "status": "private",
      "lyrics": "Verse 1:\nCame to this town with a song in my heart,\nVoice full of dreams, but the world’s played hard.\nWaitin’ on tables, sweepin’ floors till dawn,\nHoldin’ to hope when the money’s all gone.\nChorus:\nKeep singin’ on, let the truth ring true,\nEvery note’s a fight for the life I pursue.\nThrough the ache and the doubt, I’ll still raise my song,\nHeart’s still burnin’, so I keep singin’ on.\nVerse 2:\nMama’s voice echoes, said I’d shine someday,\nBut she’s gone to glory, and I’m still findin’ my way.\nThis old guitar’s my only friend some nights,\nSingin’ to shadows, chasin’ stage lights.\nChorus:\nKeep singin’ on, let the truth ring true,\nEvery note’s a fight for the life I pursue.\nThrough the ache and the doubt, I’ll still raise my song,\nHeart’s still burnin’, so I keep singin’ on.\nBridge:\nBills stack high, and the dreams wear thin,\nBut my soul’s got a fire that won’t give in.\nEvery scar’s a story, every tear’s a call,\nI’ll sing through the silence till I’ve given it all.\nChorus:\nKeep singin’ on, let the truth ring true,\nEvery note’s a fight for the life I pursue.\nThrough the ache and the doubt, I’ll still raise my song,\nHeart’s still burnin’, so I keep singin’ on.\nOutro:\nSo here’s my voice, let it carry me home,\nThrough empty rooms where my dreams still roam.\nNo matter how heavy, I’ll carry this dawn,\nWith love in my heart, I keep singin’ on.",
      "suggested_venues": [
        "coffee_shop",
        "house_concert",
        "listening_room"
      ]
    },
    "through_the_silence_2": {
      "title": "Through the Silence",
      "status": "private",
      "lyrics": "Verse 1:\nBorn in the shadow of a rusted cage,\nCoal dust scars and a heart’s old rage.\nWords stayed locked where the hurt runs deep,\nWhispers in the dark were mine to keep.\nChorus:\nYou gotta walk through silence to sing the truth,\nFeel the ache in your bones, let it carve your youth.\nEvery scar’s a note, every wound’s a song,\nThrough the silence, I found where I belong.\nVerse 2:\nNights on the mountain, just me and the wind,\nStrummed my pain where the pines don’t end.\nEach string I broke was a chain let go,\nTruth came alive where the quiet grows.\nChorus:\nYou gotta walk through silence to sing the truth,\nFeel the ache in your bones, let it carve your youth.\nEvery scar’s a note, every wound’s a song,\nThrough the silence, I found where I belong.\nBridge:\nNo crowd, no stage, just a heart laid bare,\nSang to the stars ‘cause they always cared.\nThe hurt runs deep, but the truth runs free,\nSilence taught the song that’s savin’ me.\nChorus:\nYou gotta walk through silence to sing the truth,\nFeel the ache in your bones, let it carve your youth.\nEvery scar’s a note, every wound’s a song,\nThrough the silence, I found where I belong.\nOutro:\nNow I sing my truth, let the echoes fly,\nBorn in the silence ‘neath a Kentucky sky.\nYou gotta walk through silence, let it break you loose,\nTo find the song that’s livin’ in your truth.",
      "suggested_venues": [
        "amphitheater",
        "coffee_shop",
        "listening_room",
        "outdoor_venue",
        "small_theater"
      ]
    },
    "the_songs_that_saved_me": {
      "title": "The Songs That Saved Me",
      "status": "private",
      "lyrics": "Verse 1\nIn a trailer’s shadow, where the silence screamed,\nFound a rusted guitar, chased a broken dream.\nJohnny’s voice of hurt cut through my pain,\nWaylon’s rebel soul kept me sane.\n\nChorus\nSongs that saved me, pullin’ me through,\nTruth in the darkness, love that’s true.\nFrom the grave’s cold call to a heart’s soft plea,\nThese old songs, they’re savin’ me.\n\nVerse 2\nStapleton’s gravel wrapped my scars in grace,\nChilders sang the hills where I found my place.\nAdele’s fire burned my doubts away,\nEach note a light in my lonesome day.\n\nChorus\nSongs that saved me, pullin’ me through,\nTruth in the darkness, love that’s true.\nFrom the grave’s cold call to a heart’s soft plea,\nThese old songs, they’re savin’ me.\n\nBridge\n“Hurt” taught me wounds can sing out loud,\n“Cover Me Up” showed love’s the proudest sound.\n“O Death” whispered life’s a fleeting flame,\nTheir truths carved my heart, gave me my name.\n\nChorus\nSongs that saved me, pullin’ me through,\nTruth in the darkness, love that’s true.\nFrom the grave’s cold call to a heart’s soft plea,\nThese old songs, they’re savin’ me.\n\nOutro\nNow I strum my truth ‘neath a lonesome sky,\nCarryin’ their echoes till the day I die.\nThrough the pain and love, their voices I see,\nThese old songs, forever savin’ me.",
      "suggested_venues": [
        "festival"
      ]
    },
    "coal_dust_on_the_lamb": {
      "title": "Coal Dust on the Lamb",
      "status": "private",
      "lyrics": "(Verse 1)\nSixteen summers bleedin' into fall,\nDaddy's shadow stretched across the wall.\nHis words like whiskey, burnin' down my throat,\nKicked me out to wander, wearin' a thin coat.\nPikeville hollers echoed with my shame,\nInnocence a flicker, dyin' in the flame.\n\n(Verse 2)\nFound a floor to sleep on, kindness in a stranger's eye,\nBut the mountain cold seeped in, beneath a starless sky.\nTraded school books for a pick and shovel's weight,\nCoal dust settled on my dreams, sealin' up their fate.\nThis broken arm, a constant ache, a twisted memory,\nOf a boy who used to dream beneath a dogwood tree.\n\n(Chorus)\nCoal dust on the lamb, a stain that won't come clean,\nLost my way back home, a forgotten, faded scene.\nThese coal-stained hands, they hold the weight of sin,\nPrayin' for redemption, hopin' God lets me in.\n\n(Verse 3)\nSunrise paints the mountain ridge, a fiery, bloody hue,\nAnother day of breakin' back, another debt to accrue.\nThe fields stretch out before me, endless rows of green,\nBut all I see is darkness, a fractured, broken scene.\nThis ain't the life I pictured,  beneath the mountain's gaze,\nJust a broken boy, lost in a lonely, hazy maze.\n\n(Bridge)\nMama's hymnals echo, a whisper in the wind,\nA memory of comfort, a peace I can't pretend.\nWill I ever feel that grace again, that gentle, lovin' hand?\nOr am I destined to wander, a ghost in this promised land?\n\n(Chorus)\nCoal dust on the lamb, a stain that won't come clean,\nLost my way back home, a forgotten, faded scene.\nThese coal-stained hands, they hold the weight of sin,\nPrayin' for redemption, hopin' God lets me in.\n\n(Outro)\nLord, have mercy, on this coal-stained soul,\nLead me back to the fold, make me whole. \nMake me whole.",
      "suggested_venues": [
        "amphitheater",
        "coffee_shop",
        "dive_bar",
        "honky_tonk",
        "house_concert",
        "listening_room",
        "outdoor_venue",
        "roadhouse",
        "small_theater"
      ]
    },
    "roots_torn_slow": {
      "title": "Roots Torn Slow",
      "status": "private",
      "lyrics": "Some folks leave like a gust through the pines,\nFast and loud, gone before the night’s decline.\nBut you left like roots ripped from the ground,\nSlow and breakin’, didn’t make a sound.\nI stood there watchin’, my heart in my hands,\nPieces of me scattered ‘cross this lonesome land.\n(Pre-Chorus)\nEvery step feels like I’m circlin’ a scar,\nA hollow where you were, where you tore me apart.\n(Chorus)\nRoots torn slow, they don’t just fade away,\nThey leave a hole that haunts me every day.\nI walk like I’m growin’ ‘round the pain,\nPlantin’ flowers in the dirt where you remained.\nThey bloom deeper, they know what I’ve lost,\nThey choose sunlight, no matter the cost.\n(Verse 2)\nI used to think love was a fire that burned,\nBut yours was a weight, a lesson I learned.\nEach crack in my soul, it taught me to fight,\nTo find my own spark in the cold, endless night.\nNow I’m sowin’ seeds where the shadows still creep,\nBuildin’ a garden from the hurt runnin’ deep.\n(Pre-Chorus)\nEvery bloom’s a battle, every petal’s a prayer,\nProof I’m still standin’, though you ain’t there.\n(Chorus)\nRoots torn slow, they don’t just fade away,\nThey leave a hole that haunts me every day.\nI walk like I’m growin’ ‘round the pain,\nPlantin’ flowers in the dirt where you remained.\nThey bloom deeper, they know what I’ve lost,\nThey choose sunlight, no matter the cost.\n(Bridge)\nI ain’t the girl you left in the dust,\nMy heart’s got thorns now, forged from the rust.\nBut these hands still dig, they still reach for the sky,\nTurnin’ tears into roses that won’t ever die.\nYour leavin’ broke me, but it made me whole,\nI found my roots in this stubborn soul.\n(Chorus)\nRoots torn slow, they don’t just fade away,\nThey leave a hole that haunts me every day.\nI walk like I’m growin’ ‘round the pain,\nPlantin’ flowers in the dirt where you remained.\nThey bloom deeper, they know what I’ve lost,\nThey choose sunlight, no matter the cost.\n(Outro)\nSome leave like wind, but you left like stone,\nTore out my roots, but I’m growin’ my own.\nThese flowers I plant, they’re my heart’s quiet vow,\nThey bloom deeper… and I’m stronger now.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "keep_singing_on": {
      "title": "Keep Singing On",
      "status": "private",
      "lyrics": "Verse 1:\nCame to this town with a song in my heart,\nVoice full of dreams, but the world’s played hard.\nWaitin’ on tables, sweepin’ floors till dawn,\nHoldin’ to hope when the money’s all gone.\n\nChorus:\nKeep singin’ on, let the truth ring true,\nEvery note’s a fight for the life I pursue.\nThrough the ache and the doubt, I’ll still raise my song,\nHeart’s still burnin’, so I keep singin’ on.\n\nVerse 2:\nMama’s voice echoes, said I’d shine someday,\nBut she’s gone to glory, and I’m still findin’ my way.\nThis old guitar’s my only friend some nights,\nSingin’ to shadows, chasin’ stage lights.\n\nChorus:\nKeep singin’ on, let the truth ring true,\nEvery note’s a fight for the life I pursue.\nThrough the ache and the doubt, I’ll still raise my song,\nHeart’s still burnin’, so I keep singin’ on.\n\nBridge:\nBills stack high, and the dreams wear thin,\nBut my soul’s got a fire that won’t give in.\nEvery scar’s a story, every tear’s a call,\nI’ll sing through the silence till I’ve given it all.\n\nChorus:\nKeep singin’ on, let the truth ring true,\nEvery note’s a fight for the life I pursue.\nThrough the ache and the doubt, I’ll still raise my song,\nHeart’s still burnin’, so I keep singin’ on.\n\nOutro:\nSo here’s my voice, let it carry me home,\nThrough empty rooms where my dreams still roam.\nNo matter how heavy, I’ll carry this dawn,\nWith love in my heart, I keep singin’ on.",
      "suggested_venues": [
        "coffee_shop",
        "house_concert",
        "listening_room"
      ]
    }
  }
}