{
  "theme": "nostalgia",
  "song_count": 19,
  "songs": {
    "a_song_and_a_beer": {
      "title": "A Song and a Beer",
      "status": "private",
      "lyrics": "Verse 1\nDive bar buzzing, the city's aglow,\nPlaylist spinning songs we all know.\nBartender smiling, hands me a drink,\nTonight’s for forgetting, no time to think.\nPre-Chorus\nWearing life's marks, but the road stays clear,\nAll we need is good company and beer.\nChorus\nGive me a song and a beer, let the music play low,\nSing me a story everybody knows.\nThrough highs and lows, we find comfort right here,\nLife’s always better with a song and a beer.\nVerse 2\nWe share our laughter, let the heartaches unwind,\nMelodies lifting our hearts and our minds.\nRaise a toast to the good times we've had,\nTonight’s for the living, not feeling sad.\nPre-Chorus\nLife leaves its marks, but our spirits stay clear,\nGathered together with music and beer.\nChorus\nGive me a song and a beer, let the music play low,\nSing me a story everybody knows.\nThrough highs and lows, we find comfort right here,\nLife’s always better with a song and a beer.\nBridge\nEvery lyric’s a memory, each chorus our bond,\nFriendship and freedom, the music rolls on.\nThis place isn’t just bricks, it’s a feeling inside,\nStories unfolding beneath city lights.\nChorus\nGive me a song and a beer, let the music play low,\nSing me a story everybody knows.\nThrough highs and lows, we find comfort right here,\nLife’s always better with a song and a beer.\nOutro\nLift a glass to the night, watch the worries disappear,\nEverything’s alright with a song and a beer.",
      "suggested_venues": [
        "coffee_shop",
        "dive_bar",
        "festival",
        "honky_tonk",
        "listening_room",
        "roadhouse",
        "small_theater"
      ]
    },
    "my_mothers_eyes": {
      "title": "My Mother’s Eyes",
      "status": "private",
      "lyrics": "Verse 1\nNever knew your smile, never heard your call,\nJust a faded photo on a cracked bedroom wall.\nBut when the mirror catches me in the morning’s glare,\nI see your fire burnin’, and I know you’re there.\nPre-Chorus\nYou gave me your spirit when you gave me my life,\nYour love’s in my blood, sharper than a knife.\nChorus\nShe never heard my first cry, never wiped my fears,\nBut her face stares back in my morning mirror.\nThe love I never touched still paints my skies —\nI was born with my mother’s eyes.\nVerse 2\nDad said I killed you, but I feel you near,\nIn the songs I sing, in the dreams that appear.\nYour strength’s in my hands when I strum through the pain,\nYour heart’s in my chest when I’m walkin’ through rain.\nPre-Chorus\nYou left me your courage when you left this earth,\nI’m livin’ your love in the songs of my birth.\nChorus\nShe never heard my first cry, never wiped my fears,\nBut her face stares back in my morning mirror.\nThe love I never touched still paints my skies —\nI was born with my mother’s eyes.\nBridge\nEvery note’s a letter to the mother I’ve known,\nEvery chord’s a root in the seeds you’ve sown.\nYou’re the light in my darkness, the truth in my cries,\nI’m carryin’ your love in my mother’s eyes.\nChorus\nShe never heard my first cry, never wiped my fears,\nBut her face stares back in my morning mirror.\nThe love I never touched still paints my skies —\nI was born with my mother’s eyes.\nOutro\n*(Slow picking: E|-3---3---|)*\nMy mother’s eyes… my heart’s only light.",
      "suggested_venues": [
        "coffee_shop",
        "house_concert",
        "listening_room",
        "small_theater"
      ]
    },
    "the_mourning_after": {
      "title": "The Mourning After",
      "status": "private",
      "lyrics": "Verse 1\nWoke up to a headache and your face in my mind,\nThat video call still burns like cheap red wine.\nI torched your old photos in a rusted tin can,\nBut your laugh keeps echoin’ through this broken man.\nPre-Chorus\nI’m half-dead, but I’m fightin’ to breathe,\nTradin’ tears for the strength to believe.\nChorus\nThe mournin’ after’s a cold, lonesome fight,\nScrapin’ up my heart in the pale morning light.\nI’m chasin’ new shadows where your ghost don’t roam,\nFindin’ my way, but I ain’t yet home.\nVerse 2\nNew bar down the highway, new smoke in the air,\nA girl’s crooked smile says she don’t know my care.\nI’m shakin’ off the weight of your cheatin’ disguise,\nBut your voice still cuts through the neon-lit skies.\nPre-Chorus\nI’m not healed, but I’m startin’ to mend,\nCarvin’ out a road where your lies gotta end.\nChorus\nThe mournin’ after’s a cold, lonesome fight,\nScrapin’ up my heart in the pale morning light.\nI’m chasin’ new shadows where your ghost don’t roam,\nFindin’ my way, but I ain’t yet home.\nBridge\nEvery mile I drive, I bury you deeper in the dust,\nEvery shot I take, I’m weldin’ back my trust.\nYour love was a blade that cut me to the core,\nBut I’m stitchin’ up my soul, I don’t need you no more.\nChorus\nThe mournin’ after’s a cold, lonesome fight,\nScrapin’ up my heart in the pale morning light.\nI’m chasin’ new shadows where your ghost don’t roam,\nFindin’ my way, but I ain’t yet home.\nOutro\nNew dives, new dawns, new battles to win,\nThe mournin’ after’s where I’m learnin’ to begin.\n*(Slow picking: E|-3---3---|)*\nMournin’ after you… I’m startin’ again.",
      "suggested_venues": [
        "dive_bar"
      ]
    },
    "hollow_turns_hallelujah": {
      "title": "Hollow Turns Hallelujah",
      "status": "private",
      "lyrics": "Hollow Turns Hallelujah\nVerse 1\nBoot prints fading, desert moon hanging low\nGuard duty whispers, stories we all know\nChopper blades turning, a melancholic drone\nThe campfire's out, brothers gone, too soon flown\nVerse 2\nWe built our bunkers, sandbags stacked up high\nDreamed of homecomings 'neath a foreign sky\nShared our rations, stories raw and true\nNow the echoes fade, a future we couldn't view\nChorus\nBut the hollow turns hallelujah, in the quiet of the years\nA symphony of service, washed away by bittersweet tears\nWe raise our voices, cracked and worn, a campfire choir once more\nSingin' hymns of resilience, from the scars that we bore\nVerse 3\nRifle shots echo, a bugle out of tune\nForgotten faces flicker beneath the desert moon\nThe camaraderie lingers, a ghost in the desert air\nA reminder of courage, a burden that we share\nBridge\nWe scattered like shrapnel, on the winds of war we flew\nChasing a mission's purpose, some lost, some seeing it through\nBut the bonds run deep, beneath the surface they reside\nBound by the campfire's glow, where our brothers' spirits abide\nChorus\nAnd the hollow turns hallelujah, in the quiet of the years\nA symphony of service, washed away by bittersweet tears\nWe raise our voices, cracked and worn, a campfire choir once more\nSingin' hymns of resilience, from the scars that we bore\nOutro\nHallelujah, hallelujah, from the hollow we rise\nHallelujah, hallelujah, with strength in our eyes\nThe campfire's memory burns, a beacon in the night\nGuiding us home, bathing our souls in its light.\nHallelujah.",
      "suggested_venues": [
        "amphitheater",
        "church",
        "outdoor_venue",
        "revival"
      ]
    },
    "lantern_i_left_behind": {
      "title": "Lantern I Left Behind",
      "status": "private",
      "lyrics": "Lantern I Left Behind\n(Verse 1)\nSunrise spills across the ridge, paints the valley gold\nAnother day breaks on this farm, a story left untold\nOf restless nights and whispered dreams beneath a moonless sky\nAnd the lantern I left burning low, the night you said goodbye.\nThe crickets chirped a lonely tune, the wind sighed through the trees\nI watched your shadow disappear, carried on the breeze.\n(Chorus)\nLantern I left behind, a flickering ember glow\nA beacon in the darkness, watchin' where you go\nA fragile flame against the dawn, a hope I couldn't keep\nJust a memory now, a promise I couldn't sleep.\n(Verse 2)\nThe rooster crows, a mournful sound, echoes through the air\nAnother day to plow these fields, another burden to bear\nThe coffee's strong and bitter black, like the taste in my mouth now\nRemember how we used to laugh, beneath the apple bough?\nWe carved our initials in the bark, swore it'd always be\nBut time and distance took their toll, and stole you away from me.\n(Bridge)\nMaybe someday down the road, our paths will cross again\nMaybe someday I'll understand, and forgive the hurt and pain\nMaybe someday the lantern's light won't sting my eyes so bright\nMaybe someday I'll find my peace, in the stillness of the night.\n(Chorus)\nLantern I left behind, a flickering ember glow\nA beacon in the darkness, watchin' where you go\nA fragile flame against the dawn, a hope I couldn't keep\nJust a memory now, a promise I couldn't sleep.\n(Outro)\nJust a memory now, a lantern I left behind\nBurning in the morning light, a love I couldn't find.\nBurning in the morning light…",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "morning_after_rain": {
      "title": "Morning After Rain",
      "status": "private",
      "lyrics": "Morning After Rain\n(Verse 1)\nSunrise paints the valley gold, a mist hangs in the air\nThe creek bed whispers stories of the flood that raged through there\nThe earth drinks deep, the thirsty roots, reach down for grace anew\nAnd I remember every tear, that washed over me and you\n(Chorus)\nMorning after rain, the scars begin to bloom\nWildflowers in the canyons, pushing through the gloom\nBroken branches reach for light, a testament of will\nMorning after rain, His mercy fills me still\n(Verse 2)\nThe wind chimes sing a gentle song, a melody of peace\nThe broken fence post stands alone, a reminder grief will cease\nThe scent of honeysuckle sweet, a promise on the breeze\nThat even in the deepest hurt, there's solace in the trees\n(Bridge)\nI used to hide the broken parts, afraid to let them show\nBut every crack and every line, is how I learn to grow\nThe storm may rage, the thunder roar, but faith will see me through\n'Cause even shattered pieces, can reflect the morning dew\n(Chorus)\nMorning after rain, the scars begin to bloom\nWildflowers in the canyons, pushing through the gloom\nBroken branches reach for light, a testament of will\nMorning after rain, His mercy fills me still\n(Outro)\nMorning after rain, the sun breaks through the clouds\nMorning after rain, His love shouts out aloud.\nMorning after rain.",
      "suggested_venues": [
        "amphitheater",
        "church",
        "coffee_shop",
        "house_concert",
        "listening_room",
        "outdoor_venue",
        "revival",
        "small_theater"
      ]
    },
    "red_dirt_road": {
      "title": "Red Dirt Road",
      "status": "private",
      "lyrics": "Red Dirt Road\n(Verse 1)\nSunrise paints the cotton fields a hazy shade of gold\nAnother town I can't recall, another story told\nOf a restless heart and wandering feet, a shadow in the night\nSearching for a place to land, a flicker of guiding light\nThey call me outlaw, rebel soul, a drifter through and through\nBut beneath this hardened shell, a homesick heart beats true\n(Chorus)\nRed dirt road, windin' back to where I belong\nWhere the cypress trees stand tall and the mockingbird's sweet song\nEchoes through the valleys, a memory so clear\nRed dirt road, whisperin' \"you're finally here\"\n(Verse 2)\nRan from the whispers, the judgment in their eyes\nFrom the expectations heavy, beneath these southern skies\nThought I could outrun the past, the ghosts that held me down\nBut freedom's just a hollow word in every nameless town\nTraded family for the highway, love for open space\nNow I see the emptiness etched upon my weary face\n(Bridge)\nThe asphalt ribbon stretched on, a promise never kept\nOf something more, something different, a secret I had slept\nWith for too long, a restless dream that turned into a lie\nNow I'm turnin' 'round, headin' back, beneath the open sky\n(Chorus)\nRed dirt road, windin' back to where I belong\nWhere the cypress trees stand tall and the mockingbird's sweet song\nEchoes through the valleys, a memory so clear\nRed dirt road, whisperin' \"you're finally here\"\n(Outro)\nDust devils dancin' in the afternoon sun's glow\nRed dirt road, takin' me home, slow and low\nYeah, takin' me home, slow and low.\nRed dirt road, I'm finally home, I know.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "scars_and_smoke": {
      "title": "Scars and Smoke",
      "status": "private",
      "lyrics": "Verse 1\nSunrise bleeds red over coal-dust hills, another day’s begun,\nGravel crunches under boots, chasin’ a merciless sun.\nAin’t the life I dreamed, boy, ain’t the hand I aimed to draw,\nBut ghosts of broken yesterdays still claw me raw.\nPre-Chorus\nNo preacher’s words could save me, no bottle drowns the pain,\nJust me and these old scars, walkin’ through the rain.\nChorus\nScars and smoke, heart carved to stone, that’s all they think I am,\nA rambler’s soul, bound to roam, with a rebel’s give-a-damn.\nBut deep beneath this busted shell, a spark still fights to burn,\nScratchin’ through the gates of hell, for peace I’ll never earn.\nVerse 2\nHighway’s a lonesome thread, gray as a miner’s grave,\nEach mile a cut that memory’s blade never forgave.\nBurned my bridges, paid in blood, for choices I can’t mend,\nHuntin’ grace in ghost-town dust, where the lost roads end.\nPre-Chorus\nNo mercy in the mirror, just a boy who learned to fight,\nCarvin’ truth from shattered years, under cold starlight.\nChorus\nScars and smoke, heart carved to stone, that’s all they think I am,\nA rambler’s soul, bound to roam, with a rebel’s give-a-damn.\nBut deep beneath this busted shell, a spark still fights to burn,\nScratchin’ through the gates of hell, for peace I’ll never earn.\nBridge\nThey say time stitches wounds, but mine still bleed and scream,\nEchoes of a daddy’s fist haunt every damn dream.\nI won’t let the dark win, won’t lay down and die,\nGonna claw toward that faint light, till I touch the sky.\nChorus\nScars and smoke, heart carved to stone, that’s all they think I am,\nA rambler’s soul, bound to roam, with a rebel’s give-a-damn.\nBut deep beneath this busted shell, a spark still fights to burn,\nScratchin’ through the gates of hell, for peace I’ll never earn.\nOutro\n*(Slow picking, low E drone)*\nJust a flicker of peace tonight, under this lonesome moon so bright.\nScars and smoke, it’s all I’ve known,\nKeep walkin’ these roads, till I call ‘em home.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue",
        "roadhouse"
      ]
    },
    "faded_mountain_truths": {
      "title": "Faded Mountain Truths",
      "status": "private",
      "lyrics": "Title:  Faded Mountain Truths\n(Verse 1)\nFaded photographs in a dusty frame\nMama's smilin' face, ain't nothin' changed\n'Cept the lines etched deeper, like the cracks on these hills\nYears of worry and winters' chills\nDaddy's shadow, a storm cloud gray\nHangin' heavy, never went away\nLearned my lessons in the holler's shade\nMountain wisdom, hard earned and paid\n(Chorus)\nThese mountains whisper secrets old and true\nTough as the roots that see 'em through\nLike the wind that bends the pine so low\nGotta bend, not break, to weather the blow\nFaded mountain truths, etched in stone\nA legacy of hardship, a heart I call my own\n(Verse 2)\nSixteen years, Blackberry Creek Road dust on my boots\nKicked out the door, nothin' but the clothes on my back, and a few faded roots\nFound shelter in a tin can shack, leaks when it rained\nWorked the fields, the mines, felt the body ache and pain\nThis broken arm, a constant reminder of his rage\nBut these calloused hands, they turned a new page\nFound solace in the strings of a rusted guitar\nSingin' my sorrows, beneath the evenin' star\n(Bridge)\nHe tried to break me, spirit and bone\nBut the mountain in me wouldn't be overthrown\nLike the coal that burns, a fire within\nI rose from the ashes, learned to begin\n(Chorus)\nThese mountains whisper secrets old and true\nTough as the roots that see 'em through\nLike the wind that bends the pine so low\nGotta bend, not break, to weather the blow\nFaded mountain truths, etched in stone\nA legacy of hardship, a heart I call my own\n(Outro)\nSun's comin' up, paintin' the sky gold\nA new day breakin', a story yet untold\nAnd though the shadows linger, I ain't afraid no more\nGot faded mountain truths, to guide me to the shore.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "hell_and_hymns": {
      "title": "Hell and Hymns",
      "status": "private",
      "lyrics": "Verse 1\nFriday night, under neon’s roar,\nWhiskey’s pullin’ hard, settlin’ old scores.\nJukebox wails, hearts hit the floor,\nDancin’ through the haze, chasin’ something more.\nAnother week of grind, bones worn thin,\nSweat still burns where the work don’t end.\nBut tonight we’re alive, breakin’ every chain,\n‘Til the sunrise lights the sky with flame.\nPre-Chorus\nRunnin’ wild, but the soul’s still split,\nTorn between the dark and the holy lit.\nChorus\nHell and hymns, we’re caught in the fray,\nWhiskey sins, then we kneel to pray.\nThis heart keeps fightin’, searchin’ for release,\nBetween the devil’s fire and a savior’s peace.\nHell and hymns, our anthem’s cry,\nSaturday’s rebellion, Sunday’s sky.\nRisin’ from the ashes ‘neath a lonesome moon,\nLord, redeem these hands, scarred and strewn.\nVerse 2\nGuitar moans a lonesome plea,\nEmpty bottle spins, hauntin’ memories.\nFound that six-string in a junkyard’s shine,\nStrummed my soul where the wild winds whine.\nOld man’s shadow still stalks my days,\nHis bitter words like a hell that stays.\nBut mama’s prayers, they pull me through,\nWhisperin’ hope in the morning dew.\nPre-Chorus\nLivin’ rough, but the heart holds strong,\nSeekin’ light where the nights are long.\nChorus\nHell and hymns, we’re caught in the fray,\nWhiskey sins, then we kneel to pray.\nThis heart keeps fightin’, searchin’ for release,\nBetween the devil’s fire and a savior’s peace.\nHell and hymns, our anthem’s cry,\nSaturday’s rebellion, Sunday’s sky.\nRisin’ from the ashes ‘neath a lonesome moon,\nLord, redeem these hands, scarred and strewn.\nBridge\nNo preacher’s verse, just a worker’s call,\nCoal-dust dreams climbin’ past the fall.\nBeggin’ for a spark to break the night,\nFrom the shadows to salvation’s light.\nChorus\nHell and hymns, we’re caught in the fray,\nWhiskey sins, then we kneel to pray.\nThis heart keeps fightin’, searchin’ for release,\nBetween the devil’s fire and a savior’s peace.\nHell and hymns, our anthem’s cry,\nSaturday’s rebellion, Sunday’s sky.\nRisin’ from the ashes ‘neath a lonesome moon,\nLord, redeem these hands, scarred and strewn.\nOutro\n*(Fiddle soar, steady strum)*\nHell and hymns, my soul’s still tried,\nBut I’m risin’ up where the heart don’t hide.\nAmen.",
      "suggested_venues": [
        "dive_bar",
        "festival",
        "honky_tonk",
        "roadhouse"
      ]
    },
    "when_you_cant_be_near_me": {
      "title": "When You Can't Be Near Me",
      "status": "private",
      "lyrics": "(Verse 1) When you can't be near me, please think of me, I'm starin' at the highway, where you used to be. You're gone, my darlin', chasin' some new flame, But my heart's still ramblin', callin' out your name.\n(Pre-Chorus) This whiskey's cold, it don't ease the pain, Without you here, I'm half insane.\n(Chorus) When you can't be near me, oh, my lonesome soul, Keep me in your rearview, where the heartaches roll. Sing my name like a jukebox, broken, wild, and free, When you can't be near me, please think of me.\n(Verse 2) I'm thumbin' through old photos, on this cracked phone screen, Your smile's a ghost now, in this lonesome scene. Got your voice in my head, like a steel guitar's cry, Keeps me holdin' on, beneath this empty sky.\n(Pre-Chorus) The barstool's creakin', but it ain't my home, Without your touch, I'm destined to roam.\n(Chorus) When you can't be near me, oh, my lonesome soul, Keep me in your rearview, where the heartaches roll. Sing my name like a jukebox, broken, wild, and free, When you can't be near me, please think of me.\n(Bridge) So raise a glass, wherever you ride, Send a prayer on the wind, to the lonesome side. We'll cross paths again, down some dusty road, Till then, I'm carryin' this heavy load.\n(Chorus) When you can't be near me, oh, my lonesome soul, Keep me in your rearview, where the heartaches roll. Sing my name like a jukebox, broken, wild, and free, When you can't be near me, please think of me.\n(Outro) So when you're out there, under neon's glow, I'm still your rebel, in the shadows, you know. Till we're back together, where we're meant to be, When you can't be near me... please think of me. Yeah, think of me. (Oh, my lonesome soul.) Think of me.",
      "suggested_venues": [
        "dive_bar",
        "festival",
        "honky_tonk",
        "roadhouse"
      ]
    },
    "backroad_heart": {
      "title": "Backroad Heart",
      "status": "private",
      "lyrics": "(Verse 1)\nOut on County Road 9, where the gravel kicks dust,\nWe carved our initials in an oak, swore we’d never rust.\nYour taillights faded, left me standin’ in the rain,\nNow I’m chasin’ your memory, down a lonesome lane.\n(Pre-Chorus)\nThis old truck’s still runnin’, but it’s fallin’ apart,\nJust like me, it’s haulin’ this backroad heart.\n(Chorus)\nI’ve got a backroad heart, beat-up but true,\nBurnin’ like a bonfire, still in love with you.\nThrough the mud and the miles, I’m holdin’ on tight,\nA backroad heart keeps rollin’ through the long, dark night.\n(Verse 2)\nThe radio’s playin’ that song you used to sing,\nAbout a small-town dreamer, chasin’ bigger things.\nI pass your mama’s porch light, it’s glowin’ soft and low,\nWish I could turn back time, to nights we used to know.\n(Pre-Chorus)\nThis flannel’s worn thin, but I wear it with pride,\nLike this backroad heart, still fightin’ for the ride.\n(Chorus)\nI’ve got a backroad heart, beat-up but true,\nBurnin’ like a bonfire, still in love with you.\nThrough the mud and the miles, I’m holdin’ on tight,\nA backroad heart keeps rollin’ through the long, dark night.\n(Bridge)\nEvery cornfield sunrise, every starlit prayer,\nI see your face in the distance, like you’re still right there.\nI ain’t the kind to give up, I was raised to stand tall,\nThis backroad heart’s still beatin’, through the rise and fall.\n(Chorus)\nI’ve got a backroad heart, beat-up but true,\nBurnin’ like a bonfire, still in love with you.\nThrough the mud and the miles, I’m holdin’ on tight,\nA backroad heart keeps rollin’ through the long, dark night.\n(Outro)\nSo I’ll drive these old backroads, till the pain departs,\nCarrying the weight of this lonesome, backroad heart.\nYeah, this backroad heart… keeps rollin’ on.\nAcoustic sound: Strong, steady acoustic guitar strum and simple, heartfelt vocals that emphasize the story's raw emotion. A gentle pedal steel or subtle fiddle melody weaves in and out, adding a layer of wistful nostalgia.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "my_kentucky_heartbeat": {
      "title": "My Kentucky Heartbeat",
      "status": "private",
      "lyrics": "(Verse 1)\nSunrise paints these Blue Ridge Mountains, but I'm already caked in mine grime\nAnother shift done, countin' pennies, losin' track of time.\nThis old pickup's my four walls now, under the Kentucky moon so wide\nBut thinkin' of your West Coast smile, girl, eases the ache inside.\n(Chorus)\nHey, Shay, my Kentucky Heartbeat, my steady ground so true,\nMiles can't change this rhythm I only find in you.\nEvery sunrise I fight for, every dollar I make,\nIs for your California dream, no matter what it takes.\n(Verse 2)\nRemember Blackberry Creek, dust devils dancin' in the summer heat?\nFelt like magic then, your hand in mine, oh, bitter and so sweet.\nNow your picture on the dash, it guides me through the dark and lonely road\nHelps me carry every burden, helps me lift this heavy load.\n(Chorus)\nHey, Shay, my Kentucky Heartbeat, my steady ground so true,\nMiles can't change this rhythm I only find in you.\nEvery sunrise I fight for, every dollar I make,\nIs for your California dream, no matter what it takes.\n(Bridge)\nThese calloused hands have known the sting of cold and burnin' steel\nPlayed a rusted, found guitar, makin' all this heartache real.\nBut you heard the truth within the noise, a song beneath the pain\nMy Shay Bear, your belief in me, it washes off the stains.\n(Chorus)\nHey, Shay, my Kentucky Heartbeat, my steady ground so true,\nMiles can't change this rhythm I only find in you.\nEvery sunrise I fight for, every dollar I make,\nIs for your California dream, no matter what it takes.\n(Outro)\nYeah, my Kentucky Heartbeat, thumpin' just for you, Shay Bear. \nMore than just some words, girl, this is my earnest prayer.\nMy truth, my song, for you",
      "suggested_venues": [
        "amphitheater",
        "honky_tonk",
        "outdoor_venue",
        "roadhouse"
      ]
    },
    "empty_seat": {
      "title": "Empty Seat",
      "status": "private",
      "lyrics": "Verse 1\n\nEvery mornin’ she’d slip through that diner door,\n\nSame old booth, coffee black, nothin’ more.\n\nNever spoke, just stared where the shadows creep,\n\nToday her seat’s empty, and the silence cuts deep.\n\nChorus\n\nOh, the empty seat, where’d she go?\n\nCarried her story where nobody knows.\n\nA ghost in the booth, left a chill in the air,\n\nEmpty seat’s whisperin’, she ain’t there.\n\nVerse 2\n\nWorn-out coat, eyes like a lonesome rain,\n\nNo one asked her story, not even her name.\n\nWaitress hums soft, but the counter feels wrong,\n\nHer shadow’s gone quiet, where it used to belong.\n\nChorus\n\nOh, the empty seat, where’d she go?\n\nCarried her story where nobody knows.\n\nA ghost in the booth, left a chill in the air,\n\nEmpty seat’s whisperin’, she ain’t there.\n\nBridge\n\nWas she runnin’ from hurt, or chasin’ a dream?\n\nLost in the cracks of a life’s frayed seam.\n\nThat booth holds her echo, a truth left unsaid,\n\nA stranger’s gone missin’, but she ain’t dead.\n\nChorus\n\nOh, the empty seat, where’d she go?\n\nCarried her story where nobody knows.\n\nA ghost in the booth, left a chill in the air,\n\nEmpty seat’s whisperin’, she ain’t there.\n\nOutro\n\nIn a small-town diner, ‘neath the hum of the light,\n\nHer seat stays empty, through the long, lonesome night.",
      "suggested_venues": [
        "coffee_shop",
        "listening_room",
        "small_theater"
      ]
    },
    "coal_dust_on_the_lamb": {
      "title": "Coal Dust on the Lamb",
      "status": "private",
      "lyrics": "(Verse 1)\nSixteen summers bleedin' into fall,\nDaddy's shadow stretched across the wall.\nHis words like whiskey, burnin' down my throat,\nKicked me out to wander, wearin' a thin coat.\nPikeville hollers echoed with my shame,\nInnocence a flicker, dyin' in the flame.\n\n(Verse 2)\nFound a floor to sleep on, kindness in a stranger's eye,\nBut the mountain cold seeped in, beneath a starless sky.\nTraded school books for a pick and shovel's weight,\nCoal dust settled on my dreams, sealin' up their fate.\nThis broken arm, a constant ache, a twisted memory,\nOf a boy who used to dream beneath a dogwood tree.\n\n(Chorus)\nCoal dust on the lamb, a stain that won't come clean,\nLost my way back home, a forgotten, faded scene.\nThese coal-stained hands, they hold the weight of sin,\nPrayin' for redemption, hopin' God lets me in.\n\n(Verse 3)\nSunrise paints the mountain ridge, a fiery, bloody hue,\nAnother day of breakin' back, another debt to accrue.\nThe fields stretch out before me, endless rows of green,\nBut all I see is darkness, a fractured, broken scene.\nThis ain't the life I pictured,  beneath the mountain's gaze,\nJust a broken boy, lost in a lonely, hazy maze.\n\n(Bridge)\nMama's hymnals echo, a whisper in the wind,\nA memory of comfort, a peace I can't pretend.\nWill I ever feel that grace again, that gentle, lovin' hand?\nOr am I destined to wander, a ghost in this promised land?\n\n(Chorus)\nCoal dust on the lamb, a stain that won't come clean,\nLost my way back home, a forgotten, faded scene.\nThese coal-stained hands, they hold the weight of sin,\nPrayin' for redemption, hopin' God lets me in.\n\n(Outro)\nLord, have mercy, on this coal-stained soul,\nLead me back to the fold, make me whole. \nMake me whole.",
      "suggested_venues": [
        "amphitheater",
        "coffee_shop",
        "dive_bar",
        "honky_tonk",
        "house_concert",
        "listening_room",
        "outdoor_venue",
        "roadhouse",
        "small_theater"
      ]
    },
    "that_good_ol_90s_country": {
      "title": "That Good Old 90s Country",
      "status": "private",
      "lyrics": "[Verse 1]\n1992, dirt roads and FM gold\nGeorge Strait on the radio, stories being told\nLevi's worn thin, boots kicked up high\nChattahoochee memories under Georgia sky\n[Verse 2]\nGarth was king and Faith was rising\nBrooks & Dunn kept dance floors flying\nShania showed us what a woman feels\nWhen country music still had steel\n[Chorus]\nThey don't make 'em like they did back then\nWhen three chords and truth was more than just pretend\nNo Auto-Tune, no drum machines\nJust real songs about real dreams\nThat good ol' 90s country\n[Bridge]\nAlan Jackson taught us how to live\nTravis Tritt showed what love could give\nAnd every small-town Friday night\nWas pure country done just right\n[Chorus]\nThey don't make 'em like they did back then\nWhen three chords and truth was more than just pretend\nNo Auto-Tune, no drum machines\nJust real songs about real dreams\nThat good ol' 90s country\n[Outro]\nYeah, that good ol' 90s country\nWhen the music meant something true\nThat good ol' 90s country\nStill running straight through my blood\nThat good ol' 90s country",
      "suggested_venues": [
        "coffee_shop",
        "listening_room",
        "small_theater"
      ]
    },
    "soul_food": {
      "title": "Soul Food",
      "status": "private",
      "lyrics": "Verse 1\nWalked through the door, grease poppin’ in the air,\nCornbread steamin’, love’s everywhere.\nMama’s in the kitchen, stirrin’ up a spell,\nPlates piled high, where the heart can dwell.\n\nChorus\nSoul food, oh, it’s lard and grace!\nFills my mind, my soul, my face!\nFrom the skillet to the heart, it’s healin’ me whole,\nSoul food, feedin’ body and soul!\n\nVerse 2\nCollard greens simmer, black-eyed peas sing,\nEvery bite’s a prayer, makes the spirit swing.\nRound that table, laughin’, stories unfold,\nWarmin’ up the weary, worth more than gold.\n\nChorus\nSoul food, oh, it’s lard and grace!\nFills my mind, my soul, my face!\nFrom the skillet to the heart, it’s healin’ me whole,\nSoul food, feedin’ body and soul!\n\nBridge\nPass the biscuits, pour the gravy high,\nFeel the love that lifts you to the sky!\nIn this sacred spot, where the good times roll,\nLard and grace gonna save your soul!\n\nChorus\nSoul food, oh, it’s lard and grace!\nFills my mind, my soul, my face!\nFrom the skillet to the heart, it’s healin’ me whole,\nSoul food, feedin’ body and soul!\n\nOutro\n(Claps, hollers, gospel hum)\nSoul food, yeah, it’s where I’m found,\nLard and grace, in that holy ground!",
      "suggested_venues": [
        "church",
        "festival",
        "house_concert",
        "revival"
      ]
    },
    "miles_of_sorrow": {
      "title": "Miles of Sorrow",
      "status": "private",
      "lyrics": "(Verse 1)\nSunrise paints the cotton fields, another day begins\nBut the light don't shine so bright, since your love went on the winds\nWe built a life on promises, beneath a Georgia moon\nBut your city dreams called louder, than my love could ever croon\n(Chorus)\nMiles of sorrow stretch between us, a highway paved with tears\nEach mile a memory fading, swallowed by the passing years\nWe said forever, honey, but forever couldn't hold\nAgainst the pull of distance, a story left untold\n(Verse 2)\nRemember dancin' in the hayloft, beneath the summer stars?\nYour laughter like a mockingbird, escaping rusty bars\nWe swore our love was stronger, than any earthly pain\nBut the miles kept piling higher, a relentless, driving rain\n(Chorus)\nMiles of sorrow stretch between us, a highway paved with tears\nEach mile a memory fading, swallowed by the passing years\nWe said forever, honey, but forever couldn't hold\nAgainst the pull of distance, a story left untold\n(Bridge)\nI see your face in every sunset, hear your voice in every breeze\nBut the silence in this farmhouse, just echoes my unease\nI shoulda held you tighter, darling, shoulda fought with all my might\nBut the distance won the battle, and stole away my light\n(Chorus)\nMiles of sorrow stretch between us, a highway paved with tears\nEach mile a memory fading, swallowed by the passing years\nWe said forever, honey, but forever couldn't hold\nAgainst the pull of distance, a story left untold\n(Outro)\nMiles of sorrow… miles and miles of sorrow…",
      "suggested_venues": [
        "coffee_shop",
        "honky_tonk",
        "listening_room",
        "small_theater"
      ]
    },
    "miles_of_heartache": {
      "title": "Miles of Heartache",
      "status": "private",
      "lyrics": "(Verse 1)\nSunrise paints the cotton fields, another day begins\nBut the light don't shine so bright no more, since you left for distant lands\nSaid you'd write, said you'd call, promised you'd always be near\nBut the miles stretched out between us, fueled by doubt and fear.\n(Chorus)\nMiles of heartache, winding roads of sorrow,\nEvery mile a memory, of a love we couldn't borrow\nFrom the future, from the years, from a life we'd planned to share\nNow just miles of heartache, and a love beyond repair.\n(Verse 2)\nRemember dancin' in the moonlight, beneath the summer sky?\nYour laughter echoed in the fields, a song that made me fly.\nWe built a dream on promises, as solid as the ground\nBut the city lights and city life, tore our love unbound.\n(Chorus)\nMiles of heartache, winding roads of sorrow,\nEvery mile a memory, of a love we couldn't borrow\nFrom the future, from the years, from a life we'd planned to share\nNow just miles of heartache, and a love beyond repair.\n(Bridge)\nI keep your picture by my bed, a faded photograph\nA constant reminder of the love, that distance stole, alas.\nMaybe someday I'll forget, the pain that cuts so deep\nBut until then, these miles of heartache, are the only truth I keep.\n(Chorus)\nMiles of heartache, winding roads of sorrow,\nEvery mile a memory, of a love we couldn't borrow\nFrom the future, from the years, from a life we'd planned to share\nNow just miles of heartache, and a love beyond repair.\n(Outro)\nMiles… miles of heartache… yeah… gone…",
      "suggested_venues": [
        "coffee_shop",
        "honky_tonk",
        "listening_room",
        "small_theater"
      ]
    }
  }
}