{
  "theme": "working_class_labor",
  "song_count": 42,
  "songs": {
    "blackberry_creek_revival": {
      "title": "Blackberry Creek Revival",
      "status": "private",
      "lyrics": "Verse 1\nNo shoes on our feet, but we danced in the mud,\nSang hymns to the stars with our hearts full of blood.\nIn barns by the creek, where the hard times collide,\nWe found our salvation where the hopeless reside.\nPre-Chorus\nNo money, no mercy, just dreams in our veins,\nWe laughed through the hunger, we sang through the chains.\nChorus\nWe prayed in barns, we danced in rain,\nSang away hunger, laughed through pain.\nNo silver spoons, just dirt and dreams —\nOur Blackberry Creek revival streams.\nVerse 2\nOld men strummed banjos, kids clapped to the beat,\nMamas wove stories where the broken hearts meet.\nThe creek kept on flowin’, like our will to survive,\nTurned coal dust to diamonds in the firelight’s drive.\nPre-Chorus\nNo preacher, no riches, just souls intertwined,\nWe built our own heaven where the lost could still shine.\nChorus\nWe prayed in barns, we danced in rain,\nSang away hunger, laughed through pain.\nNo silver spoons, just dirt and dreams —\nOur Blackberry Creek revival streams.\nBridge\nEvery note was a fight, every song was a vow,\nWe rose from the ashes, we’re standin’ up now.\nThe creek’s still our witness, its waters still sing,\nOur revival’s the pulse of the hope we bring.\nChorus\nWe prayed in barns, we danced in rain,\nSang away hunger, laughed through pain.\nNo silver spoons, just dirt and dreams —\nOur Blackberry Creek revival streams.\nOutro\n*(Upbeat picking: E|-3-3-3-3-| A|-1-1-5-5-|)*\nBlackberry Creek… where my soul still sings.",
      "suggested_venues": [
        "amphitheater",
        "church",
        "coffee_shop",
        "house_concert",
        "listening_room",
        "outdoor_venue",
        "revival",
        "small_theater"
      ]
    },
    "born_in_hell": {
      "title": "Born in Hell",
      "status": "private",
      "lyrics": "Verse 1\nCoal dust in my lungs, blood on the floor,\nDad’s fists kept time with the slam of the door.\nBorn in a town where the devil holds sway,\nI learned to take hits ‘fore I learned how to pray.\nPre-Chorus\nNo mercy in his eyes, no warmth in that house,\nJust a boy dodgin’ shadows, quiet as a mouse.\nChorus\nBorn in hell, where the sun don’t shine,\nTook my beatings daily, paid for his cheap wine.\nKicked out at sixteen, worked the mines to survive,\nIn the dark of that town, I kept my soul alive.\nVerse 2\nSchool by day, mines by night, no time to dream,\nRented a room with walls thin as a scream.\nSweat and black soot, my hands turned to stone,\nCarried my books and my scars all alone.\nPre-Chorus\nNo mother to hold me, no father to care,\nJust the weight of the world and the cold mountain air.\nChorus\nBorn in hell, where the sun don’t shine,\nTook my beatings daily, paid for his cheap wine.\nKicked out at sixteen, worked the mines to survive,\nIn the dark of that town, I kept my soul alive.\nBridge\nEvery bruise was a map of the hell I called home,\nEvery shift in the dark taught me how to roam.\nI wasn’t born to break, though they tried to bend,\nFound a spark in my heart that no devil could end.\nChorus\nBorn in hell, where the sun don’t shine,\nTook my beatings daily, paid for his cheap wine.\nKicked out at sixteen, worked the mines to survive,\nIn the dark of that town, I kept my soul alive.\nOutro\n*(Slow picking: E|-3---3---|)*\nBorn in hell… but I’m still breathin’",
      "suggested_venues": [
        "arena",
        "coffee_shop",
        "dive_bar",
        "honky_tonk",
        "house_concert",
        "listening_room",
        "roadhouse",
        "stadium"
      ]
    },
    "feels_like_home": {
      "title": "Feels Like Home",
      "status": "private",
      "lyrics": "[Verse 1]\nFaded blue threads, patched at the knee\nCarried me through hell, set my soul free\nCoal dust stains from the seams I crawled\nWore ‘em when the world felt too damn small\n\n\n[Pre-Chorus]\nThrough the fields at dawn, ‘neath the red dirt’s glow\nEvery tear and fray tells the life I know\nThey held me tight when my heart was torn\nWrapped my bones where my truth was born\n\n\n[Chorus]\nThese old Wranglers feel like home\nCarved my story in thread and stone\nFrom the mines to the roads where I learned to roam\nThese old Wranglers feel like home\n\n\n[Verse 2]\nSweat-soaked days in the summer’s blaze\nDanced in ‘em drunk under starlit haze\nThey caught my blood when her lies cut deep\nHeld my pride when I couldn’t sleep\n\n\n[Pre-Chorus]\nThrough the fields at dawn, ‘neath the red dirt’s glow\nEvery tear and fray tells the life I know\nThey held me tight when my heart was torn\nWrapped my bones where my truth was born\n\n\n[Chorus]\nThese old Wranglers feel like home\nCarved my story in thread and stone\nFrom the mines to the roads where I learned to roam\nThese old Wranglers feel like home\n\n\n[Bridge]\nNo mansion’s walls, no city’s shine\nCould fit my soul like this denim’s mine\nFrom the hollers’ cry to the songs I sing\nThey’re the roots of every damn thing\n\n\n[Chorus]\nThese old Wranglers feel like home\nCarved my story in thread and stone\nFrom the mines to the roads where I learned to roam\nThese old Wranglers feel like home\n\n\n[Outro]\nFiddle hums low, as the night winds moan\nThese old Wranglers feel like home",
      "suggested_venues": [
        "amphitheater",
        "coffee_shop",
        "house_concert",
        "listening_room",
        "outdoor_venue",
        "small_theater"
      ]
    },
    "broken_hallelujah": {
      "title": "Broken Hallelujah",
      "status": "private",
      "lyrics": "Verse 1\nBack alley shadows, where the drunks lose their way,\nFound a splintered old box in the trash’s decay.\nSix rusted strings, neck warped like my dreams,\nBut it hummed like a savior in the moonlight’s beams.\nPre-Chorus\nNo angels in this town, just coal and despair,\nBut that guitar called my name through the cold, bitter air.\nChorus\nHeard a whisper in the wreckage, ‘neath the coffee grounds and rust,\nA broken Hallelujah risin’ from the dust.\nThis dumpster guitar salvation, ragged but it’s true,\nFound the song that saved my life right there inside of you.\nVerse 2\nDad’s fists were thunder, his bottle was king,\nBut I strummed my first chord, felt my heart start to sing.\nHid it in the shed where his eyes wouldn’t roam,\nEach note was a fire that was callin’ me home.\nPre-Chorus\nNo preacher could reach me, no sermon could mend,\nBut that guitar was my truth, my beginning, my friend.\nChorus\nHeard a whisper in the wreckage, ‘neath the coffee grounds and rust,\nA broken Hallelujah risin’ from the dust.\nThis dumpster guitar salvation, ragged but it’s true,\nFound the song that saved my life right there inside of you.\nBridge\nEvery scratch was a story, every crack was a fight,\nI coaxed out my soul in the dead of the night.\nFrom a boy lost in silence to a man with a voice,\nThis guitar was my freedom, my heart’s only choice.\nChorus\nHeard a whisper in the wreckage, ‘neath the coffee grounds and rust,\nA broken Hallelujah risin’ from the dust.\nThis dumpster guitar salvation, ragged but it’s true,\nFound the song that saved my life right there inside of you.\nOutro\n*(Slow picking: E|-3---3---|)*\nDumpster guitar… still singin’ me through.",
      "suggested_venues": [
        "church",
        "coffee_shop",
        "house_concert",
        "listening_room",
        "revival",
        "small_theater"
      ]
    },
    "guilt_and_grief": {
      "title": "Guilt and Grief",
      "status": "private",
      "lyrics": "Verse 1\nNever heard your voice, never felt your touch,\nJust a gravestone whisper in a mining town clutch.\nThey say I stole your breath when I took my first,\nNow I carry that weight like a lifelong curse.\nPre-Chorus\nI’d trade all my tomorrows for one yesterday,\nTo know the love you never got to say.\nChorus\nI dreamt of your hands, but I woke up cold —\nA cradle of silence, a story untold.\nI carry your voice in the spaces he left —\nGuilt and grief are all I have left.\nVerse 2\nDad’s eyes were daggers, blamin’ me for your end,\nBut I’d see you in dreams where my heart could mend.\nYour shadow’s my shelter when the nights get mean,\nI’m holdin’ onto love I’ve only ever seen.\nPre-Chorus\nI’d give all my songs for one moment with you,\nTo feel what a mother’s arms can do.\nChorus\nI dreamt of your hands, but I woke up cold —\nA cradle of silence, a story untold.\nI carry your voice in the spaces he left —\nGuilt and grief are all I have left.\nBridge\nEvery chord I play is a prayer to your name,\nEvery tear I hide is a candle’s flame.\nYou’re gone, but you’re woven in my every breath,\nI’m livin’ through the guilt to honor your death.\nChorus\nI dreamt of your hands, but I woke up cold —\nA cradle of silence, a story untold.\nI carry your voice in the spaces he left —\nGuilt and grief are all I have left.\nOutro\n*(Slow picking: E|-3---3---|)*\nGuilt and grief… my heart’s only theft.",
      "suggested_venues": [
        "church",
        "coffee_shop",
        "listening_room",
        "small_theater"
      ]
    },
    "heres_to_the_ghosts_i_leave_behind": {
      "title": "Here’s to the Ghosts I Leave Behind",
      "status": "private",
      "lyrics": "Verse 1\nI’ve walked through the ashes of a life torn apart,\nCarried the weight of a coal-black heart.\nSome ghosts held me close, some cut like a blade,\nBut each one’s a shadow that my soul’s outstayed.\nPre-Chorus\nThe road taught me mercy, the pain taught me grace,\nEach step’s a new story writ on my face.\nChorus\nWe raise our glasses to the ones who stayed —\nAnd tip our hats to the ones we outgrew with age.\nThere’s grace in the leavin’, mercy in the signs —\nHere’s to the ghosts we leave behind.\nVerse 2\nMom’s in the stars, Dad’s in the dust,\nOne gave me love, one broke my trust.\nBut I’m more than their echoes, more than their chains,\nI’m the man I built through the joys and the pains.\nPre-Chorus\nThe past ain’t my prison, it’s just where I’ve been,\nEach goodbye’s a door to begin again.\nChorus\nWe raise our glasses to the ones who stayed —\nAnd tip our hats to the ones we outgrew with age.\nThere’s grace in the leavin’, mercy in the signs —\nHere’s to the ghosts we leave behind.\nBridge\nTo the boy I was, scared and alone,\nTo the man I am, who found a home.\nEvery ghost’s a lesson, every scar’s a line,\nI’m singin’ my freedom, leavin’ ghosts behind.\nChorus\nWe raise our glasses to the ones who stayed —\nAnd tip our hats to the ones we outgrew with age.\nThere’s grace in the leavin’, mercy in the signs —\nHere’s to the ghosts we leave behind.\nOutro\n*(Slow picking: E|-3---3---|)*\nHere’s to the ghosts… I’m leavin’ behind.",
      "suggested_venues": [
        "amphitheater",
        "coffee_shop",
        "festival",
        "house_concert",
        "listening_room",
        "outdoor_venue",
        "small_theater"
      ]
    },
    "i_raised_myself": {
      "title": "I Raised Myself",
      "status": "private",
      "lyrics": "Verse 1\nCoal dust on my boots, blood on my hands,\nGrew up in a hell where no one understands.\nDad’s fist was his gospel, his bottle his creed,\nI learned to stand tall while my heart learned to bleed.\nPre-Chorus\nNo soft words, no shelter from the storm,\nJust a boy and a guitar keepin’ my soul warm.\nChorus\nNo lullabies, no ‘good job, son’ —\nJust the sound of doors slammin’ when the hard times come.\nScraped my knees and stitched my pride —\nI raised myself, and I survived.\nVerse 2\nKentucky nights taught me how to fight,\nDodgin’ his shadow in the dim porch light.\nStrummed my pain on strings rusted and worn,\nTurned my scars into songs before the dawn was born.\nPre-Chorus\nNo roadmap, no hand to hold me tight,\nJust a fire in my chest burnin’ through the night.\nChorus\nNo lullabies, no ‘good job, son’ —\nJust the sound of doors slammin’ when the hard times come.\nScraped my knees and stitched my pride —\nI raised myself, and I survived.\nBridge\nEvery bruise was a lesson, every tear was a flame,\nBuilt a man from the wreckage of a cursed last name.\nThis guitar’s my salvation, my truth, my fight,\nI raised myself to sing into the night.\nChorus\nNo lullabies, no ‘good job, son’ —\nJust the sound of doors slammin’ when the hard times come.\nScraped my knees and stitched my pride —\nI raised myself, and I survived.\nOutro\n*(Slow picking: E|-3---3---|)*\nI raised myself… and I’m still alive.",
      "suggested_venues": [
        "coffee_shop",
        "honky_tonk",
        "listening_room",
        "roadhouse",
        "small_theater"
      ]
    },
    "it_took_losing_you_to_find_me": {
      "title": "It Took Losing You to Find Me",
      "status": "private",
      "lyrics": "[Verse 1]\nEmpty echoes in this dawn's soft light\nShadows stretch where your promises died at night\nUsed to chase your whispers on the breeze\nNow I'm chasing something only I can seize\n[Pre-Chorus]\nFields once sown with our shared lies\nNow bloom with truths I can’t deny\nYour absence taught me how to fly\n[Chorus]\nI buried your lies in the fields of my youth\nLaid down the blame and picked up the truth\nYou broke me to set me free\nIt took losin’ you to find me\n[Verse 2]\nMiles of highway, miles inside my soul\nUsed to follow you, now I’m taking control\nBroken pieces scattered on the ground\nBuilt myself up stronger, no lookin’ back around\n[Pre-Chorus]\nFields once sown with our shared lies\nNow bloom with truths I can’t deny\nYour absence taught me how to fly\n[Chorus]\nI buried your lies in the fields of my youth\nLaid down the blame and picked up the truth\nYou broke me to set me free\nIt took losin’ you to find me\n[Bridge]\nMaybe I needed to lose it all\nTo rise from the ashes, stand up tall\nEvery tear I shed, a cleansing rain\nWashing away the hurt, erasing the pain\n[Post-Chorus]\nEvery wound became the road I walked\nI sowed redemption in every talk\nRising stronger than the past I fought\n[Chorus]\nI buried your lies in the fields of my youth\nLaid down the blame and picked up the truth\nYou broke me to set me free\nIt took losin’ you to find me\n[Outro]\nMorning fog lifts, a new day starts to gleam\nYeah, it took losin’ you to wake up from the dream\nFind me, find me, find me... now I’m free.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "kentucky_steel": {
      "title": "Kentucky Steel",
      "status": "private",
      "lyrics": "Verse 1\nBorn in the shadow of a coal-black vein,\nWhere the hollers weep and the skies bleed rain.\nDad’s fists were iron, his heart cold stone,\nBut I carved my soul from the roots I’ve known.\nPre-Chorus\nRaised by dust and gospel’s steady call,\nForged in shafts where shadows crawl,\nMy will hammered into iron walls.\nChorus\nForged in the hills where the wild winds howl,\nRaised by the mines and the gospel sound.\nI got coal dust blood and a hammer for a will—\nThis heart don’t break—it’s Kentucky steel.\nVerse 2\nSweat and grit built these hands of mine,\nCrawled through darkness for a dollar’s shine.\nEvery scar’s a story, every ache a fight,\nI’m standin’ tall in the fading light.\nPre-Chorus\nRaised by dust and gospel’s steady call,\nForged in shafts where shadows crawl,\nMy will hammered into iron walls.\nChorus\nForged in the hills where the wild winds howl,\nRaised by the mines and the gospel sound.\nI got coal dust blood and a hammer for a will—\nThis heart don’t break—it’s Kentucky steel.\nBridge\nFiddle cuts sharp like a miner’s blade,\nEach note’s a fire that the pain remade.\nI’m forged from the hollers, unyielding and true,\nThis spirit’s unbreakable, and it’s carryin’ through.\nChorus\nForged in the hills where the wild winds howl,\nRaised by the mines and the gospel sound.\nI got coal dust blood and a hammer for a will—\nThis heart don’t break—it’s Kentucky steel.\nPost-Chorus\nEvery strike on steel became my song,\nEach scar a verse that made me strong,\nI stand unbroken where I belong.\nOutro \nHollers still echo, but I’m holdin’ the line,\nKentucky steel runs deep in this heart of mine.",
      "suggested_venues": [
        "amphitheater",
        "church",
        "outdoor_venue",
        "revival"
      ]
    },
    "tailgate_testament": {
      "title": "Tailgate Testament",
      "status": "private",
      "lyrics": "Verse 1\nGolden light on a dirt road’s bend, Two kids dreamin’ where the world don’t end. His old Ford hums with a radio glow, Singin’ soft to the love we know.\nPre-Chorus\nDust swirled around barefoot vows, Horizon stretched beyond our brows, We carved forever in simple vows.\nChorus\nA beat-up truck, a sunset drive, A cooler full of promises we’ll barely survive. In these fields, our hearts confess, This is our tailgate testament.\nPost-Chorus\nSunset fades but our words remain, Etched in gravel and harvested grain, We hold this moment through joy and pain.\nVerse 2\nCrickets hum as the stars ignite, Her hand in mine feels like every right. We dance in the glow of a tailgate throne, Buildin’ a future from dreams we’ve sown.\nPre-Chorus\nDust swirled around barefoot vows, Horizon stretched beyond our brows, We carved forever in simple vows.\nChorus\nA beat-up truck, a sunset drive, A cooler full of promises we’ll barely survive. In these fields, our hearts confess, This is our tailgate testament.\nBridge\nNo chapel walls, no preacher’s call, Just open skies and the truth of it all. We’ll weather storms, we’ll chase the light, Swearin’ our love in the warm summer night.\nChorus\nA beat-up truck, a sunset drive, A cooler full of promises we’ll barely survive. In these fields, our hearts confess, This is our tailgate testament.\nOutro\nBoots in the grass, the night rolls in, Our story’s written where the stars begin. Through every mile, we’ll still profess, This is our tailgate testament.",
      "suggested_venues": [
        "amphitheater",
        "coffee_shop",
        "festival",
        "house_concert",
        "listening_room",
        "outdoor_venue"
      ]
    },
    "the_devil_went_down_on_georgia": {
      "title": "The Devil Went Down on Georgia",
      "status": "private",
      "lyrics": "(inspired by but not the same music as the original )\nVerse\nThe Devil went down on Georgia,\nHe was lookin' for a soul to tease.\nHe was feelin' bold, and truth be told,\nHe was itchin' for a little release.\nWhen he came across this fiery girl,\nDancin' in the midnight air,\nThe Devil tipped his hat and said,\n\"Girl, you got that devil-may-care.\"\n\"I guess you didn't know it, but I'm a pleaser too,\" he grinned,\n\"And if you care to take a dare, I'll show you where I've been.\nNow you strut so sweet, and you taste so fine,\nI'll lay my pride upon the line —\nIf you let me under that southern sky,\nI'll show you a helluva time.\"\nGeorgia said, \"My daddy warned me 'bout your kind, you rogue,\nBut I've got a wild side too, so go on, strike your pose!\"\nShe slipped her hands along his jaw,\nAnd whispered low and sly,\n\"If you're gonna play down in my field,\nYou better kiss the ground goodbye.\"\nChorus\nFire in the bayou, heat on the breeze,\nMoonlight melting down through the trees.\nSatin and smoke, and a slow, low moan —\nThe Devil's got Georgia in a world of her own.\nThe Devil laid low with a wicked grin,\nTook his time with a Southern spin,\nEvery kiss a little sin,\nGeorgia just pulled him in.\nVerse\nWhen the morning broke through pine and oak,\nGeorgia laughed and twirled,\nShe'd played that Devil like a fiddle and bow —\nAnd she owned the whole damn world.\nHe said, \"Girl, you are a wildfire —\nYou burned me to the bone.\"\nShe just smiled and tipped her hat,\nSaid, \"That's what you get for comin' down my road.\"\n(Chorus Repeat)\nFire in the bayou, heat on the breeze,\nMoonlight melting down through the trees.\nSatin and smoke, and a slow, low moan —\nThe Devil's got Georgia in a world of her own.\n(Outro)\nThe Devil went down on Georgia,\nBut Georgia ran the show —\nShe turned that red-hot sinner\nInto a puddle on the floor.",
      "suggested_venues": [
        "amphitheater",
        "honky_tonk",
        "outdoor_venue",
        "roadhouse",
        "stadium"
      ]
    },
    "the_music": {
      "title": "The Music",
      "status": "private",
      "lyrics": "Verse 1\nI was born in a holler where the coal dust sings,\nRaised on the ache of broke-down things.\nA trailer’s shadow, a father’s fist,\nFound my salvation in a six-string’s kiss.\nHid that guitar where the floorboards creak,\nPlayed ‘til my fingers bled, too scared to speak.\nChorus\nWhen the world talks too loud for a man to pray,\nI find my gospel in the strings I play.\nSound: fall like rain on a dust-dry field—\nThe music finds the parts I forgot to heal.\nIt’s my shield, my soul, my unbroken truth,\nThe music carries me when I’m black and blue.\nVerse 2\nFound a fiddle in a dumpster, strings half-dead,\nTaught it to cry for the dreams in my head.\nPiano keys I traced on a tabletop worn,\nBuilt me a hymn where my heart was torn.\nEvery scar’s a chord, every bruise a rhyme,\nMusic’s the only thing that’s mine all the time.\nChorus\nWhen the world talks too loud for a man to pray,\nI find my gospel in the strings I play.\nSound: fall like rain on a dust-dry field—\nThe music finds the parts I forgot to heal.\nIt’s my shield, my soul, my unbroken truth,\nThe music carries me when I’m black and blue.\nBridge\nWhen the bottle’s empty and the night’s too long,\nWhen love turns to lies and the road feels wrong,\nI don’t need a preacher, don’t need a sign—\nJust a battered Martin and a melody line.\nIt pulls me through the dark, it speaks my name,\nTurns my silence to a holy flame.\nVerse 3\nNow I’m runnin’ on roads where the maps don’t go,\nChasin’ a sound only my heart knows.\nStrangers hear my voice, they feel my pain,\nSay it’s like thunder callin’ down the rain.\nBut it ain’t for them, it’s for the boy I was—\nWho found his freedom in a guitar’s buzz.\nFinal Chorus\nWhen the world talks too loud for a man to pray,\nI find my gospel in the strings I play.\nSound: fall like rain on a dust-dry field—\nThe music finds the parts I forgot to heal.\nIt’s my shield, my soul, my unbroken truth,\nThe music carries me when I’m black and blue.\nOutro\nSo let the world keep screamin’, let the shadows fall,\nThe music’s my answer, my only call.\nFrom a trailer’s ruin to a stage unknown,\nThe music’s the fire that brings me home.",
      "suggested_venues": [
        "church",
        "coffee_shop",
        "house_concert",
        "listening_room",
        "revival",
        "small_theater"
      ]
    },
    "the_weight_of_silence": {
      "title": "The Weight of Silence",
      "status": "private",
      "lyrics": "Verse 1\nWords we never spoke cut deeper than his belt,\nEvery silent scream was a wound I felt.\nLearned to bite my tongue ‘fore I learned to pray,\nCarried that quiet through each hellbound day.\nPre-Chorus\nTruth was a ghost in that house of pain,\nBut silence was the chain I broke to stay sane.\nChorus\nScreamin’ would’ve been easier than bitin’ my tongue,\nBut I learned early silence wins when the hurt’s been sung.\nEvery heavy word we never said still shines —\nIn the weight of silence left behind.\nVerse 2\nDad’s liquor breath was louder than his care,\nHis fists wrote stories in the midnight air.\nI built my strength in the spaces he ignored,\nTurned my mute defiance to a warrior’s sword.\nPre-Chorus\nPain was a language we both understood,\nBut I chose the quiet to carve my own good.\nChorus\nScreamin’ would’ve been easier than bitin’ my tongue,\nBut I learned early silence wins when the hurt’s been sung.\nEvery heavy word we never said still shines —\nIn the weight of silence left behind.\nBridge\nNow I sing the truths I buried as a boy,\nEach note’s a spark, each chord’s a joy.\nThe weight of silence taught me how to stand,\nI’m breakin’ its chains with these calloused hands.\nChorus\nScreamin’ would’ve been easier than bitin’ my tongue,\nBut I learned early silence wins when the hurt’s been sung.\nEvery heavy word we never said still shines —\nIn the weight of silence left behind.\nOutro\n*(Slow picking: E|-3---3---|)*\nThe weight of silence… I’m leavin’ it behind.",
      "suggested_venues": []
    },
    "when_mountains_weep": {
      "title": "When Mountains Weep",
      "status": "private",
      "lyrics": "[Verse 1]\nCoal dust settles where the pines grow thin\nHollers whisper of the hurt within\nGraves unmarked beneath the ridge’s weight\nHold the dreams that time forgot to save\n[Pre-Chorus]\nRivers carve the scars my fathers wore\nSilent hollers crying out once more\nStone and sweat forever at war\n[Chorus]\nThe hollers cry where the coal veins died\nThe rivers mourn where our fathers lied\nWhen blood stains stone and secrets keep\nEven the mountains, even they weep\n[Verse 2]\nMama’s prayers sank in the valley’s shade\nPappa’s hands broke for the debts unpaid\nTheir ghosts still walk where the wildflowers fade\nIn the shadow of the lives they made\n[Pre-Chorus]\nRivers carve the scars my fathers wore\nSilent hollers crying out once more\nStone and sweat forever at war\n[Chorus]\nThe hollers cry where the coal veins died\nThe rivers mourn where our fathers lied\nWhen blood stains stone and secrets keep\nEven the mountains, even they weep\n[Bridge]\nEvery seam I crawled, I learned their pain\nEvery callus holds a family’s chain\nBetrayed by love, by land, by greed\nI sing for souls this world don’t need\n[Post-Chorus]\nWind carries tales of loss and shame\nEach echo bearing an unspoken name\nI sing their sorrow into lasting flame\n[Chorus]\nThe hollers cry where the coal veins died\nThe rivers mourn where our fathers lied\nWhen blood stains stone and secrets keep\nEven the mountains, even they weep\n[Outro]\nBeneath the peaks where the silence sleeps\nEven the mountains, even they weep",
      "suggested_venues": [
        "amphitheater",
        "church",
        "coffee_shop",
        "listening_room",
        "outdoor_venue",
        "small_theater"
      ]
    },
    "yes_boys_do_cry_sometimes": {
      "title": "Yes, Boys Do Cry Sometimes",
      "status": "private",
      "lyrics": "Yes, Boys Do Cry Sometimes\n(Verse 1) Shoulders built like mountains, jaw carved out of stone Walk this Pikeville dirt path feelin' quite alone Got the kind of blue eyes make the girls all stare Wear these calloused knuckles like a cross I bear Down on Blackberry Creek, in that rusty double-wide Hid that broke-string guitar deep down safe inside Found it by the highway, six years old and scared Played out Daddy's liquor snores, a secret life I shared Heard him slur, \"You killed her,\" felt the belt bite deep and low Learned to choke the music back, not let the feelin' show\n(Chorus) They tell you build the walls high, boy, be a man of stone Keep the hurtin' buried, deep inside the bone Straighten up that backbone, don't you show the fear But some floods rise too heavy, year after lonely year Yeah, the dam can break, the ocean starts to rise Yes, boys do cry sometimes, behind these fighter's eyes\n(Verse 2) Left home at sixteen, punch fresh on my face Found a room with Jonesy, another sorry place Crawled the seams on bloody knees, breathed the black-lung air Worked the fields till sundown, showin' you I cared Every eighteen-hour day, scrapin' dirt and coal Was sendin' you to college, tryin' to make you whole You were my one soft place, my only whispered dream My anchor 'gainddddst the current of that dark Kentucky stream Then that movin' picture, shinin' on the screen Showed my anchor draggin' through a place I'd never been\n(Chorus) They tell you build the walls high, boy, be a man of stone Keep the hurtin' buried, deep inside the bone Straighten up that backbone, don't you show the fear But some floods rise too heavy, year after lonely year Yeah, the dam can break, the ocean starts to rise Yes, boys do cry sometimes, behind these fighter's eyes\n(Bridge) This body's built for battle, muscle hard and tight Thought I'd carved out somethin' that could stand against the night But muscle can't stop memories, can't outrun the fear And betrayal's got a sharp edge, cuts you ear to ear This choked-up voice inside me, the songs I couldn't free Screamin' silent thunder, now spillin' out of me It ain't weakness breakin', maybe it's the start Of lettin' out the poet trapped inside this bleedin' heart\n(Chorus) They tell you build the walls high, boy, be a man of stone Keep the hurtin' buried, deep inside the bone Straighten up that backbone, don't you show the fear But some floods rise too heavy, year after lonely year Yeah, the dam can break, the ocean starts to rise Yes, boys do cry sometimes, behind these fighter's eyes\n(Outro) So I hold this rescued six-string, scarred up just like me Let the teardrops fall like acid rain, finally runnin' free Underneath this coal town moon, lettin' the pain bleed through... Yes, boys do cry sometimes... tonight, this boy does too. (Guitar fades out slowly, leaving a resonant, aching chord)",
      "suggested_venues": [
        "coffee_shop",
        "listening_room",
        "small_theater"
      ]
    },
    "lantern_i_left_behind": {
      "title": "Lantern I Left Behind",
      "status": "private",
      "lyrics": "Lantern I Left Behind\n(Verse 1)\nSunrise spills across the ridge, paints the valley gold\nAnother day breaks on this farm, a story left untold\nOf restless nights and whispered dreams beneath a moonless sky\nAnd the lantern I left burning low, the night you said goodbye.\nThe crickets chirped a lonely tune, the wind sighed through the trees\nI watched your shadow disappear, carried on the breeze.\n(Chorus)\nLantern I left behind, a flickering ember glow\nA beacon in the darkness, watchin' where you go\nA fragile flame against the dawn, a hope I couldn't keep\nJust a memory now, a promise I couldn't sleep.\n(Verse 2)\nThe rooster crows, a mournful sound, echoes through the air\nAnother day to plow these fields, another burden to bear\nThe coffee's strong and bitter black, like the taste in my mouth now\nRemember how we used to laugh, beneath the apple bough?\nWe carved our initials in the bark, swore it'd always be\nBut time and distance took their toll, and stole you away from me.\n(Bridge)\nMaybe someday down the road, our paths will cross again\nMaybe someday I'll understand, and forgive the hurt and pain\nMaybe someday the lantern's light won't sting my eyes so bright\nMaybe someday I'll find my peace, in the stillness of the night.\n(Chorus)\nLantern I left behind, a flickering ember glow\nA beacon in the darkness, watchin' where you go\nA fragile flame against the dawn, a hope I couldn't keep\nJust a memory now, a promise I couldn't sleep.\n(Outro)\nJust a memory now, a lantern I left behind\nBurning in the morning light, a love I couldn't find.\nBurning in the morning light…",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "if_youre_breathing_youre_worth_saving": {
      "title": "If You’re Breathing, You’re Worth Saving",
      "status": "private",
      "lyrics": "If You’re Breathing, You’re Worth Saving\nVerse 1\nDust motes dancing in the faded light\nOf a single bulb hanging low tonight\nEmpty bottle whispers stories untold\nAnother heart grown weary and old\nHe sits and stares at the cracked window pane\nRain streaks down like tears, washing away the stain\nOf a life lived hard, a path gone astray\nLost in the shadows, afraid of the day\nChorus\nBut if you’re breathing, you’re worth saving\nA flicker of hope in the darkness waving\nEven when the whispers tell you you’re done\nThere’s a sunrise waiting, a battle to be won\nIf you’re breathing, you’re worth saving\nDon’t let the shadows keep you from craving\nThe light that’s within, the strength you possess\nRise from the ashes, find your blessedness\nVerse 2\nShe walks the streets with her head held down\nInvisible wounds in this bustling town\nA silent scream trapped behind her eyes\nLost in the echoes of a thousand lies\nCarries the weight of a broken promise made\nA fractured dream that slowly decayed\nShe searches for solace, a hand to hold tight\nA beacon of hope in the darkest of night\nChorus\nBut if you’re breathing, you’re worth saving\nA flicker of hope in the darkness waving\nEven when the whispers tell you you’re done\nThere’s a sunrise waiting, a battle to be won\nIf you’re breathing, you’re worth saving\nDon’t let the shadows keep you from craving\nThe light that’s within, the strength you possess\nRise from the ashes, find your blessedness\nBridge\nThe world may judge you, may turn away its face\nBut grace finds its way to the most desolate place\nDon’t give up now, there’s still time to mend\nA broken heart can learn to love again\nChorus\nIf you’re breathing, you’re worth saving\nA flicker of hope in the darkness waving\nEven when the whispers tell you you’re done\nThere’s a sunrise waiting, a battle to be won\nIf you’re breathing, you’re worth saving\nDon’t let the shadows keep you from craving\nThe light that’s within, the strength you possess\nRise from the ashes, find your blessedness\nOutro\nIf you’re breathing… you’re worth saving…\nYou’re worth saving…\nYou’re worth saving…",
      "suggested_venues": []
    },
    "red_dirt_road": {
      "title": "Red Dirt Road",
      "status": "private",
      "lyrics": "Red Dirt Road\n(Verse 1)\nSunrise paints the cotton fields a hazy shade of gold\nAnother town I can't recall, another story told\nOf a restless heart and wandering feet, a shadow in the night\nSearching for a place to land, a flicker of guiding light\nThey call me outlaw, rebel soul, a drifter through and through\nBut beneath this hardened shell, a homesick heart beats true\n(Chorus)\nRed dirt road, windin' back to where I belong\nWhere the cypress trees stand tall and the mockingbird's sweet song\nEchoes through the valleys, a memory so clear\nRed dirt road, whisperin' \"you're finally here\"\n(Verse 2)\nRan from the whispers, the judgment in their eyes\nFrom the expectations heavy, beneath these southern skies\nThought I could outrun the past, the ghosts that held me down\nBut freedom's just a hollow word in every nameless town\nTraded family for the highway, love for open space\nNow I see the emptiness etched upon my weary face\n(Bridge)\nThe asphalt ribbon stretched on, a promise never kept\nOf something more, something different, a secret I had slept\nWith for too long, a restless dream that turned into a lie\nNow I'm turnin' 'round, headin' back, beneath the open sky\n(Chorus)\nRed dirt road, windin' back to where I belong\nWhere the cypress trees stand tall and the mockingbird's sweet song\nEchoes through the valleys, a memory so clear\nRed dirt road, whisperin' \"you're finally here\"\n(Outro)\nDust devils dancin' in the afternoon sun's glow\nRed dirt road, takin' me home, slow and low\nYeah, takin' me home, slow and low.\nRed dirt road, I'm finally home, I know.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "scars_and_smoke": {
      "title": "Scars and Smoke",
      "status": "private",
      "lyrics": "Verse 1\nSunrise bleeds red over coal-dust hills, another day’s begun,\nGravel crunches under boots, chasin’ a merciless sun.\nAin’t the life I dreamed, boy, ain’t the hand I aimed to draw,\nBut ghosts of broken yesterdays still claw me raw.\nPre-Chorus\nNo preacher’s words could save me, no bottle drowns the pain,\nJust me and these old scars, walkin’ through the rain.\nChorus\nScars and smoke, heart carved to stone, that’s all they think I am,\nA rambler’s soul, bound to roam, with a rebel’s give-a-damn.\nBut deep beneath this busted shell, a spark still fights to burn,\nScratchin’ through the gates of hell, for peace I’ll never earn.\nVerse 2\nHighway’s a lonesome thread, gray as a miner’s grave,\nEach mile a cut that memory’s blade never forgave.\nBurned my bridges, paid in blood, for choices I can’t mend,\nHuntin’ grace in ghost-town dust, where the lost roads end.\nPre-Chorus\nNo mercy in the mirror, just a boy who learned to fight,\nCarvin’ truth from shattered years, under cold starlight.\nChorus\nScars and smoke, heart carved to stone, that’s all they think I am,\nA rambler’s soul, bound to roam, with a rebel’s give-a-damn.\nBut deep beneath this busted shell, a spark still fights to burn,\nScratchin’ through the gates of hell, for peace I’ll never earn.\nBridge\nThey say time stitches wounds, but mine still bleed and scream,\nEchoes of a daddy’s fist haunt every damn dream.\nI won’t let the dark win, won’t lay down and die,\nGonna claw toward that faint light, till I touch the sky.\nChorus\nScars and smoke, heart carved to stone, that’s all they think I am,\nA rambler’s soul, bound to roam, with a rebel’s give-a-damn.\nBut deep beneath this busted shell, a spark still fights to burn,\nScratchin’ through the gates of hell, for peace I’ll never earn.\nOutro\n*(Slow picking, low E drone)*\nJust a flicker of peace tonight, under this lonesome moon so bright.\nScars and smoke, it’s all I’ve known,\nKeep walkin’ these roads, till I call ‘em home.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue",
        "roadhouse"
      ]
    },
    "wildflower_heart": {
      "title": "Wildflower Heart",
      "status": "private",
      "lyrics": "Title:  Wildflower Heart\n(Verse 1)\nGrandma's china, chipped and worn\nSitting pretty on a shelf, a life adorned\nWith stories whispered, dreams untold\nA legacy of strength, a heart of gold\nBut I wasn't born for porcelain and lace\nThis restless spirit needed open space\nTo find my own voice, my own design\nA different kind of beauty, a wilder vine\n(Chorus)\nI'm a wildflower heart, blooming late\nReaching for the sun, defying fate\nBreaking free from fences, painted white\nDancing in the moonlight, bathed in silver light\nI'm a wildflower heart, finally free\nThis untamed spirit, that's the real me\n(Verse 2)\nMama's wisdom, etched in lines\nOn her hands that worked, through sun and shine\nShe taught me kindness, grace, and how to pray\nBut sometimes silence stole my words away\nI traded whispers for a roaring sound\nMy roots ran deeper in unturned ground\nWhere shadows danced and secrets grew\nAnd I discovered truths, mama never knew\n(Bridge)\nMaybe it's the wind that carries seeds of change\nAcross the generations, rearranging\nThe patterns of our lives, the paths we roam\nUntil we finally find our way back home\nTo the heart that beats within, wild and strong\nWhere we belong, where we've belonged all along\n(Chorus)\nI'm a wildflower heart, blooming late\nReaching for the sun, defying fate\nBreaking free from fences, painted white\nDancing in the moonlight, bathed in silver light\nI'm a wildflower heart, finally free\nThis untamed spirit, that's the real me\n(Outro)\nYeah, this wildflower heart, it's finally free\nBlooming bright, for everyone to see\nThis untamed spirit, that's the real me\nThe real me.",
      "suggested_venues": [
        "amphitheater",
        "church",
        "outdoor_venue",
        "revival"
      ]
    },
    "full_and_gone": {
      "title": "Full and Gone",
      "status": "private",
      "lyrics": "Verse 1\nI packed my scars in a beat-up truck, left Pikeville in the dust,\nCoal-black memories clingin’ tight, like rust that won’t unrust.\nAin’t no fixin’ what that town broke, no mendin’ what it stole,\nBut I rolled out with a heart still beatin’, battered but whole.\nPre-Chorus\nNo tears for that trailer, no love for its chains,\nJust a boy’s old ghosts and a man’s new pains.\nChorus\nI left this town full, not fixed, but full,\nCarried my dreams past the weight of its pull.\nWith a rusted guitar and a fire inside,\nI’m gone from the holler, but I’m still alive.\nVerse 2\nBlackberry Creek’s where I learned to bleed, where fists taught me to stand,\nFound a six-string in a dumpster’s wreck, salvation in my hands.\nEvery bruise a map of hurt, every street a dead-end lie,\nBut I’m haulin’ hope down this open road, under a clearer sky.\nPre-Chorus\nNo preacher could save me, no bottle could drown,\nThe screams of that double-wide, that ghost-ridden town.\nChorus\nI left this town full, not fixed, but full,\nCarried my dreams past the weight of its pull.\nWith a rusted guitar and a fire inside,\nI’m gone from the holler, but I’m still alive.\nBridge\nI ain’t healed, but I’m heavy with fight,\nHer spark lit the way through my darkest night.\nFrom the mines’ cold grip to the stage’s raw glow,\nI’m full of the strength that only leavin’ can show.\nChorus\nI left this town full, not fixed, but full,\nCarried my dreams past the weight of its pull.\nWith a rusted guitar and a fire inside,\nI’m gone from the holler, but I’m still alive.\nOutro\n*(Slow picking, low E drone)*\nFull and gone, with the mountain’s old hum,\nSingin’ my truth, till the new day comes.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "diner_life": {
      "title": "Diner Life",
      "status": "private",
      "lyrics": "Verse 1\nMae’s Diner glows on a lonesome street, neon hummin’ low,\nI was nine, pockets full of change, nowhere else to go.\nBiscuits warm as a mother’s love, gravy thick with heart,\nFound a home in that vinyl booth, when my world fell apart.\nPre-Chorus\nCoffee stains and checkered floors, where the broke could rest,\nMae’s smile stitched my shattered soul, gave my heart a nest.\nChorus\nDiner life, where the jukebox wails of heartache and dreams,\nTruckers, drifters, lost souls mendin’ seams.\nIn the clink of forks, the hum of late-night fights,\nMae’s Diner held me close, through the long, hard nights.\nVerse 2\nWaitress knew my name, slipped me extra fries,\nSaw my hurt fade slow, never pried ‘bout my eyes.\nCounter held my scribbled hopes, dreams scratched in ink,\nFrom a kid with nothin’ to a man who learned to think.\nPre-Chorus\nGrease and grace on every plate, where the weary heal,\nMae’s was more than food—it’s where I learned to feel.\nChorus\nDiner life, where the jukebox wails of heartache and dreams,\nTruckers, drifters, lost souls mendin’ seams.\nIn the clink of forks, the hum of late-night fights,\nMae’s Diner held me close, through the long, hard nights.\nBridge\nEvery dime I scraped, I laid on that counter’s shine,\nBought me biscuits, bought me time, bought a spark divine.\nNow I sing for the ones still countin’ change in the glow,\nMae’s Diner’s where the heartland’s stories grow.\nChorus\nDiner life, where the jukebox wails of heartache and dreams,\nTruckers, drifters, lost souls mendin’ seams.\nIn the clink of forks, the hum of late-night fights,\nMae’s Diner held me close, through the long, hard nights.\nOutro\n*(Slow fiddle fade, soft picking)*\nDiner life… Mae’s light still burns, callin’ me near,\nTo the place where I found hope, when hope disappeared.",
      "suggested_venues": [
        "coffee_shop",
        "house_concert",
        "listening_room",
        "roadhouse",
        "small_theater"
      ]
    },
    "blackberry_creek_blues": {
      "title": "Blackberry Creek Blues",
      "status": "private",
      "lyrics": "Title: Blackberry Creek Blues\n(Verse 1)\nSun bleeds orange through the pines, 'nother day done broke\nDown Blackberry Creek Road, where the silence only spoke\nOf broken promises and ghosts that linger in the air\nDaddy's shadow on the porch, a weight I couldn't bear.\nSixteen years and a busted arm, a guitar and a suitcase old\nWalked away from that hollow, a story yet untold.\n(Chorus)\nBlackberry Creek Blues, singin' in my soul\nA melody of hardship, a story to unfold\nOf coal dust and callouses, a heart both tough and worn\nBlackberry Creek Blues, the day that I was born.\n(Verse 2)\nFound a shack down by the river, traded work for bed\nPickin' beans and diggin' coal, a roof above my head\nThis rusted six-string sings my sorrow, sings my pain\nA broken boy from broken mountains, singin' in the rain.\nAin't lookin' for no pity, ain't lookin' for no fame\nJust tryin' to find my own damn rhythm in this life's hard game.\n(Bridge)\nMama used to hum a hymn, a whisper in the dark\nSaid, \"Boy, find your own damn light, leave your own damn mark.\"\nHer words echo in the hollers, a comfort and a guide\nAs I wrestle with the demons that I keep locked inside.\n(Chorus)\nBlackberry Creek Blues, singin' in my soul\nA melody of hardship, a story to unfold\nOf coal dust and callouses, a heart both tough and worn\nBlackberry Creek Blues, the day that I was born.\n(Outro)\nYeah, Blackberry Creek Blues, they run deep and strong\nLike the roots of these old mountains, where I belong.\nWhere I belong.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "faded_mountain_truths": {
      "title": "Faded Mountain Truths",
      "status": "private",
      "lyrics": "Title:  Faded Mountain Truths\n(Verse 1)\nFaded photographs in a dusty frame\nMama's smilin' face, ain't nothin' changed\n'Cept the lines etched deeper, like the cracks on these hills\nYears of worry and winters' chills\nDaddy's shadow, a storm cloud gray\nHangin' heavy, never went away\nLearned my lessons in the holler's shade\nMountain wisdom, hard earned and paid\n(Chorus)\nThese mountains whisper secrets old and true\nTough as the roots that see 'em through\nLike the wind that bends the pine so low\nGotta bend, not break, to weather the blow\nFaded mountain truths, etched in stone\nA legacy of hardship, a heart I call my own\n(Verse 2)\nSixteen years, Blackberry Creek Road dust on my boots\nKicked out the door, nothin' but the clothes on my back, and a few faded roots\nFound shelter in a tin can shack, leaks when it rained\nWorked the fields, the mines, felt the body ache and pain\nThis broken arm, a constant reminder of his rage\nBut these calloused hands, they turned a new page\nFound solace in the strings of a rusted guitar\nSingin' my sorrows, beneath the evenin' star\n(Bridge)\nHe tried to break me, spirit and bone\nBut the mountain in me wouldn't be overthrown\nLike the coal that burns, a fire within\nI rose from the ashes, learned to begin\n(Chorus)\nThese mountains whisper secrets old and true\nTough as the roots that see 'em through\nLike the wind that bends the pine so low\nGotta bend, not break, to weather the blow\nFaded mountain truths, etched in stone\nA legacy of hardship, a heart I call my own\n(Outro)\nSun's comin' up, paintin' the sky gold\nA new day breakin', a story yet untold\nAnd though the shadows linger, I ain't afraid no more\nGot faded mountain truths, to guide me to the shore.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "drink_to_the_family": {
      "title": "Drink to the Family",
      "status": "private",
      "lyrics": "(Verse 1)\nDust on my boots from a road gone rough\nChased dreams that broke when the times got tough\nKin turned their backs, left scars on my hide\nBut I found my crew where the good vibes ride\nA shot of Jack burns the pain away\nThese friends are my home, they’re here to stay\n(Chorus)\nRaise a shot of Jack to the family that ain’t blood\nToast the ones who lift you from the mud\nWhen the world slams the door, they kick it in tight\nThese rowdy hearts blaze wild in the night\nHere’s to family, true and bold!\n(Verse 2)\nWorked ‘til my hands cracked, bones wore thin\nFelt every loss like a cold, hard sin\nGhosts try to drag me, but I ain’t alone\nMy posse’s my throne, this tailgate’s our zone\nA bottle of Bud, we pass it around\nLaugh ‘til we’re dizzy, no hurt to be found\n(Verse 3)\nMoonlight’s our spotlight, the stars set the stage\nRaisin’ hell together, we’re writin’ this page\nFights and hard nights, we’ve weathered the storm\nThese brothers and sisters, they keep my heart warm\nA jar of moonshine, it stings, but it’s sweet\nTo the kin that I chose, who make life complete\n(Bridge)\nThis old guitar wails a rebel’s tune\nSings of nights lit by a bonfire moon\nHere’s to the lost, the wild, the free\nThe ones who stood tall and drank with me\nThey’re my fight, my soul, my song\n(Chorus)\nRaise a shot of Jack to the family that ain’t blood\nToast the ones who lift you from the mud\nWhen the world slams the door, they kick it in tight\nThese rowdy hearts blaze wild in the night\nHere’s to family, true and bold!\n(Outro)\nYeah, true and bold, through the highs and the lows\nBottle of Bud, moonshine’s glow\nRaise a shot of Jack, let the good times roll",
      "suggested_venues": [
        "amphitheater",
        "festival",
        "honky_tonk",
        "house_concert",
        "outdoor_venue",
        "roadhouse",
        "stadium"
      ]
    },
    "hell_and_hymns": {
      "title": "Hell and Hymns",
      "status": "private",
      "lyrics": "Verse 1\nFriday night, under neon’s roar,\nWhiskey’s pullin’ hard, settlin’ old scores.\nJukebox wails, hearts hit the floor,\nDancin’ through the haze, chasin’ something more.\nAnother week of grind, bones worn thin,\nSweat still burns where the work don’t end.\nBut tonight we’re alive, breakin’ every chain,\n‘Til the sunrise lights the sky with flame.\nPre-Chorus\nRunnin’ wild, but the soul’s still split,\nTorn between the dark and the holy lit.\nChorus\nHell and hymns, we’re caught in the fray,\nWhiskey sins, then we kneel to pray.\nThis heart keeps fightin’, searchin’ for release,\nBetween the devil’s fire and a savior’s peace.\nHell and hymns, our anthem’s cry,\nSaturday’s rebellion, Sunday’s sky.\nRisin’ from the ashes ‘neath a lonesome moon,\nLord, redeem these hands, scarred and strewn.\nVerse 2\nGuitar moans a lonesome plea,\nEmpty bottle spins, hauntin’ memories.\nFound that six-string in a junkyard’s shine,\nStrummed my soul where the wild winds whine.\nOld man’s shadow still stalks my days,\nHis bitter words like a hell that stays.\nBut mama’s prayers, they pull me through,\nWhisperin’ hope in the morning dew.\nPre-Chorus\nLivin’ rough, but the heart holds strong,\nSeekin’ light where the nights are long.\nChorus\nHell and hymns, we’re caught in the fray,\nWhiskey sins, then we kneel to pray.\nThis heart keeps fightin’, searchin’ for release,\nBetween the devil’s fire and a savior’s peace.\nHell and hymns, our anthem’s cry,\nSaturday’s rebellion, Sunday’s sky.\nRisin’ from the ashes ‘neath a lonesome moon,\nLord, redeem these hands, scarred and strewn.\nBridge\nNo preacher’s verse, just a worker’s call,\nCoal-dust dreams climbin’ past the fall.\nBeggin’ for a spark to break the night,\nFrom the shadows to salvation’s light.\nChorus\nHell and hymns, we’re caught in the fray,\nWhiskey sins, then we kneel to pray.\nThis heart keeps fightin’, searchin’ for release,\nBetween the devil’s fire and a savior’s peace.\nHell and hymns, our anthem’s cry,\nSaturday’s rebellion, Sunday’s sky.\nRisin’ from the ashes ‘neath a lonesome moon,\nLord, redeem these hands, scarred and strewn.\nOutro\n*(Fiddle soar, steady strum)*\nHell and hymns, my soul’s still tried,\nBut I’m risin’ up where the heart don’t hide.\nAmen.",
      "suggested_venues": [
        "dive_bar",
        "festival",
        "honky_tonk",
        "roadhouse"
      ]
    },
    "whispers_from_the_hemlock_holler": {
      "title": "Whispers from the Hemlock Holler",
      "status": "private",
      "lyrics": "(Verse 1)\nCreek water whisperin' secrets low,\n'Bout the mountain's wisdom, slow and slow.\nHemlock shadows stretchin' long and deep,\nPeace in the silence, secrets to keep.\nCampfire light a-flickerin' in the night,\nStars above, burnin' ever so bright.\n(Chorus)\nOld man mountain, he don't speak a word,\nBut lessons learned, ain't never heard\nIn no dusty book or preacher's plea,\nJust the wind's sigh in the old oak tree.\nTruth ain't found in the city's glare,\nIt's here in the hollers, hangin' in the air.\n(Verse 2)\nDaddy's anger, a thunderin' storm,\nLeft scars deeper than any coal mine's form.\nSixteen years, kicked out in the cold,\nThese Kentucky hollers, stories untold.\nBroken arm, achin' bone and all,\nBut this rusted guitar, answered my call.\n(Bridge)\nFound solace in the strings, a mournful cry,\nEchoin' the pain I couldn't deny.\nEach note a whisper, a prayer sent high,\nTo the mountain's spirit, beneath the sky.\n(Chorus)\nOld man mountain, he don't speak a word,\nBut lessons learned, ain't never heard\nIn no dusty book or preacher's plea,\nJust the wind's sigh in the old oak tree.\nTruth ain't found in the city's glare,\nIt's here in the hollers, hangin' in the air.\n(Outro)\nYeah, hangin' in the air, like the mountain mist,\nA quiet knowin', that can't be missed.\nWhispers from the hemlock, soft and low,\nThe mountain's wisdom, helpin' me grow...",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "church_of_country": {
      "title": "Church of Country",
      "status": "private",
      "lyrics": "Verse 1\nI hit the stage on red dirt, where the heartland’s callin’ me,\nFrom dive bar smoke to stadiums, this is where I’m free.\nHank’s ghost in my guitar, Dolly’s shine in my soul,\nCountry’s fire in my bones, it’s the only life I know.\n\nPre-Chorus\nSteel guitars are my pulpit, banjo’s my battle cry,\nEvery scar’s a song I sing, reachin’ for the sky.\n\nChorus\nThis is the Church of Country, where the faithful raise a spark,\nJohnny’s growl, Shania’s strut, lightin’ up the dark.\nSing for Patsy, for Stapleton, let the fiddle break the chains,\nCountry’s pulse is beatin’ loud, runnin’ wild in our veins!\n\nVerse 2\nI’m singin’ Loretta’s truth, Willie’s ramblin’ road,\nGeorge Jones’ whiskey heartache, carryin’ the load.\nFrom Waylon’s outlaw thunder to Miranda’s rebel flame,\nEvery note’s my hallelujah, country’s my true name.\n\nPre-Chorus\nBoots stomp the rhythm, my voice’ll shake the ground,\nIn this Church of Country, salvation’s what I’ve found.\n\nChorus\nThis is the Church of Country, where the faithful raise a spark,\nJohnny’s growl, Shania’s strut, lightin’ up the dark.\nSing for Patsy, for Stapleton, let the fiddle break the chains,\nCountry’s pulse is beatin’ loud, runnin’ wild in our veins!\n\nBridge\nIt’s a honky-tonk redemption, where the broken find their fight,\nCash’s truth, Kacey’s grace, guidin’ me through the night.\nFrom backroad hymns to neon dreams, I’ll carry on the sound,\nCountry’s heart is mine to hold, forever glory-bound!\n\nFinal Chorus\nThis is the Church of Country, where the roots will never fade,\nLoretta’s coal dust soul, Alan’s river escapade.\nRaise a glass for every dreamer, let the banjo’s fire roar,\nCountry’s callin’ me to sing, now and evermore!\n\nOutro\n*(Fiddle tears the roof off, steel guitar screams)*\nChurch of Country, hear my voice, let the whole world know,\nThis is my salvation, where my rebel heart’ll go!\n*(Pyro pops, crowd roars)*\nHallelujah, country soul, Alex takes the show!",
      "suggested_venues": [
        "arena",
        "church",
        "coffee_shop",
        "dive_bar",
        "festival",
        "honky_tonk",
        "house_concert",
        "listening_room",
        "revival",
        "roadhouse",
        "stadium"
      ]
    },
    "workin_for_a_living": {
      "title": "Workin' for a Living",
      "status": "private",
      "lyrics": "Verse 1\nDawn breaks hard, boots hit the ground,\nSweat’s my pay where the work is found.\nNo silver spoon, just a will to fight,\nPushin’ through the long days into the night.\n\nPre-Chorus\nBlisters on my hands, fire in my chest,\nEvery drop of sweat’s a step toward the best.\n\nChorus\nWorkin’ for a livin’, sunup till the stars burn bright,\nRough hands, tired bones, holdin’ on with all my might.\nAin’t got much, but I got heart, a spark that won’t let go,\nWorkin’ for a livin’, buildin’ dreams from the ground below.\n\nVerse 2\nFields of dust, factory’s hum,\nHaulin’ loads till my body’s numb.\nEvery ache’s a badge, every scar’s a sign,\nI’m carvin’ out a life that’s proud and mine.\n\nPre-Chorus\nNo shortcut’s callin’, no easy way,\nJust the grind that shapes me, day by day.\n\nChorus\nWorkin’ for a livin’, sunup till the stars burn bright,\nRough hands, tired bones, holdin’ on with all my might.\nAin’t got much, but I got heart, a spark that won’t let go,\nWorkin’ for a livin’, buildin’ dreams from the ground below.\n\nBridge\nRound the fire’s glow, we share the load,\nLaughin’ through the hurt, on this long road.\nFor the ones who toil, for the ones who strive,\nThis song’s for the workers keepin’ hope alive.\n\nChorus\nWorkin’ for a livin’, sunup till the stars burn bright,\nRough hands, tired bones, holdin’ on with all my might.\nAin’t got much, but I got heart, a spark that won’t let go,\nWorkin’ for a livin’, buildin’ dreams from the ground below.\n\nOutro\n(Fiddle kicks, steady strum)\nWorkin’ for a livin’, that’s my truth, my fight,\nFrom the break of dawn to the end of night.",
      "suggested_venues": [
        "arena",
        "festival",
        "honky_tonk",
        "roadhouse",
        "stadium"
      ]
    },
    "coal_dust_sunrise": {
      "title": "Coal Dust Sunrise",
      "status": "private",
      "lyrics": "Long shadows creep on the valley floor,\nAs the bleeding sky unveils what's in store.\nA cold breath sighs through the hollows deep,\nWhere old dreams stir and new promises keep.\nA shack stands weathered, a whisper of gray,\nBut a tender warmth chases shadows away.\nA soft hymn rises on the morning's chill,\nA silent plea, standing perfectly still.\n(Pre-Chorus)\nBeneath the grit, a spark ignites,\nChasing the ghosts of endless nights.\nThis ain't no Eden, raw and deep,\nBut promises the weary keep.\n(Chorus)\nThese coal dust sunrises, they stain the peaks in gray,\nBut hope's true fire still finds a way, yeah, it always finds a way.\nThe tired earth groans, a haunting, low refrain,\nYet grit-worn hands find strength to rise and live again.\nTo rise and breathe again.\n(Verse 2)\nThe earth gives freely, then demands its toll,\nEach dawn a testament to body and soul.\nRedemption's whisper in the morning's light,\nA bruising struggle, a constant, inner fight.\nA flicker of grace, a beacon in the night,\nA stubborn promise burning ever so bright.\nThe scars remain, a map of every pain,\nBut the spirit's song, a fierce, unbroken strain.\n(Pre-Chorus)\nBeneath the grit, a spark ignites,\nChasing the ghosts of endless nights.\nThis ain't no Eden, raw and deep,\nBut promises the weary keep.\n(Chorus)\nThese coal dust sunrises, they stain the peaks in gray,\nBut hope's true fire still finds a way, yeah, it always finds a way.\nThe tired earth groans, a haunting, low refrain,\nYet grit-worn hands find strength to rise and live again.\nTo rise and breathe again.\n(Bridge)\nThe mountain stands, a titan through the years,\nSwallowing hardship, conquering all fears.\nThis ain't the ending, just a beat in between,\nA chance to reclaim, to heal, to be seen.\n(Chorus)\nThese coal dust sunrises, they stain the peaks in gray,\nBut hope's true fire still finds a way, yeah, it always finds a way.\nThe tired earth groans, a haunting, low refrain,\nYet grit-worn hands find strength to rise and live again.\nTo rise and breathe again.\n(Outro)\nTo rise and breathe again,\nA coal dust sunrise, and we're all risin' again.",
      "suggested_venues": [
        "amphitheater",
        "church",
        "coffee_shop",
        "festival",
        "house_concert",
        "listening_room",
        "outdoor_venue",
        "revival",
        "small_theater",
        "stadium"
      ]
    },
    "my_kentucky_heartbeat": {
      "title": "My Kentucky Heartbeat",
      "status": "private",
      "lyrics": "(Verse 1)\nSunrise paints these Blue Ridge Mountains, but I'm already caked in mine grime\nAnother shift done, countin' pennies, losin' track of time.\nThis old pickup's my four walls now, under the Kentucky moon so wide\nBut thinkin' of your West Coast smile, girl, eases the ache inside.\n(Chorus)\nHey, Shay, my Kentucky Heartbeat, my steady ground so true,\nMiles can't change this rhythm I only find in you.\nEvery sunrise I fight for, every dollar I make,\nIs for your California dream, no matter what it takes.\n(Verse 2)\nRemember Blackberry Creek, dust devils dancin' in the summer heat?\nFelt like magic then, your hand in mine, oh, bitter and so sweet.\nNow your picture on the dash, it guides me through the dark and lonely road\nHelps me carry every burden, helps me lift this heavy load.\n(Chorus)\nHey, Shay, my Kentucky Heartbeat, my steady ground so true,\nMiles can't change this rhythm I only find in you.\nEvery sunrise I fight for, every dollar I make,\nIs for your California dream, no matter what it takes.\n(Bridge)\nThese calloused hands have known the sting of cold and burnin' steel\nPlayed a rusted, found guitar, makin' all this heartache real.\nBut you heard the truth within the noise, a song beneath the pain\nMy Shay Bear, your belief in me, it washes off the stains.\n(Chorus)\nHey, Shay, my Kentucky Heartbeat, my steady ground so true,\nMiles can't change this rhythm I only find in you.\nEvery sunrise I fight for, every dollar I make,\nIs for your California dream, no matter what it takes.\n(Outro)\nYeah, my Kentucky Heartbeat, thumpin' just for you, Shay Bear. \nMore than just some words, girl, this is my earnest prayer.\nMy truth, my song, for you",
      "suggested_venues": [
        "amphitheater",
        "honky_tonk",
        "outdoor_venue",
        "roadhouse"
      ]
    },
    "going_viral": {
      "title": "Going Viral",
      "status": "private",
      "lyrics": "(Verse 1)\nStarted with some coffee, or what they call it here,\nTalkin' 'bout oat nipples, made Shay Bear grin ear to ear.\nThen a goat in a sweater, name of Harold, if you please,\nHad me on the pavement, laughin' till I couldn't breathe.\nMoonbeam had a guitar, hangin' like a piece of art,\nSaid it needed playin', right from my Kentucky heart.\n(Chorus)\nNow they say I'm goin' viral, whatever that might mean,\nLittle screens all lit up, the craziest damn thing I've seen.\nSingin' 'bout sad porridge and Harold in his Sunday best,\nJust a red dirt drifter puttin' feelings to the test,\nOut here in this LA sun, ain't like no place I know,\nWonderin' how a whisper turned into a picture show.\n(Verse 2)\nJumped up on a table, sang about this crazy town,\nThe words just came on out, as the folks all gathered 'round.\nThen I sang 'bout hardship, and that guitar from the trash,\nFelt the whole world listen, saw the tears begin to splash.\nShay was lookin' prouder than I'd ever seen her look,\nLike she knew these city folks would read me like a book.\n(Chorus)\nNow they say I'm goin' viral, whatever that might mean,\nLittle screens all lit up, the craziest damn thing I've seen.\nSingin' 'bout sad porridge and Harold in his Sunday best,\nJust a red dirt drifter puttin' feelings to the test,\nOut here in this LA sun, ain't like no place I know,\nWonderin' how a whisper turned into a picture show.\n(Bridge)\nAin't never chased no spotlight, ain't my kind of game,\nJust sing my truth out quiet, whisper Shay Bear's name.\nBut if my rusty-string stories, 'bout the hurt and hope I've known,\nCan make a stranger out there feel a little less alone...\nWell, maybe there's a reason this wild seed was sown.\n(Chorus)\nNow they say I'm goin' viral, whatever that might mean,\nLittle screens all lit up, the craziest damn thing I've seen.\nSingin' 'bout sad porridge and Harold in his Sunday best,\nJust a red dirt drifter puttin' feelings to the test,\nOut here in this LA sun, ain't like no place I know,\nWonderin' how a whisper turned into a picture show.\n(Outro)\nYeah, a picture show... full of folks I've never met.\nStill don't get this \"viral,\" ain't quite figured it out yet.\nJust got my girl, my guitar... and I guess Harold the goat.\n(Guitar fades out with a soft, questioning strum)",
      "suggested_venues": [
        "coffee_shop",
        "festival",
        "house_concert",
        "listening_room"
      ]
    },
    "through_the_silence": {
      "title": "Through the Silence",
      "status": "private",
      "lyrics": "Verse 1:\nBorn in the shadow of a rusted cage,\nCoal dust scars and a heart’s old rage.\nWords stayed locked where the hurt runs deep,\nWhispers in the dark were mine to keep.\nChorus:\nYou gotta walk through silence to sing the truth,\nFeel the ache in your bones, let it carve your youth.\nEvery scar’s a note, every wound’s a song,\nThrough the silence, I found where I belong.\nVerse 2:\nNights on the mountain, just me and the wind,\nStrummed my pain where the pines don’t end.\nEach string I broke was a chain let go,\nTruth came alive where the quiet grows.\nChorus:\nYou gotta walk through silence to sing the truth,\nFeel the ache in your bones, let it carve your youth.\nEvery scar’s a note, every wound’s a song,\nThrough the silence, I found where I belong.\nBridge:\nNo crowd, no stage, just a heart laid bare,\nSang to the stars ‘cause they always cared.\nThe hurt runs deep, but the truth runs free,\nSilence taught the song that’s savin’ me.\nChorus:\nYou gotta walk through silence to sing the truth,\nFeel the ache in your bones, let it carve your youth.\nEvery scar’s a note, every wound’s a song,\nThrough the silence, I found where I belong.\nOutro:\nNow I sing my truth, let the echoes fly,\nBorn in the silence ‘neath a Kentucky sky.\nYou gotta walk through silence, let it break you loose,\nTo find the song that’s livin’ in your truth.",
      "suggested_venues": [
        "amphitheater",
        "coffee_shop",
        "house_concert",
        "listening_room",
        "outdoor_venue",
        "small_theater"
      ]
    },
    "keep_singin_on": {
      "title": "Keep Singin’ On",
      "status": "private",
      "lyrics": "Verse 1:\nCame to this town with a song in my heart,\nVoice full of dreams, but the world’s played hard.\nWaitin’ on tables, sweepin’ floors till dawn,\nHoldin’ to hope when the money’s all gone.\nChorus:\nKeep singin’ on, let the truth ring true,\nEvery note’s a fight for the life I pursue.\nThrough the ache and the doubt, I’ll still raise my song,\nHeart’s still burnin’, so I keep singin’ on.\nVerse 2:\nMama’s voice echoes, said I’d shine someday,\nBut she’s gone to glory, and I’m still findin’ my way.\nThis old guitar’s my only friend some nights,\nSingin’ to shadows, chasin’ stage lights.\nChorus:\nKeep singin’ on, let the truth ring true,\nEvery note’s a fight for the life I pursue.\nThrough the ache and the doubt, I’ll still raise my song,\nHeart’s still burnin’, so I keep singin’ on.\nBridge:\nBills stack high, and the dreams wear thin,\nBut my soul’s got a fire that won’t give in.\nEvery scar’s a story, every tear’s a call,\nI’ll sing through the silence till I’ve given it all.\nChorus:\nKeep singin’ on, let the truth ring true,\nEvery note’s a fight for the life I pursue.\nThrough the ache and the doubt, I’ll still raise my song,\nHeart’s still burnin’, so I keep singin’ on.\nOutro:\nSo here’s my voice, let it carry me home,\nThrough empty rooms where my dreams still roam.\nNo matter how heavy, I’ll carry this dawn,\nWith love in my heart, I keep singin’ on.",
      "suggested_venues": [
        "coffee_shop",
        "house_concert",
        "listening_room"
      ]
    },
    "through_the_silence_2": {
      "title": "Through the Silence",
      "status": "private",
      "lyrics": "Verse 1:\nBorn in the shadow of a rusted cage,\nCoal dust scars and a heart’s old rage.\nWords stayed locked where the hurt runs deep,\nWhispers in the dark were mine to keep.\nChorus:\nYou gotta walk through silence to sing the truth,\nFeel the ache in your bones, let it carve your youth.\nEvery scar’s a note, every wound’s a song,\nThrough the silence, I found where I belong.\nVerse 2:\nNights on the mountain, just me and the wind,\nStrummed my pain where the pines don’t end.\nEach string I broke was a chain let go,\nTruth came alive where the quiet grows.\nChorus:\nYou gotta walk through silence to sing the truth,\nFeel the ache in your bones, let it carve your youth.\nEvery scar’s a note, every wound’s a song,\nThrough the silence, I found where I belong.\nBridge:\nNo crowd, no stage, just a heart laid bare,\nSang to the stars ‘cause they always cared.\nThe hurt runs deep, but the truth runs free,\nSilence taught the song that’s savin’ me.\nChorus:\nYou gotta walk through silence to sing the truth,\nFeel the ache in your bones, let it carve your youth.\nEvery scar’s a note, every wound’s a song,\nThrough the silence, I found where I belong.\nOutro:\nNow I sing my truth, let the echoes fly,\nBorn in the silence ‘neath a Kentucky sky.\nYou gotta walk through silence, let it break you loose,\nTo find the song that’s livin’ in your truth.",
      "suggested_venues": [
        "amphitheater",
        "coffee_shop",
        "listening_room",
        "outdoor_venue",
        "small_theater"
      ]
    },
    "coal_dust_on_the_lamb": {
      "title": "Coal Dust on the Lamb",
      "status": "private",
      "lyrics": "(Verse 1)\nSixteen summers bleedin' into fall,\nDaddy's shadow stretched across the wall.\nHis words like whiskey, burnin' down my throat,\nKicked me out to wander, wearin' a thin coat.\nPikeville hollers echoed with my shame,\nInnocence a flicker, dyin' in the flame.\n\n(Verse 2)\nFound a floor to sleep on, kindness in a stranger's eye,\nBut the mountain cold seeped in, beneath a starless sky.\nTraded school books for a pick and shovel's weight,\nCoal dust settled on my dreams, sealin' up their fate.\nThis broken arm, a constant ache, a twisted memory,\nOf a boy who used to dream beneath a dogwood tree.\n\n(Chorus)\nCoal dust on the lamb, a stain that won't come clean,\nLost my way back home, a forgotten, faded scene.\nThese coal-stained hands, they hold the weight of sin,\nPrayin' for redemption, hopin' God lets me in.\n\n(Verse 3)\nSunrise paints the mountain ridge, a fiery, bloody hue,\nAnother day of breakin' back, another debt to accrue.\nThe fields stretch out before me, endless rows of green,\nBut all I see is darkness, a fractured, broken scene.\nThis ain't the life I pictured,  beneath the mountain's gaze,\nJust a broken boy, lost in a lonely, hazy maze.\n\n(Bridge)\nMama's hymnals echo, a whisper in the wind,\nA memory of comfort, a peace I can't pretend.\nWill I ever feel that grace again, that gentle, lovin' hand?\nOr am I destined to wander, a ghost in this promised land?\n\n(Chorus)\nCoal dust on the lamb, a stain that won't come clean,\nLost my way back home, a forgotten, faded scene.\nThese coal-stained hands, they hold the weight of sin,\nPrayin' for redemption, hopin' God lets me in.\n\n(Outro)\nLord, have mercy, on this coal-stained soul,\nLead me back to the fold, make me whole. \nMake me whole.",
      "suggested_venues": [
        "amphitheater",
        "coffee_shop",
        "dive_bar",
        "honky_tonk",
        "house_concert",
        "listening_room",
        "outdoor_venue",
        "roadhouse",
        "small_theater"
      ]
    },
    "roots_torn_slow": {
      "title": "Roots Torn Slow",
      "status": "private",
      "lyrics": "Some folks leave like a gust through the pines,\nFast and loud, gone before the night’s decline.\nBut you left like roots ripped from the ground,\nSlow and breakin’, didn’t make a sound.\nI stood there watchin’, my heart in my hands,\nPieces of me scattered ‘cross this lonesome land.\n(Pre-Chorus)\nEvery step feels like I’m circlin’ a scar,\nA hollow where you were, where you tore me apart.\n(Chorus)\nRoots torn slow, they don’t just fade away,\nThey leave a hole that haunts me every day.\nI walk like I’m growin’ ‘round the pain,\nPlantin’ flowers in the dirt where you remained.\nThey bloom deeper, they know what I’ve lost,\nThey choose sunlight, no matter the cost.\n(Verse 2)\nI used to think love was a fire that burned,\nBut yours was a weight, a lesson I learned.\nEach crack in my soul, it taught me to fight,\nTo find my own spark in the cold, endless night.\nNow I’m sowin’ seeds where the shadows still creep,\nBuildin’ a garden from the hurt runnin’ deep.\n(Pre-Chorus)\nEvery bloom’s a battle, every petal’s a prayer,\nProof I’m still standin’, though you ain’t there.\n(Chorus)\nRoots torn slow, they don’t just fade away,\nThey leave a hole that haunts me every day.\nI walk like I’m growin’ ‘round the pain,\nPlantin’ flowers in the dirt where you remained.\nThey bloom deeper, they know what I’ve lost,\nThey choose sunlight, no matter the cost.\n(Bridge)\nI ain’t the girl you left in the dust,\nMy heart’s got thorns now, forged from the rust.\nBut these hands still dig, they still reach for the sky,\nTurnin’ tears into roses that won’t ever die.\nYour leavin’ broke me, but it made me whole,\nI found my roots in this stubborn soul.\n(Chorus)\nRoots torn slow, they don’t just fade away,\nThey leave a hole that haunts me every day.\nI walk like I’m growin’ ‘round the pain,\nPlantin’ flowers in the dirt where you remained.\nThey bloom deeper, they know what I’ve lost,\nThey choose sunlight, no matter the cost.\n(Outro)\nSome leave like wind, but you left like stone,\nTore out my roots, but I’m growin’ my own.\nThese flowers I plant, they’re my heart’s quiet vow,\nThey bloom deeper… and I’m stronger now.",
      "suggested_venues": [
        "amphitheater",
        "outdoor_venue"
      ]
    },
    "keep_singing_on": {
      "title": "Keep Singing On",
      "status": "private",
      "lyrics": "Verse 1:\nCame to this town with a song in my heart,\nVoice full of dreams, but the world’s played hard.\nWaitin’ on tables, sweepin’ floors till dawn,\nHoldin’ to hope when the money’s all gone.\n\nChorus:\nKeep singin’ on, let the truth ring true,\nEvery note’s a fight for the life I pursue.\nThrough the ache and the doubt, I’ll still raise my song,\nHeart’s still burnin’, so I keep singin’ on.\n\nVerse 2:\nMama’s voice echoes, said I’d shine someday,\nBut she’s gone to glory, and I’m still findin’ my way.\nThis old guitar’s my only friend some nights,\nSingin’ to shadows, chasin’ stage lights.\n\nChorus:\nKeep singin’ on, let the truth ring true,\nEvery note’s a fight for the life I pursue.\nThrough the ache and the doubt, I’ll still raise my song,\nHeart’s still burnin’, so I keep singin’ on.\n\nBridge:\nBills stack high, and the dreams wear thin,\nBut my soul’s got a fire that won’t give in.\nEvery scar’s a story, every tear’s a call,\nI’ll sing through the silence till I’ve given it all.\n\nChorus:\nKeep singin’ on, let the truth ring true,\nEvery note’s a fight for the life I pursue.\nThrough the ache and the doubt, I’ll still raise my song,\nHeart’s still burnin’, so I keep singin’ on.\n\nOutro:\nSo here’s my voice, let it carry me home,\nThrough empty rooms where my dreams still roam.\nNo matter how heavy, I’ll carry this dawn,\nWith love in my heart, I keep singin’ on.",
      "suggested_venues": [
        "coffee_shop",
        "house_concert",
        "listening_room"
      ]
    },
    "gimme_that_black_brew": {
      "title": "Gimme That Black Brew",
      "status": "private",
      "lyrics": "Gimme That Black Brew\n\n**Verse 1**  \nWalked into a shop, thought I’d get a cup,  \nBut they’re pushin’ green tea dust, and I’m all fed up.  \nMatcha this, oat milk that, five bucks for a sip,  \nTastes like lawn clippings, burns a hole in my grip.  \n\n**Chorus**  \nGimme that black brew, punch me as it goes down!  \nStrong like a mule kick, wake this small-town clown!  \nNo fads, no frills, just coffee dark and true,  \nGimme that black brew, that’s what’ll get me through!  \n\n**Verse 2**  \nBarista’s talkin’ foam art, syrups by the score,  \nI just want a jolt, not a fancy pour.  \nOat milk’s got no nipples, that ain’t no cow’s delight,  \nNeed a brew to shake me, keep me workin’ till the night.  \n\n**Chorus**  \nGimme that black brew, punch me as it goes down!  \nStrong like a mule kick, wake this small-town clown!  \nNo fads, no frills, just coffee dark and true,  \nGimme that black brew, that’s what’ll get me through!  \n\n**Bridge**  \nRaise a mug to the grind, to the simple and plain,  \nNo hipster nonsense cloggin’ up my brain!  \nJust boil it thick, let it scald my soul,  \nBlack brew’s the fire that makes me whole!  \n\n**Chorus**  \nGimme that black brew, punch me as it goes down!  \nStrong like a mule kick, wake this small-town clown!  \nNo fads, no frills, just coffee dark and true,  \nGimme that black brew, that’s what’ll get me through!  \n\n**Outro**  \n(Claps, hollers, banjo twang)  \nGimme that black brew, none of that LA fake,  \nPour it strong, keep me wide awake!",
      "suggested_venues": [
        "bar_setting",
        "festival",
        "honky_tonk",
        "roadhouse"
      ]
    },
    "miles_of_sorrow": {
      "title": "Miles of Sorrow",
      "status": "private",
      "lyrics": "(Verse 1)\nSunrise paints the cotton fields, another day begins\nBut the light don't shine so bright, since your love went on the winds\nWe built a life on promises, beneath a Georgia moon\nBut your city dreams called louder, than my love could ever croon\n(Chorus)\nMiles of sorrow stretch between us, a highway paved with tears\nEach mile a memory fading, swallowed by the passing years\nWe said forever, honey, but forever couldn't hold\nAgainst the pull of distance, a story left untold\n(Verse 2)\nRemember dancin' in the hayloft, beneath the summer stars?\nYour laughter like a mockingbird, escaping rusty bars\nWe swore our love was stronger, than any earthly pain\nBut the miles kept piling higher, a relentless, driving rain\n(Chorus)\nMiles of sorrow stretch between us, a highway paved with tears\nEach mile a memory fading, swallowed by the passing years\nWe said forever, honey, but forever couldn't hold\nAgainst the pull of distance, a story left untold\n(Bridge)\nI see your face in every sunset, hear your voice in every breeze\nBut the silence in this farmhouse, just echoes my unease\nI shoulda held you tighter, darling, shoulda fought with all my might\nBut the distance won the battle, and stole away my light\n(Chorus)\nMiles of sorrow stretch between us, a highway paved with tears\nEach mile a memory fading, swallowed by the passing years\nWe said forever, honey, but forever couldn't hold\nAgainst the pull of distance, a story left untold\n(Outro)\nMiles of sorrow… miles and miles of sorrow…",
      "suggested_venues": [
        "coffee_shop",
        "honky_tonk",
        "listening_room",
        "small_theater"
      ]
    },
    "friday_night_lights_in_honky_tonk_heaven": {
      "title": "Friday Night Lights in Honky Tonk Heaven",
      "status": "private",
      "lyrics": "(Verse 1)\nSun sinkin' low, week's work is done\nDust off my boots, time for some fun\nGot my guitar, worn and well-loved\nReady to sing 'bout the heart I've been robbed\n(Chorus)\nFriday night lights in Honky Tonk Heaven, yeah\nWhiskey's flowin', music's playin' clear\nBroken hearts mendin', laughter ringin' true\nUnderneath the neon glow, me and you\n(Verse 2)\nSaw ol' Jimmy Joe, lookin' kinda blue\nLost his woman, don't know what to do\nBut tonight's for forgettin', leavin' troubles behind\nLet the music wash over, ease his weary mind\n(Chorus)\nFriday night lights in Honky Tonk Heaven, yeah\nWhiskey's flowin', music's playin' clear\nBroken hearts mendin', laughter ringin' true\nUnderneath the neon glow, me and you\n(Bridge)\nThis ain't no church, but souls find grace here\nIn the twangin' guitars and the clinking of beer\nWe share our stories, our joys and our pain\nFindin' solace 'til the sun shines again\n(Chorus)\nFriday night lights in Honky Tonk Heaven, yeah\nWhiskey's flowin', music's playin' clear\nBroken hearts mendin', laughter ringin' true\nUnderneath the neon glow, me and you\n(Outro)\nYeah, Friday night lights, burnin' bright and bold\nAnother story in this Honky Tonk's been told",
      "suggested_venues": [
        "dive_bar",
        "honky_tonk",
        "roadhouse"
      ]
    },
    "taco_town": {
      "title": "Taco Town",
      "status": "private",
      "lyrics": "Verse 1\nRolled into town with a hunger to tame,\nSaw a food truck sign, didn’t know the name.\n“Taaah-cooows,” I drawled, with a puzzled grin,\nSomethin’ new was callin’, let the feast begin!\n\nChorus\nIt’s taco time, y’all, grab a messy bite!\nCorn and meat, so cheap, lightin’ up the night!\nSpicy kick, hands slick, lovin’ every thrill,\nTaco time, givin’ my heart a fill!\n\nVerse 2\nBit that tortilla, flavors burstin’ free,\nJuice down my chin, felt like heaven to me.\nOnions, cilantro, a little hot sting,\nThis workin’ man’s food makes my soul wanna sing.\n\nChorus\nIt’s taco time, y’all, grab a messy bite!\nCorn and meat, so cheap, lightin’ up the night!\nSpicy kick, hands slick, lovin’ every thrill,\nTaco time, givin’ my heart a fill!\n\nBridge\nPass the salsa, let the good times roll,\nEvery bite’s a fire warmin’ up my soul!\nFrom a stranger’s plate to a lover’s smile,\nTacos bring us closer, country style!\n\nChorus\nIt’s taco time, y’all, grab a messy bite!\nCorn and meat, so cheap, lightin’ up the night!\nSpicy kick, hands slick, lovin’ every thrill,\nTaco time, givin’ my heart a fill!\n\nOutro\n(Claps, hollers, banjo twang)\nTaco time, yeah, it’s my new jam,\nFrom a small-town boy to a taco man!",
      "suggested_venues": [
        "festival",
        "honky_tonk",
        "house_concert",
        "outdoor_venue",
        "roadhouse"
      ]
    }
  }
}