{
  "song_id": "backroad_heart",
  "title": "Backroad Heart",
  "status": "private",
  "lyrics": "(Verse 1)\nOut on County Road 9, where the gravel kicks dust,\nWe carved our initials in an oak, swore we’d never rust.\nYour taillights faded, left me standin’ in the rain,\nNow I’m chasin’ your memory, down a lonesome lane.\n(Pre-Chorus)\nThis old truck’s still runnin’, but it’s fallin’ apart,\nJust like me, it’s haulin’ this backroad heart.\n(Chorus)\nI’ve got a backroad heart, beat-up but true,\nBurnin’ like a bonfire, still in love with you.\nThrough the mud and the miles, I’m holdin’ on tight,\nA backroad heart keeps rollin’ through the long, dark night.\n(Verse 2)\nThe radio’s playin’ that song you used to sing,\nAbout a small-town dreamer, chasin’ bigger things.\nI pass your mama’s porch light, it’s glowin’ soft and low,\nWish I could turn back time, to nights we used to know.\n(Pre-Chorus)\nThis flannel’s worn thin, but I wear it with pride,\nLike this backroad heart, still fightin’ for the ride.\n(Chorus)\nI’ve got a backroad heart, beat-up but true,\nBurnin’ like a bonfire, still in love with you.\nThrough the mud and the miles, I’m holdin’ on tight,\nA backroad heart keeps rollin’ through the long, dark night.\n(Bridge)\nEvery cornfield sunrise, every starlit prayer,\nI see your face in the distance, like you’re still right there.\nI ain’t the kind to give up, I was raised to stand tall,\nThis backroad heart’s still beatin’, through the rise and fall.\n(Chorus)\nI’ve got a backroad heart, beat-up but true,\nBurnin’ like a bonfire, still in love with you.\nThrough the mud and the miles, I’m holdin’ on tight,\nA backroad heart keeps rollin’ through the long, dark night.\n(Outro)\nSo I’ll drive these old backroads, till the pain departs,\nCarrying the weight of this lonesome, backroad heart.\nYeah, this backroad heart… keeps rollin’ on.\nAcoustic sound: Strong, steady acoustic guitar strum and simple, heartfelt vocals that emphasize the story's raw emotion. A gentle pedal steel or subtle fiddle melody weaves in and out, adding a layer of wistful nostalgia.",
  "themes": [
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "nostalgia",
    "partying_celebration",
    "resilience_survival"
  ],
  "suggested_venues": [
    "amphitheater",
    "outdoor_venue"
  ],
  "sounds_like_acoustic": "",
  "sounds_like_recording": "",
  "notes": ""
}