{
  "song_id": "be_better_for_the_next_guy",
  "title": "Be Better for the Next Guy",
  "status": "private",
  "lyrics": "Verse 1\nI’m three whiskeys deep, flingin’ darts at the back wall,\nLaughin’ at your name etched on my shot glass.\nNo more lonely nights curled up by the telephone—\nI’ve found new roads past the diner where we fought.\nChorus\nSo here’s to you, sweeter than cherry pie—\nHope he buys those roses you let wither and die.\nWhen he’s pourin’ out his heart baby-blue, don’t make him cry—\nBe better for the next guy.\nVerse 2\nI’ll catch her eye across the bar when the jukebox spins our song,\nShe’ll think you’re heaven ’til your lies come undone.\nI’ll lift her up with shots of bourbon ’til she’s singin’ along,\nWhile you learn too late how to love someone.\nChorus (variation)\nSo here’s to you, spicier than a jalapeño—\nHope he feels the jagged scars you left on my chest.\nWhen he’s pouring out his soul, don’t put it to the test—\nBe better for the next guy.\nVerse 3\nSaw you last weekend at the state fair midway,\nYour eyes lit up just like they did back then.\nHe wore that nervous grin I know all too well—\nYou led him ’round like he was your only friend.\nOne prayer for that poor boy’s all I’ve got to give—\nMay you hold his hand tighter than you ever held mine.\nBridge\nAnd if he wakes up cold in your empty bed,\nOr finds your lipstick stains on someone else instead,\nTell him to head back to this Tennessee roadhouse—\nWhere broken hearts learn how to lose and forget.\nFinal Chorus\nSo here’s to you, sweeter than a Georgia peach—\nDon’t leave him sobbin’ under that big open sky.\nWhen he’s layin’ down his love, make sure you don’t lie—\nBe better for the next guy.",
  "themes": [
    "abuse_trauma",
    "bar_setting",
    "heartbreak_loss",
    "hometown_roots",
    "love_romance",
    "music_songwriting"
  ],
  "suggested_venues": [
    "coffee_shop",
    "dive_bar",
    "honky_tonk",
    "listening_room",
    "roadhouse",
    "small_theater"
  ],
  "sounds_like_acoustic": "Stripped-down, raw acoustic performance with a focus on vocals, acoustic guitar, and light percussion.  The feel is intimate and slightly melancholic, with a touch of defiance.",
  "sounds_like_recording": "Modern country production with polished vocals, electric and acoustic guitars, bass, drums, and possibly some pedal steel or banjo.  The overall style is upbeat and driving, with a strong rhythmic foundation and a radio-friendly sheen.",
  "notes": "The singer, scarred by a manipulative ex-lover, finds catharsis in a dimly lit roadhouse.  He's moved on, found new paths, but the bitterness lingers, fueled by whiskey and the sight of his ex repeating her toxic patterns with a new, unsuspecting victim.  He recognizes the familiar signs of her charm and control, pitying the new boyfriend while simultaneously hoping she's finally learned from her past mistakes. The roadhouse becomes a sanctuary for the brokenhearted, a place where they can commiserate and find solace, understanding the painful cycle of love and loss.  The song is a toast, not of malice, but of weary resignation, a plea for growth disguised as a sarcastic blessing."
}