{
  "song_id": "blackberry_creek_blues",
  "title": "Blackberry Creek Blues",
  "status": "private",
  "lyrics": "Title: Blackberry Creek Blues\n(Verse 1)\nSun bleeds orange through the pines, 'nother day done broke\nDown Blackberry Creek Road, where the silence only spoke\nOf broken promises and ghosts that linger in the air\nDaddy's shadow on the porch, a weight I couldn't bear.\nSixteen years and a busted arm, a guitar and a suitcase old\nWalked away from that hollow, a story yet untold.\n(Chorus)\nBlackberry Creek Blues, singin' in my soul\nA melody of hardship, a story to unfold\nOf coal dust and callouses, a heart both tough and worn\nBlackberry Creek Blues, the day that I was born.\n(Verse 2)\nFound a shack down by the river, traded work for bed\nPickin' beans and diggin' coal, a roof above my head\nThis rusted six-string sings my sorrow, sings my pain\nA broken boy from broken mountains, singin' in the rain.\nAin't lookin' for no pity, ain't lookin' for no fame\nJust tryin' to find my own damn rhythm in this life's hard game.\n(Bridge)\nMama used to hum a hymn, a whisper in the dark\nSaid, \"Boy, find your own damn light, leave your own damn mark.\"\nHer words echo in the hollers, a comfort and a guide\nAs I wrestle with the demons that I keep locked inside.\n(Chorus)\nBlackberry Creek Blues, singin' in my soul\nA melody of hardship, a story to unfold\nOf coal dust and callouses, a heart both tough and worn\nBlackberry Creek Blues, the day that I was born.\n(Outro)\nYeah, Blackberry Creek Blues, they run deep and strong\nLike the roots of these old mountains, where I belong.\nWhere I belong.",
  "themes": [
    "abuse_trauma",
    "family",
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "music_songwriting",
    "nature_outdoors",
    "resilience_survival",
    "working_class_labor"
  ],
  "suggested_venues": [
    "amphitheater",
    "outdoor_venue"
  ],
  "sounds_like_acoustic": "",
  "sounds_like_recording": "",
  "notes": ""
}