{
  "song_id": "born_in_hell",
  "title": "Born in Hell",
  "status": "private",
  "lyrics": "Verse 1\nCoal dust in my lungs, blood on the floor,\nDad’s fists kept time with the slam of the door.\nBorn in a town where the devil holds sway,\nI learned to take hits ‘fore I learned how to pray.\nPre-Chorus\nNo mercy in his eyes, no warmth in that house,\nJust a boy dodgin’ shadows, quiet as a mouse.\nChorus\nBorn in hell, where the sun don’t shine,\nTook my beatings daily, paid for his cheap wine.\nKicked out at sixteen, worked the mines to survive,\nIn the dark of that town, I kept my soul alive.\nVerse 2\nSchool by day, mines by night, no time to dream,\nRented a room with walls thin as a scream.\nSweat and black soot, my hands turned to stone,\nCarried my books and my scars all alone.\nPre-Chorus\nNo mother to hold me, no father to care,\nJust the weight of the world and the cold mountain air.\nChorus\nBorn in hell, where the sun don’t shine,\nTook my beatings daily, paid for his cheap wine.\nKicked out at sixteen, worked the mines to survive,\nIn the dark of that town, I kept my soul alive.\nBridge\nEvery bruise was a map of the hell I called home,\nEvery shift in the dark taught me how to roam.\nI wasn’t born to break, though they tried to bend,\nFound a spark in my heart that no devil could end.\nChorus\nBorn in hell, where the sun don’t shine,\nTook my beatings daily, paid for his cheap wine.\nKicked out at sixteen, worked the mines to survive,\nIn the dark of that town, I kept my soul alive.\nOutro\n*(Slow picking: E|-3---3---|)*\nBorn in hell… but I’m still breathin’",
  "themes": [
    "abuse_trauma",
    "bar_setting",
    "family",
    "faith_spirituality",
    "freedom_wandering",
    "hometown_roots",
    "nature_outdoors",
    "rebellion_outlaw",
    "resilience_survival",
    "working_class_labor"
  ],
  "suggested_venues": [
    "arena",
    "coffee_shop",
    "dive_bar",
    "honky_tonk",
    "house_concert",
    "listening_room",
    "roadhouse",
    "stadium"
  ],
  "sounds_like_acoustic": "Raw and intimate with a fingerpicked acoustic guitar, mournful harmonica, and gravelly vocals, conveying a sense of weary resilience.",
  "sounds_like_recording": "A driving, blues-rock anthem with distorted electric guitars, heavy drums, and soaring, impassioned vocals, creating a dark and powerful atmosphere.",
  "notes": ""
}