{
  "song_id": "church_of_country",
  "title": "Church of Country",
  "status": "private",
  "lyrics": "Verse 1\nI hit the stage on red dirt, where the heartland’s callin’ me,\nFrom dive bar smoke to stadiums, this is where I’m free.\nHank’s ghost in my guitar, Dolly’s shine in my soul,\nCountry’s fire in my bones, it’s the only life I know.\n\nPre-Chorus\nSteel guitars are my pulpit, banjo’s my battle cry,\nEvery scar’s a song I sing, reachin’ for the sky.\n\nChorus\nThis is the Church of Country, where the faithful raise a spark,\nJohnny’s growl, Shania’s strut, lightin’ up the dark.\nSing for Patsy, for Stapleton, let the fiddle break the chains,\nCountry’s pulse is beatin’ loud, runnin’ wild in our veins!\n\nVerse 2\nI’m singin’ Loretta’s truth, Willie’s ramblin’ road,\nGeorge Jones’ whiskey heartache, carryin’ the load.\nFrom Waylon’s outlaw thunder to Miranda’s rebel flame,\nEvery note’s my hallelujah, country’s my true name.\n\nPre-Chorus\nBoots stomp the rhythm, my voice’ll shake the ground,\nIn this Church of Country, salvation’s what I’ve found.\n\nChorus\nThis is the Church of Country, where the faithful raise a spark,\nJohnny’s growl, Shania’s strut, lightin’ up the dark.\nSing for Patsy, for Stapleton, let the fiddle break the chains,\nCountry’s pulse is beatin’ loud, runnin’ wild in our veins!\n\nBridge\nIt’s a honky-tonk redemption, where the broken find their fight,\nCash’s truth, Kacey’s grace, guidin’ me through the night.\nFrom backroad hymns to neon dreams, I’ll carry on the sound,\nCountry’s heart is mine to hold, forever glory-bound!\n\nFinal Chorus\nThis is the Church of Country, where the roots will never fade,\nLoretta’s coal dust soul, Alan’s river escapade.\nRaise a glass for every dreamer, let the banjo’s fire roar,\nCountry’s callin’ me to sing, now and evermore!\n\nOutro\n*(Fiddle tears the roof off, steel guitar screams)*\nChurch of Country, hear my voice, let the whole world know,\nThis is my salvation, where my rebel heart’ll go!\n*(Pyro pops, crowd roars)*\nHallelujah, country soul, Alex takes the show!",
  "themes": [
    "abuse_trauma",
    "bar_setting",
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "music_songwriting",
    "nature_outdoors",
    "partying_celebration",
    "rebellion_outlaw",
    "resilience_survival",
    "working_class_labor"
  ],
  "suggested_venues": [
    "arena",
    "church",
    "coffee_shop",
    "dive_bar",
    "festival",
    "honky_tonk",
    "house_concert",
    "listening_room",
    "revival",
    "roadhouse",
    "stadium"
  ],
  "sounds_like_acoustic": "A stripped-down, intimate performance with acoustic guitar, banjo, fiddle, and soulful vocals, emphasizing the raw emotion and storytelling of the lyrics.",
  "sounds_like_recording": "A powerful, anthemic country-rock production with driving drums, soaring electric guitars, layered harmonies, prominent fiddle and steel guitar, and a dynamic vocal performance capturing the energy of a live show.",
  "notes": ""
}