{
  "song_id": "coal_dust_on_the_lamb",
  "title": "Coal Dust on the Lamb",
  "status": "private",
  "lyrics": "(Verse 1)\nSixteen summers bleedin' into fall,\nDaddy's shadow stretched across the wall.\nHis words like whiskey, burnin' down my throat,\nKicked me out to wander, wearin' a thin coat.\nPikeville hollers echoed with my shame,\nInnocence a flicker, dyin' in the flame.\n\n(Verse 2)\nFound a floor to sleep on, kindness in a stranger's eye,\nBut the mountain cold seeped in, beneath a starless sky.\nTraded school books for a pick and shovel's weight,\nCoal dust settled on my dreams, sealin' up their fate.\nThis broken arm, a constant ache, a twisted memory,\nOf a boy who used to dream beneath a dogwood tree.\n\n(Chorus)\nCoal dust on the lamb, a stain that won't come clean,\nLost my way back home, a forgotten, faded scene.\nThese coal-stained hands, they hold the weight of sin,\nPrayin' for redemption, hopin' God lets me in.\n\n(Verse 3)\nSunrise paints the mountain ridge, a fiery, bloody hue,\nAnother day of breakin' back, another debt to accrue.\nThe fields stretch out before me, endless rows of green,\nBut all I see is darkness, a fractured, broken scene.\nThis ain't the life I pictured,  beneath the mountain's gaze,\nJust a broken boy, lost in a lonely, hazy maze.\n\n(Bridge)\nMama's hymnals echo, a whisper in the wind,\nA memory of comfort, a peace I can't pretend.\nWill I ever feel that grace again, that gentle, lovin' hand?\nOr am I destined to wander, a ghost in this promised land?\n\n(Chorus)\nCoal dust on the lamb, a stain that won't come clean,\nLost my way back home, a forgotten, faded scene.\nThese coal-stained hands, they hold the weight of sin,\nPrayin' for redemption, hopin' God lets me in.\n\n(Outro)\nLord, have mercy, on this coal-stained soul,\nLead me back to the fold, make me whole. \nMake me whole.",
  "themes": [
    "abuse_trauma",
    "bar_setting",
    "family",
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "nostalgia",
    "rebellion_outlaw",
    "working_class_labor"
  ],
  "suggested_venues": [
    "amphitheater",
    "coffee_shop",
    "dive_bar",
    "honky_tonk",
    "house_concert",
    "listening_room",
    "outdoor_venue",
    "roadhouse",
    "small_theater"
  ],
  "sounds_like_acoustic": "Opening with fingerpicked acoustic guitar and sparse banjo, the song weaves in subtle brushed drums, Layered harmonies build a haunting folk-rock atmosphere, while occasional pedal steel and gentle bass deepen the soundscape, The arrangement remains spacious, evoking lingering tension",
  "sounds_like_recording": "",
  "notes": ""
}