{
  "song_id": "country_city_girl",
  "title": "Country City Girl",
  "status": "private",
  "lyrics": "(Verse 1)\nLeft the dirt roads in the dust, for streets all shiny bright,\nSwapped the quiet starry evenings for the buzz of city nights.\nPacked her dreams up in a suitcase, and her mama's good advice,\nSaid, \"I'm gonna make it out there, gonna roll them city dice!\"\n\n(Chorus)\nShe's got that hometown heart in the big city glow,\nLearnin' new tricks, watchin' her confidence grow!\nSame sweet girl, with a brand new shine,\nThat country-city girl, and she's all mine! (Yeah, she's all mine!)\n\n(Verse 2)\nStill knows how to bake a pie that’ll make you ask for more,\nNow she’s charmin' all the big shots, knockin' right on fortune's door.\nTakes that good ol' country common sense, gives it a big city spin,\nMakes 'em wonder how a country girl just always seems to win!\n\n(Chorus)\nShe's got that hometown heart in the big city glow,\nLearnin' new tricks, watchin' her confidence grow!\nSame sweet girl, with a brand new shine,\nThat country-city girl, and she's all mine! (Yeah, she's all mine!)\n\n(Guitar/Fiddle Solo – Simple, catchy, and upbeat. Easy to hum along to.)\n\n(Bridge)\nThose city lights can't hide her smile, I see it in my mind,\nShe's the best of both them places, truly one of a special kind.\nAnd I’m prouder than a rooster, crowin' loud at break of day,\nMy country girl's a-takin' on the world, and lightin' up the way!\n\n(Chorus)\nShe's got that hometown heart in the big city glow,\nLearnin' new tricks, watchin' her confidence grow!\nSame sweet girl, with a brand new shine,\nThat country-city girl, and she's all mine! (Yeah, she's all mine!)\n\n(Outro)\nIn the big city glow!\nWatch her go, go, go!\nThat country-city girl o' mine!",
  "themes": [
    "family",
    "freedom_wandering",
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "resilience_survival"
  ],
  "suggested_venues": [],
  "sounds_like_acoustic": "Upbeat, energetic country intro - bright acoustic guitar, driving rhythm, maybe a touch of mandolin or lively fiddle",
  "sounds_like_recording": "",
  "notes": ""
}