{
  "song_id": "diner_life",
  "title": "Diner Life",
  "status": "private",
  "lyrics": "Verse 1\nMae’s Diner glows on a lonesome street, neon hummin’ low,\nI was nine, pockets full of change, nowhere else to go.\nBiscuits warm as a mother’s love, gravy thick with heart,\nFound a home in that vinyl booth, when my world fell apart.\nPre-Chorus\nCoffee stains and checkered floors, where the broke could rest,\nMae’s smile stitched my shattered soul, gave my heart a nest.\nChorus\nDiner life, where the jukebox wails of heartache and dreams,\nTruckers, drifters, lost souls mendin’ seams.\nIn the clink of forks, the hum of late-night fights,\nMae’s Diner held me close, through the long, hard nights.\nVerse 2\nWaitress knew my name, slipped me extra fries,\nSaw my hurt fade slow, never pried ‘bout my eyes.\nCounter held my scribbled hopes, dreams scratched in ink,\nFrom a kid with nothin’ to a man who learned to think.\nPre-Chorus\nGrease and grace on every plate, where the weary heal,\nMae’s was more than food—it’s where I learned to feel.\nChorus\nDiner life, where the jukebox wails of heartache and dreams,\nTruckers, drifters, lost souls mendin’ seams.\nIn the clink of forks, the hum of late-night fights,\nMae’s Diner held me close, through the long, hard nights.\nBridge\nEvery dime I scraped, I laid on that counter’s shine,\nBought me biscuits, bought me time, bought a spark divine.\nNow I sing for the ones still countin’ change in the glow,\nMae’s Diner’s where the heartland’s stories grow.\nChorus\nDiner life, where the jukebox wails of heartache and dreams,\nTruckers, drifters, lost souls mendin’ seams.\nIn the clink of forks, the hum of late-night fights,\nMae’s Diner held me close, through the long, hard nights.\nOutro\n*(Slow fiddle fade, soft picking)*\nDiner life… Mae’s light still burns, callin’ me near,\nTo the place where I found hope, when hope disappeared.",
  "themes": [
    "family",
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "resilience_survival",
    "working_class_labor"
  ],
  "suggested_venues": [
    "coffee_shop",
    "house_concert",
    "listening_room",
    "roadhouse",
    "small_theater"
  ],
  "sounds_like_acoustic": "Gentle fingerpicked acoustic guitar and fiddle create a warm, nostalgic feel, reminiscent of a quiet diner.  Harmonica adds a touch of bluesy melancholy.",
  "sounds_like_recording": "Warm, slightly reverb-drenched production with acoustic guitar, bass, drums, fiddle, and harmonica.  A blend of folk, Americana, and heartland rock styles evokes a sense of both intimacy and wide-open spaces.",
  "notes": ""
}