{
  "song_id": "drink_to_the_family",
  "title": "Drink to the Family",
  "status": "private",
  "lyrics": "(Verse 1)\nDust on my boots from a road gone rough\nChased dreams that broke when the times got tough\nKin turned their backs, left scars on my hide\nBut I found my crew where the good vibes ride\nA shot of Jack burns the pain away\nThese friends are my home, they’re here to stay\n(Chorus)\nRaise a shot of Jack to the family that ain’t blood\nToast the ones who lift you from the mud\nWhen the world slams the door, they kick it in tight\nThese rowdy hearts blaze wild in the night\nHere’s to family, true and bold!\n(Verse 2)\nWorked ‘til my hands cracked, bones wore thin\nFelt every loss like a cold, hard sin\nGhosts try to drag me, but I ain’t alone\nMy posse’s my throne, this tailgate’s our zone\nA bottle of Bud, we pass it around\nLaugh ‘til we’re dizzy, no hurt to be found\n(Verse 3)\nMoonlight’s our spotlight, the stars set the stage\nRaisin’ hell together, we’re writin’ this page\nFights and hard nights, we’ve weathered the storm\nThese brothers and sisters, they keep my heart warm\nA jar of moonshine, it stings, but it’s sweet\nTo the kin that I chose, who make life complete\n(Bridge)\nThis old guitar wails a rebel’s tune\nSings of nights lit by a bonfire moon\nHere’s to the lost, the wild, the free\nThe ones who stood tall and drank with me\nThey’re my fight, my soul, my song\n(Chorus)\nRaise a shot of Jack to the family that ain’t blood\nToast the ones who lift you from the mud\nWhen the world slams the door, they kick it in tight\nThese rowdy hearts blaze wild in the night\nHere’s to family, true and bold!\n(Outro)\nYeah, true and bold, through the highs and the lows\nBottle of Bud, moonshine’s glow\nRaise a shot of Jack, let the good times roll",
  "themes": [
    "abuse_trauma",
    "bar_setting",
    "family",
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "music_songwriting",
    "nature_outdoors",
    "partying_celebration",
    "rebellion_outlaw",
    "resilience_survival",
    "working_class_labor"
  ],
  "suggested_venues": [
    "amphitheater",
    "festival",
    "honky_tonk",
    "house_concert",
    "outdoor_venue",
    "roadhouse",
    "stadium"
  ],
  "sounds_like_acoustic": "A raw, full blown party song played on acoustic guitar. Gravelly vocals, evoking a sense of campfire camaraderie and a perfect singalong drinking song.",
  "sounds_like_recording": "A driving, anthemic country-rock production with layered electric guitars, drums, bass, and powerful vocals, capturing a feeling of rebellious energy and heartfelt celebration.",
  "notes": ""
}