{
  "song_id": "drivin_to_you",
  "title": "Drivin' to You",
  "status": "private",
  "lyrics": "Verse 1\nKicked off from Kentucky, tires spinnin’ through the night,\nYour dream’s in California, girl, I’m racin’ toward your light.\nTennessee’s hills are callin’, with their banjo serenade,\nArkansas’ muddy delta’s where your memory’s never strayed.\n\nPre-Chorus\nRadio’s buzzin’, but your voice is my guide,\nEvery state’s a promise, I’m crossin’ the divide.\n\nChorus\nFrom Texas to California, I’m ridin’ into LA!\nDrivin’ to you, darlin’, no state’s too far away!\nOklahoma to Nevada, I’m burnin’ up the miles,\nSing it loud, I’m comin’ for your heart and your smile!\nYour dream’s my compass, I’m chasin’ your glow,\nFrom Texas to California, girl, here I go!\n\nVerse 2\nOklahoma’s plains are screamin’, wind tearin’ at my soul,\nTexas stars light the way, your face in their fiery roll.\nMissouri’s rivers churn wild, reflectin’ your sweet spark,\nNew Mexico’s desert heat can’t stop this racin’ heart.\n\nPre-Chorus\nCoffee’s cold as stone, but my heart’s runnin’ hot,\nThis highway’s my heartstring, tyin’ all I got.\n\nChorus\nFrom Texas to California, I’m ridin’ into LA!\nDrivin’ to you, darlin’, no state’s too far away!\nOklahoma to Nevada, I’m burnin’ up the miles,\nSing it loud, I’m comin’ for your heart and your smile!\nYour dream’s my compass, I’m chasin’ your glow,\nFrom Texas to California, girl, here I go!\n\nBridge\nColorado’s peaks stand tall, Arizona’s canyons wail,\nNevada’s neon flickers, but your love’s my holy grail.\nI’d blaze through every state line, fight the wind and the storm,\nFor one night in your arms, keepin’ my heart warm.\n\nChorus\nFrom Texas to California, I’m ridin’ into LA!\nDrivin’ to you, darlin’, no state’s too far away!\nOklahoma to Nevada, I’m burnin’ up the miles,\nSing it loud, I’m comin’ for your heart and your smile!\nYour dream’s my compass, I’m chasin’ your glow,\nFrom Texas to California, girl, here I go!\n\nOutro\nFrom Texas to California, sunrise breakin’ through,\nThis road’s my love, and it’s leadin’ to you.",
  "themes": [
    "faith_spirituality",
    "freedom_wandering",
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "nature_outdoors"
  ],
  "suggested_venues": [
    "amphitheater",
    "arena",
    "festival",
    "outdoor_venue",
    "stadium"
  ],
  "sounds_like_acoustic": "A high-energy, road-charged acoustic banger with Alex Wilson’s Appalachian fire, featuring a relentless acoustic guitar strum, a wild fiddle that roars like a revving engine, and a steel guitar humming like a highway’s pulse, evoking the heart-pounding rush of a cross-country love chase.",
  "sounds_like_recording": "A thumping pop-country anthem with a turbo-charged beat, layered electric and acoustic guitars, a booming bassline, and Alex’s gravelly vocals belting a chant-ready hook, built to dominate Billboard’s Hot Country Songs with Blake Shelton’s bold swagger, perfect for highway cruises or arena-shaking sing-alongs.",
  "notes": ""
}