{
  "song_id": "embers_to_inferno",
  "title": "Embers to Inferno",
  "status": "private",
  "lyrics": "Verse 1\nUnder starlit skies, your shadow’s callin’ me near\nSoft brush of your hand, sendin’ shivers crystal clear.\nThat quiet little smirk, like a secret you won’t tell,\nGot my heart racin’ slow, like a spark in a spell.\nPre-Chorus\nYour eyes hold a promise, a flicker in the dark,\nBuildin’ up this tension, gonna ignite with a spark.\nChorus\nEmbers in your eyes, girl, you’re a slow-burnin’ flame,\nTeasin’ with a whisper, but you’re stokin’ this game.\nEvery glance, every sigh, stirrin’ heat in my veins,\nThe way you’re lookin’ at me, darlin’, it’s a fire that remains.\nVerse 2\nYour breath’s on my neck, warm and soft like a breeze,\nFingers trace my skin, got me weak in the knees.\nWe’re swayin’ in the quiet, just the crickets and the night,\nBut this slow dance is shiftin’, and it’s settin’ us alight.\nPre-Chorus\nYour eyes turn to hunger, no more holdin’ it back,\nThat flicker’s now a wildfire, and I’m under attack.\nChorus\nEmbers in your eyes, girl, you’re a slow-burnin’ flame,\nTeasin’ with a whisper, but you’re stokin’ this game.\nEvery glance, every sigh, stirrin’ heat in my veins,\nThe way you’re lookin’ at me, darlin’, it’s a fire that remains.\nBridge\nThen it breaks like a storm, and we’re crashin’ in the heat,\nYour nails claw my shoulders, bodies movin’ to the beat.\nHips grind like a rhythm that’s too wild to contain,\nMoans echo in the darkness, like a sweet, sinful refrain.\nWe’re past the point of savin’, lost in sweat and desire,\nThis slow burn’s an inferno, and we’re fuelin’ the fire.\nChorus\nInferno in your eyes, girl, you’re a reckless, ragin’ blaze,\nTearin’ through my senses, got me lost in a daze.\nEvery thrust, every cry, we’re consumin’ the night,\nThe way you’re lovin’ me, darlin’, it’s a sin burnin’ bright.\nOutro\nSo keep pullin’ me deeper, let the flames take their toll,\nFrom embers to an inferno, you’re devourin’ my soul.\nInferno in your eyes—girl, it’s where I wanna be,\nThe way you’re lovin’ me, it’s a fire settin’ me free.",
  "themes": [
    "faith_spirituality",
    "freedom_wandering",
    "love_romance",
    "nature_outdoors",
    "rebellion_outlaw"
  ],
  "suggested_venues": [
    "coffee_shop",
    "house_concert",
    "listening_room",
    "small_theater"
  ],
  "sounds_like_acoustic": "Fingerpicked acoustic guitar, light percussion, and warm bass create a sensual, intimate feel, building intensity as the song progresses.",
  "sounds_like_recording": "Sultry vocals layered over a driving drumbeat, electric guitar accents, and synthesized strings, creating a dark, passionate atmosphere with a pop sensibility.",
  "notes": ""
}