{
  "song_id": "friday_night_lights_in_honky_tonk_heaven",
  "title": "Friday Night Lights in Honky Tonk Heaven",
  "status": "private",
  "lyrics": "(Verse 1)\nSun sinkin' low, week's work is done\nDust off my boots, time for some fun\nGot my guitar, worn and well-loved\nReady to sing 'bout the heart I've been robbed\n(Chorus)\nFriday night lights in Honky Tonk Heaven, yeah\nWhiskey's flowin', music's playin' clear\nBroken hearts mendin', laughter ringin' true\nUnderneath the neon glow, me and you\n(Verse 2)\nSaw ol' Jimmy Joe, lookin' kinda blue\nLost his woman, don't know what to do\nBut tonight's for forgettin', leavin' troubles behind\nLet the music wash over, ease his weary mind\n(Chorus)\nFriday night lights in Honky Tonk Heaven, yeah\nWhiskey's flowin', music's playin' clear\nBroken hearts mendin', laughter ringin' true\nUnderneath the neon glow, me and you\n(Bridge)\nThis ain't no church, but souls find grace here\nIn the twangin' guitars and the clinking of beer\nWe share our stories, our joys and our pain\nFindin' solace 'til the sun shines again\n(Chorus)\nFriday night lights in Honky Tonk Heaven, yeah\nWhiskey's flowin', music's playin' clear\nBroken hearts mendin', laughter ringin' true\nUnderneath the neon glow, me and you\n(Outro)\nYeah, Friday night lights, burnin' bright and bold\nAnother story in this Honky Tonk's been told",
  "themes": [
    "bar_setting",
    "faith_spirituality",
    "heartbreak_loss",
    "love_romance",
    "music_songwriting",
    "partying_celebration",
    "working_class_labor"
  ],
  "suggested_venues": [
    "dive_bar",
    "honky_tonk",
    "roadhouse"
  ],
  "sounds_like_acoustic": "This track sounds like a blend of classic Hank Williams heartbreak with the upbeat honky-tonk energy of George Jones. The instrumentation features a driving steel guitar, a thumping stand-up bass, crisp snare drum, and a bright, twangy electric guitar providing the rhythmic backbone. A fiddle weaves in and out, adding a touch of mournful beauty that perfectly complements the lyrics' bittersweet tone. Willie Nelson's influence is felt in the relaxed vocal delivery, and the overall feel is reminiscent of a lively Friday night at the Tootsie Orchid Lounge, with a touch of Merle Haggard's storytelling grit. The song concludes with a fading steel guitar and a final, lingering chord, leaving the listener with a sense of both celebration and melancholy.",
  "sounds_like_recording": "",
  "notes": ""
}