{
  "song_id": "full_and_gone",
  "title": "Full and Gone",
  "status": "private",
  "lyrics": "Verse 1\nI packed my scars in a beat-up truck, left Pikeville in the dust,\nCoal-black memories clingin’ tight, like rust that won’t unrust.\nAin’t no fixin’ what that town broke, no mendin’ what it stole,\nBut I rolled out with a heart still beatin’, battered but whole.\nPre-Chorus\nNo tears for that trailer, no love for its chains,\nJust a boy’s old ghosts and a man’s new pains.\nChorus\nI left this town full, not fixed, but full,\nCarried my dreams past the weight of its pull.\nWith a rusted guitar and a fire inside,\nI’m gone from the holler, but I’m still alive.\nVerse 2\nBlackberry Creek’s where I learned to bleed, where fists taught me to stand,\nFound a six-string in a dumpster’s wreck, salvation in my hands.\nEvery bruise a map of hurt, every street a dead-end lie,\nBut I’m haulin’ hope down this open road, under a clearer sky.\nPre-Chorus\nNo preacher could save me, no bottle could drown,\nThe screams of that double-wide, that ghost-ridden town.\nChorus\nI left this town full, not fixed, but full,\nCarried my dreams past the weight of its pull.\nWith a rusted guitar and a fire inside,\nI’m gone from the holler, but I’m still alive.\nBridge\nI ain’t healed, but I’m heavy with fight,\nHer spark lit the way through my darkest night.\nFrom the mines’ cold grip to the stage’s raw glow,\nI’m full of the strength that only leavin’ can show.\nChorus\nI left this town full, not fixed, but full,\nCarried my dreams past the weight of its pull.\nWith a rusted guitar and a fire inside,\nI’m gone from the holler, but I’m still alive.\nOutro\n*(Slow picking, low E drone)*\nFull and gone, with the mountain’s old hum,\nSingin’ my truth, till the new day comes.",
  "themes": [
    "abuse_trauma",
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "music_songwriting",
    "nature_outdoors",
    "resilience_survival",
    "working_class_labor"
  ],
  "suggested_venues": [
    "amphitheater",
    "outdoor_venue"
  ],
  "sounds_like_acoustic": "",
  "sounds_like_recording": "",
  "notes": ""
}