{
  "song_id": "gimme_that_black_brew",
  "title": "Gimme That Black Brew",
  "status": "private",
  "lyrics": "Gimme That Black Brew\n\n**Verse 1**  \nWalked into a shop, thought I’d get a cup,  \nBut they’re pushin’ green tea dust, and I’m all fed up.  \nMatcha this, oat milk that, five bucks for a sip,  \nTastes like lawn clippings, burns a hole in my grip.  \n\n**Chorus**  \nGimme that black brew, punch me as it goes down!  \nStrong like a mule kick, wake this small-town clown!  \nNo fads, no frills, just coffee dark and true,  \nGimme that black brew, that’s what’ll get me through!  \n\n**Verse 2**  \nBarista’s talkin’ foam art, syrups by the score,  \nI just want a jolt, not a fancy pour.  \nOat milk’s got no nipples, that ain’t no cow’s delight,  \nNeed a brew to shake me, keep me workin’ till the night.  \n\n**Chorus**  \nGimme that black brew, punch me as it goes down!  \nStrong like a mule kick, wake this small-town clown!  \nNo fads, no frills, just coffee dark and true,  \nGimme that black brew, that’s what’ll get me through!  \n\n**Bridge**  \nRaise a mug to the grind, to the simple and plain,  \nNo hipster nonsense cloggin’ up my brain!  \nJust boil it thick, let it scald my soul,  \nBlack brew’s the fire that makes me whole!  \n\n**Chorus**  \nGimme that black brew, punch me as it goes down!  \nStrong like a mule kick, wake this small-town clown!  \nNo fads, no frills, just coffee dark and true,  \nGimme that black brew, that’s what’ll get me through!  \n\n**Outro**  \n(Claps, hollers, banjo twang)  \nGimme that black brew, none of that LA fake,  \nPour it strong, keep me wide awake!",
  "themes": [
    "bar_setting",
    "faith_spirituality",
    "hometown_roots",
    "partying_celebration",
    "resilience_survival",
    "working_class_labor"
  ],
  "suggested_venues": [
    "bar_setting",
    "festival",
    "honky_tonk",
    "roadhouse"
  ],
  "sounds_like_acoustic": "Alex’s rusted guitar strums bright, open chords with a fast, cheeky rhythm, his gravelly vocals belting the hook with a mischievous grin. Claps and a foot-stomp pulse add raw, barroom energy, sparking instant singalongs.",
  "sounds_like_recording": "A jangly acoustic guitar and twangy electric riffs lead a full band with lively drums, a zippy fiddle, and banjo plucks, crafting a polished, radio-ready anthem. Alex’s raspy vocals soar with reverb on the hook, backed by tambourine for a vibrant, crowd-pleasing sound.",
  "notes": ""
}