{
  "song_id": "going_viral",
  "title": "Going Viral",
  "status": "private",
  "lyrics": "(Verse 1)\nStarted with some coffee, or what they call it here,\nTalkin' 'bout oat nipples, made Shay Bear grin ear to ear.\nThen a goat in a sweater, name of Harold, if you please,\nHad me on the pavement, laughin' till I couldn't breathe.\nMoonbeam had a guitar, hangin' like a piece of art,\nSaid it needed playin', right from my Kentucky heart.\n(Chorus)\nNow they say I'm goin' viral, whatever that might mean,\nLittle screens all lit up, the craziest damn thing I've seen.\nSingin' 'bout sad porridge and Harold in his Sunday best,\nJust a red dirt drifter puttin' feelings to the test,\nOut here in this LA sun, ain't like no place I know,\nWonderin' how a whisper turned into a picture show.\n(Verse 2)\nJumped up on a table, sang about this crazy town,\nThe words just came on out, as the folks all gathered 'round.\nThen I sang 'bout hardship, and that guitar from the trash,\nFelt the whole world listen, saw the tears begin to splash.\nShay was lookin' prouder than I'd ever seen her look,\nLike she knew these city folks would read me like a book.\n(Chorus)\nNow they say I'm goin' viral, whatever that might mean,\nLittle screens all lit up, the craziest damn thing I've seen.\nSingin' 'bout sad porridge and Harold in his Sunday best,\nJust a red dirt drifter puttin' feelings to the test,\nOut here in this LA sun, ain't like no place I know,\nWonderin' how a whisper turned into a picture show.\n(Bridge)\nAin't never chased no spotlight, ain't my kind of game,\nJust sing my truth out quiet, whisper Shay Bear's name.\nBut if my rusty-string stories, 'bout the hurt and hope I've known,\nCan make a stranger out there feel a little less alone...\nWell, maybe there's a reason this wild seed was sown.\n(Chorus)\nNow they say I'm goin' viral, whatever that might mean,\nLittle screens all lit up, the craziest damn thing I've seen.\nSingin' 'bout sad porridge and Harold in his Sunday best,\nJust a red dirt drifter puttin' feelings to the test,\nOut here in this LA sun, ain't like no place I know,\nWonderin' how a whisper turned into a picture show.\n(Outro)\nYeah, a picture show... full of folks I've never met.\nStill don't get this \"viral,\" ain't quite figured it out yet.\nJust got my girl, my guitar... and I guess Harold the goat.\n(Guitar fades out with a soft, questioning strum)",
  "themes": [
    "family",
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "partying_celebration",
    "resilience_survival",
    "working_class_labor"
  ],
  "suggested_venues": [
    "coffee_shop",
    "festival",
    "house_concert",
    "listening_room"
  ],
  "sounds_like_acoustic": "Simple, honest acoustic guitar intro – maybe a few thoughtful, slightly questioning chords",
  "sounds_like_recording": "",
  "notes": ""
}