{
  "song_id": "heres_to_the_ghosts_i_leave_behind",
  "title": "Here’s to the Ghosts I Leave Behind",
  "status": "private",
  "lyrics": "Verse 1\nI’ve walked through the ashes of a life torn apart,\nCarried the weight of a coal-black heart.\nSome ghosts held me close, some cut like a blade,\nBut each one’s a shadow that my soul’s outstayed.\nPre-Chorus\nThe road taught me mercy, the pain taught me grace,\nEach step’s a new story writ on my face.\nChorus\nWe raise our glasses to the ones who stayed —\nAnd tip our hats to the ones we outgrew with age.\nThere’s grace in the leavin’, mercy in the signs —\nHere’s to the ghosts we leave behind.\nVerse 2\nMom’s in the stars, Dad’s in the dust,\nOne gave me love, one broke my trust.\nBut I’m more than their echoes, more than their chains,\nI’m the man I built through the joys and the pains.\nPre-Chorus\nThe past ain’t my prison, it’s just where I’ve been,\nEach goodbye’s a door to begin again.\nChorus\nWe raise our glasses to the ones who stayed —\nAnd tip our hats to the ones we outgrew with age.\nThere’s grace in the leavin’, mercy in the signs —\nHere’s to the ghosts we leave behind.\nBridge\nTo the boy I was, scared and alone,\nTo the man I am, who found a home.\nEvery ghost’s a lesson, every scar’s a line,\nI’m singin’ my freedom, leavin’ ghosts behind.\nChorus\nWe raise our glasses to the ones who stayed —\nAnd tip our hats to the ones we outgrew with age.\nThere’s grace in the leavin’, mercy in the signs —\nHere’s to the ghosts we leave behind.\nOutro\n*(Slow picking: E|-3---3---|)*\nHere’s to the ghosts… I’m leavin’ behind.",
  "themes": [
    "abuse_trauma",
    "family",
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "partying_celebration",
    "resilience_survival",
    "working_class_labor"
  ],
  "suggested_venues": [
    "amphitheater",
    "coffee_shop",
    "festival",
    "house_concert",
    "listening_room",
    "outdoor_venue",
    "small_theater"
  ],
  "sounds_like_acoustic": "A raw and intimate acoustic performance with fingerpicked acoustic guitar and a gravelly, emotive vocal delivery, evoking a sense of reflection and resilience.",
  "sounds_like_recording": "A rootsy Americana recording with warm acoustic guitars, subtle bass, light percussion, and layered harmonies, creating a bittersweet and anthemic feel.",
  "notes": ""
}