{
  "song_id": "i_raised_myself",
  "title": "I Raised Myself",
  "status": "private",
  "lyrics": "Verse 1\nCoal dust on my boots, blood on my hands,\nGrew up in a hell where no one understands.\nDad’s fist was his gospel, his bottle his creed,\nI learned to stand tall while my heart learned to bleed.\nPre-Chorus\nNo soft words, no shelter from the storm,\nJust a boy and a guitar keepin’ my soul warm.\nChorus\nNo lullabies, no ‘good job, son’ —\nJust the sound of doors slammin’ when the hard times come.\nScraped my knees and stitched my pride —\nI raised myself, and I survived.\nVerse 2\nKentucky nights taught me how to fight,\nDodgin’ his shadow in the dim porch light.\nStrummed my pain on strings rusted and worn,\nTurned my scars into songs before the dawn was born.\nPre-Chorus\nNo roadmap, no hand to hold me tight,\nJust a fire in my chest burnin’ through the night.\nChorus\nNo lullabies, no ‘good job, son’ —\nJust the sound of doors slammin’ when the hard times come.\nScraped my knees and stitched my pride —\nI raised myself, and I survived.\nBridge\nEvery bruise was a lesson, every tear was a flame,\nBuilt a man from the wreckage of a cursed last name.\nThis guitar’s my salvation, my truth, my fight,\nI raised myself to sing into the night.\nChorus\nNo lullabies, no ‘good job, son’ —\nJust the sound of doors slammin’ when the hard times come.\nScraped my knees and stitched my pride —\nI raised myself, and I survived.\nOutro\n*(Slow picking: E|-3---3---|)*\nI raised myself… and I’m still alive.",
  "themes": [
    "abuse_trauma",
    "family",
    "faith_spirituality",
    "heartbreak_loss",
    "hometown_roots",
    "music_songwriting",
    "rebellion_outlaw",
    "resilience_survival",
    "working_class_labor"
  ],
  "suggested_venues": [
    "coffee_shop",
    "honky_tonk",
    "listening_room",
    "roadhouse",
    "small_theater"
  ],
  "sounds_like_acoustic": "A traditional honky-tonk ballad with mournful steel guitar and a raw, powerful vocal delivery reminiscent of Merle Haggard.  Alex Wilson tells a hard-luck story of self-reliance, echoing classic country themes of struggle and survival, with driving acoustic guitar and subtle fiddle accents creating a timeless, authentic sound.",
  "sounds_like_recording": "",
  "notes": ""
}