{
  "song_id": "keep_singin_on",
  "title": "Keep Singin’ On",
  "status": "private",
  "lyrics": "Verse 1:\nCame to this town with a song in my heart,\nVoice full of dreams, but the world’s played hard.\nWaitin’ on tables, sweepin’ floors till dawn,\nHoldin’ to hope when the money’s all gone.\nChorus:\nKeep singin’ on, let the truth ring true,\nEvery note’s a fight for the life I pursue.\nThrough the ache and the doubt, I’ll still raise my song,\nHeart’s still burnin’, so I keep singin’ on.\nVerse 2:\nMama’s voice echoes, said I’d shine someday,\nBut she’s gone to glory, and I’m still findin’ my way.\nThis old guitar’s my only friend some nights,\nSingin’ to shadows, chasin’ stage lights.\nChorus:\nKeep singin’ on, let the truth ring true,\nEvery note’s a fight for the life I pursue.\nThrough the ache and the doubt, I’ll still raise my song,\nHeart’s still burnin’, so I keep singin’ on.\nBridge:\nBills stack high, and the dreams wear thin,\nBut my soul’s got a fire that won’t give in.\nEvery scar’s a story, every tear’s a call,\nI’ll sing through the silence till I’ve given it all.\nChorus:\nKeep singin’ on, let the truth ring true,\nEvery note’s a fight for the life I pursue.\nThrough the ache and the doubt, I’ll still raise my song,\nHeart’s still burnin’, so I keep singin’ on.\nOutro:\nSo here’s my voice, let it carry me home,\nThrough empty rooms where my dreams still roam.\nNo matter how heavy, I’ll carry this dawn,\nWith love in my heart, I keep singin’ on.",
  "themes": [
    "abuse_trauma",
    "family",
    "faith_spirituality",
    "heartbreak_loss",
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "resilience_survival",
    "working_class_labor"
  ],
  "suggested_venues": [
    "coffee_shop",
    "house_concert",
    "listening_room"
  ],
  "sounds_like_acoustic": "Alex plays on his rusted guitar, the slightly sharp strings ringing with open chords (G, C, D, Am). His gravelly vocals carry a warm, steady cadence, rising in the chorus with a hopeful lift, the song’s intimacy suiting a garage jam for Maria.",
  "sounds_like_recording": "A clean acoustic guitar leads, backed by a gentle kick drum, upright bass, and subtle fiddle fills. Maria’s vocals (imagined as rich and soulful) soar with reverb, harmonies in the chorus, and a mandolin adding sparkle, creating a polished yet rootsy country track.",
  "notes": "For singer called Maria"
}