{
  "song_id": "lantern_i_left_behind",
  "title": "Lantern I Left Behind",
  "status": "private",
  "lyrics": "Lantern I Left Behind\n(Verse 1)\nSunrise spills across the ridge, paints the valley gold\nAnother day breaks on this farm, a story left untold\nOf restless nights and whispered dreams beneath a moonless sky\nAnd the lantern I left burning low, the night you said goodbye.\nThe crickets chirped a lonely tune, the wind sighed through the trees\nI watched your shadow disappear, carried on the breeze.\n(Chorus)\nLantern I left behind, a flickering ember glow\nA beacon in the darkness, watchin' where you go\nA fragile flame against the dawn, a hope I couldn't keep\nJust a memory now, a promise I couldn't sleep.\n(Verse 2)\nThe rooster crows, a mournful sound, echoes through the air\nAnother day to plow these fields, another burden to bear\nThe coffee's strong and bitter black, like the taste in my mouth now\nRemember how we used to laugh, beneath the apple bough?\nWe carved our initials in the bark, swore it'd always be\nBut time and distance took their toll, and stole you away from me.\n(Bridge)\nMaybe someday down the road, our paths will cross again\nMaybe someday I'll understand, and forgive the hurt and pain\nMaybe someday the lantern's light won't sting my eyes so bright\nMaybe someday I'll find my peace, in the stillness of the night.\n(Chorus)\nLantern I left behind, a flickering ember glow\nA beacon in the darkness, watchin' where you go\nA fragile flame against the dawn, a hope I couldn't keep\nJust a memory now, a promise I couldn't sleep.\n(Outro)\nJust a memory now, a lantern I left behind\nBurning in the morning light, a love I couldn't find.\nBurning in the morning light…",
  "themes": [
    "abuse_trauma",
    "freedom_wandering",
    "heartbreak_loss",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "nostalgia",
    "working_class_labor"
  ],
  "suggested_venues": [
    "amphitheater",
    "outdoor_venue"
  ],
  "sounds_like_acoustic": "",
  "sounds_like_recording": "",
  "notes": ""
}