{
  "song_id": "love_aint_enough",
  "title": "Love Ain’t Enough",
  "status": "private",
  "lyrics": "Verse 1\nScreen lit up, your face in the glow,\nLaughin’ with shadows I ain’t meant to know.\nWhiskey’s burnin’, but it don’t kill the pain,\nYour voice, their hands, it’s tearin’ up my brain.\nPre-Chorus\nI trusted your lies, fell for every word,\nNow I’m drownin’ in the truth I wish I hadn’t heard.\nChorus\nYou gave me forever, but you meant it for a while —\nI gave you my heart, you gave me back a smile.\nLove isn’t enough when the storm clouds come —\nIt’s a promise in the sunlight, but it’s gone by the dawn.\nVerse 2\nI blocked your ass faster than a bullet leaves a gun,\nErased your sweet nothin’s, left your memory undone.\nBut this bottle’s still heavy, and the night’s still long,\nYour betrayal’s a chorus to a lonesome, bitter song.\nPre-Chorus\nI see it all now, the truth in the flame,\nBut I’m the damn fool who’s still cursin’ your name.\nChorus\nYou gave me forever, but you meant it for a while —\nI gave you my heart, you gave me back a smile.\nLove isn’t enough when the storm clouds come —\nIt’s a promise in the sunlight, but it’s gone by the dawn.\nBridge\nWas I just a spark you let burn out and fade?\nA heart you could steal, then toss in the shade?\nThis guitar’s my witness, these strings bleed my cry,\nI’m done with your games, but I’m too broke to lie.\nChorus\nYou gave me forever, but you meant it for a while —\nI gave you my heart, you gave me back a smile.\nLove isn’t enough when the storm clouds come —\nIt’s a promise in the sunlight, but it’s gone by the dawn.\nOutro\nScreen’s gone dark, but the hurt’s still alive,\nLove ain’t enough to keep this soul revived.\n*(Slow picking on low E)*\nGone by the dawn… gone by the dawn.",
  "themes": [
    "bar_setting",
    "faith_spirituality",
    "heartbreak_loss",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "resilience_survival"
  ],
  "suggested_venues": [
    "dive_bar"
  ],
  "sounds_like_acoustic": "",
  "sounds_like_recording": "",
  "notes": ""
}