{
  "song_id": "miles_of_sorrow",
  "title": "Miles of Sorrow",
  "status": "private",
  "lyrics": "(Verse 1)\nSunrise paints the cotton fields, another day begins\nBut the light don't shine so bright, since your love went on the winds\nWe built a life on promises, beneath a Georgia moon\nBut your city dreams called louder, than my love could ever croon\n(Chorus)\nMiles of sorrow stretch between us, a highway paved with tears\nEach mile a memory fading, swallowed by the passing years\nWe said forever, honey, but forever couldn't hold\nAgainst the pull of distance, a story left untold\n(Verse 2)\nRemember dancin' in the hayloft, beneath the summer stars?\nYour laughter like a mockingbird, escaping rusty bars\nWe swore our love was stronger, than any earthly pain\nBut the miles kept piling higher, a relentless, driving rain\n(Chorus)\nMiles of sorrow stretch between us, a highway paved with tears\nEach mile a memory fading, swallowed by the passing years\nWe said forever, honey, but forever couldn't hold\nAgainst the pull of distance, a story left untold\n(Bridge)\nI see your face in every sunset, hear your voice in every breeze\nBut the silence in this farmhouse, just echoes my unease\nI shoulda held you tighter, darling, shoulda fought with all my might\nBut the distance won the battle, and stole away my light\n(Chorus)\nMiles of sorrow stretch between us, a highway paved with tears\nEach mile a memory fading, swallowed by the passing years\nWe said forever, honey, but forever couldn't hold\nAgainst the pull of distance, a story left untold\n(Outro)\nMiles of sorrow… miles and miles of sorrow…",
  "themes": [
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "nostalgia",
    "working_class_labor"
  ],
  "suggested_venues": [
    "coffee_shop",
    "honky_tonk",
    "listening_room",
    "small_theater"
  ],
  "sounds_like_acoustic": "This song sounds like a lost track from a Hank Williams, Jr. album, with a touch of George Jones' melancholic vocals. The instrumentation would feature a mournful steel guitar weeping throughout, a steady rhythm guitar providing a melancholic pulse, a walking bassline, and subtle fiddle accents during the chorus. The overall sound is raw and emotional, focusing on the singer's heartache and the story's inherent sadness. A simple, yet effective drum beat keeps the tempo slow and deliberate, mirroring the weight of the heartbreak. Think classic Nashville sound with a focus on emotional delivery and traditional instrumentation.",
  "sounds_like_recording": "",
  "notes": ""
}