{
  "song_id": "miles_of_heartache",
  "title": "Miles of Heartache",
  "status": "private",
  "lyrics": "(Verse 1)\nSunrise paints the cotton fields, another day begins\nBut the light don't shine so bright no more, since you left for distant lands\nSaid you'd write, said you'd call, promised you'd always be near\nBut the miles stretched out between us, fueled by doubt and fear.\n(Chorus)\nMiles of heartache, winding roads of sorrow,\nEvery mile a memory, of a love we couldn't borrow\nFrom the future, from the years, from a life we'd planned to share\nNow just miles of heartache, and a love beyond repair.\n(Verse 2)\nRemember dancin' in the moonlight, beneath the summer sky?\nYour laughter echoed in the fields, a song that made me fly.\nWe built a dream on promises, as solid as the ground\nBut the city lights and city life, tore our love unbound.\n(Chorus)\nMiles of heartache, winding roads of sorrow,\nEvery mile a memory, of a love we couldn't borrow\nFrom the future, from the years, from a life we'd planned to share\nNow just miles of heartache, and a love beyond repair.\n(Bridge)\nI keep your picture by my bed, a faded photograph\nA constant reminder of the love, that distance stole, alas.\nMaybe someday I'll forget, the pain that cuts so deep\nBut until then, these miles of heartache, are the only truth I keep.\n(Chorus)\nMiles of heartache, winding roads of sorrow,\nEvery mile a memory, of a love we couldn't borrow\nFrom the future, from the years, from a life we'd planned to share\nNow just miles of heartache, and a love beyond repair.\n(Outro)\nMiles… miles of heartache… yeah… gone…",
  "themes": [
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "love_romance",
    "nature_outdoors",
    "nostalgia"
  ],
  "suggested_venues": [
    "coffee_shop",
    "honky_tonk",
    "listening_room",
    "small_theater"
  ],
  "sounds_like_acoustic": "This song sounds like a lost Hank Williams track, with a touch of George Jones's melancholic vocals and Merle Haggard's storytelling ability. The instrumentation would be sparse but effective: a mournful steel guitar weeping throughout, a steady rhythm guitar providing a simple, heartbroken pulse, a walking bassline, and subtle fiddle flourishes in the chorus. The drums would be restrained, keeping the focus on the vocals and the instruments' emotional delivery. The overall feel is raw, honest, and steeped in the classic country traditions of heartbreak and longing.",
  "sounds_like_recording": "",
  "notes": ""
}