{
  "song_id": "morning_after_rain",
  "title": "Morning After Rain",
  "status": "private",
  "lyrics": "Morning After Rain\n(Verse 1)\nSunrise paints the valley gold, a mist hangs in the air\nThe creek bed whispers stories of the flood that raged through there\nThe earth drinks deep, the thirsty roots, reach down for grace anew\nAnd I remember every tear, that washed over me and you\n(Chorus)\nMorning after rain, the scars begin to bloom\nWildflowers in the canyons, pushing through the gloom\nBroken branches reach for light, a testament of will\nMorning after rain, His mercy fills me still\n(Verse 2)\nThe wind chimes sing a gentle song, a melody of peace\nThe broken fence post stands alone, a reminder grief will cease\nThe scent of honeysuckle sweet, a promise on the breeze\nThat even in the deepest hurt, there's solace in the trees\n(Bridge)\nI used to hide the broken parts, afraid to let them show\nBut every crack and every line, is how I learn to grow\nThe storm may rage, the thunder roar, but faith will see me through\n'Cause even shattered pieces, can reflect the morning dew\n(Chorus)\nMorning after rain, the scars begin to bloom\nWildflowers in the canyons, pushing through the gloom\nBroken branches reach for light, a testament of will\nMorning after rain, His mercy fills me still\n(Outro)\nMorning after rain, the sun breaks through the clouds\nMorning after rain, His love shouts out aloud.\nMorning after rain.",
  "themes": [
    "abuse_trauma",
    "faith_spirituality",
    "heartbreak_loss",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "nostalgia",
    "resilience_survival"
  ],
  "suggested_venues": [
    "amphitheater",
    "church",
    "coffee_shop",
    "house_concert",
    "listening_room",
    "outdoor_venue",
    "revival",
    "small_theater"
  ],
  "sounds_like_acoustic": "Gentle fingerpicked acoustic guitar, warm cello, and light harmonies create a folk-inspired ballad with a hopeful, reflective feel.",
  "sounds_like_recording": "A polished studio recording with lush strings, piano accents, and a subtle drum beat supporting a clear, emotive vocal performance in a contemporary Christian style.",
  "notes": ""
}