{
  "song_id": "my_kentucky_heartbeat",
  "title": "My Kentucky Heartbeat",
  "status": "private",
  "lyrics": "(Verse 1)\nSunrise paints these Blue Ridge Mountains, but I'm already caked in mine grime\nAnother shift done, countin' pennies, losin' track of time.\nThis old pickup's my four walls now, under the Kentucky moon so wide\nBut thinkin' of your West Coast smile, girl, eases the ache inside.\n(Chorus)\nHey, Shay, my Kentucky Heartbeat, my steady ground so true,\nMiles can't change this rhythm I only find in you.\nEvery sunrise I fight for, every dollar I make,\nIs for your California dream, no matter what it takes.\n(Verse 2)\nRemember Blackberry Creek, dust devils dancin' in the summer heat?\nFelt like magic then, your hand in mine, oh, bitter and so sweet.\nNow your picture on the dash, it guides me through the dark and lonely road\nHelps me carry every burden, helps me lift this heavy load.\n(Chorus)\nHey, Shay, my Kentucky Heartbeat, my steady ground so true,\nMiles can't change this rhythm I only find in you.\nEvery sunrise I fight for, every dollar I make,\nIs for your California dream, no matter what it takes.\n(Bridge)\nThese calloused hands have known the sting of cold and burnin' steel\nPlayed a rusted, found guitar, makin' all this heartache real.\nBut you heard the truth within the noise, a song beneath the pain\nMy Shay Bear, your belief in me, it washes off the stains.\n(Chorus)\nHey, Shay, my Kentucky Heartbeat, my steady ground so true,\nMiles can't change this rhythm I only find in you.\nEvery sunrise I fight for, every dollar I make,\nIs for your California dream, no matter what it takes.\n(Outro)\nYeah, my Kentucky Heartbeat, thumpin' just for you, Shay Bear. \nMore than just some words, girl, this is my earnest prayer.\nMy truth, my song, for you",
  "themes": [
    "abuse_trauma",
    "family",
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "nostalgia",
    "rebellion_outlaw",
    "resilience_survival",
    "working_class_labor"
  ],
  "suggested_venues": [
    "amphitheater",
    "honky_tonk",
    "outdoor_venue",
    "roadhouse"
  ],
  "sounds_like_acoustic": "A surprisingly intricate blend of a hard-running, percussive rhythm from a notably resonant, time-worn acoustic guitar and elegant, self-taught fingerpicking underpins a raw, deep, and gravelly lead vocal that commands attention.",
  "sounds_like_recording": "A powerful, deep, and gravelly lead vocal soars above intricate, riff-driven acoustic guitar and sophisticated fingerpicking, all propelled by a tight, driving rhythm section and richly layered with mournful or fiery fiddle lines, weeping steel guitar, and warm, soulful keyboard textures, creating an authentic synthesis of classic outlaw country and modern Americana.",
  "notes": ""
}