{
  "song_id": "my_mothers_eyes",
  "title": "My Mother’s Eyes",
  "status": "private",
  "lyrics": "Verse 1\nNever knew your smile, never heard your call,\nJust a faded photo on a cracked bedroom wall.\nBut when the mirror catches me in the morning’s glare,\nI see your fire burnin’, and I know you’re there.\nPre-Chorus\nYou gave me your spirit when you gave me my life,\nYour love’s in my blood, sharper than a knife.\nChorus\nShe never heard my first cry, never wiped my fears,\nBut her face stares back in my morning mirror.\nThe love I never touched still paints my skies —\nI was born with my mother’s eyes.\nVerse 2\nDad said I killed you, but I feel you near,\nIn the songs I sing, in the dreams that appear.\nYour strength’s in my hands when I strum through the pain,\nYour heart’s in my chest when I’m walkin’ through rain.\nPre-Chorus\nYou left me your courage when you left this earth,\nI’m livin’ your love in the songs of my birth.\nChorus\nShe never heard my first cry, never wiped my fears,\nBut her face stares back in my morning mirror.\nThe love I never touched still paints my skies —\nI was born with my mother’s eyes.\nBridge\nEvery note’s a letter to the mother I’ve known,\nEvery chord’s a root in the seeds you’ve sown.\nYou’re the light in my darkness, the truth in my cries,\nI’m carryin’ your love in my mother’s eyes.\nChorus\nShe never heard my first cry, never wiped my fears,\nBut her face stares back in my morning mirror.\nThe love I never touched still paints my skies —\nI was born with my mother’s eyes.\nOutro\n*(Slow picking: E|-3---3---|)*\nMy mother’s eyes… my heart’s only light.",
  "themes": [
    "family",
    "heartbreak_loss",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "nostalgia",
    "resilience_survival"
  ],
  "suggested_venues": [
    "coffee_shop",
    "house_concert",
    "listening_room",
    "small_theater"
  ],
  "sounds_like_acoustic": "Fingerpicked acoustic guitar, gentle and melancholic, with a focus on raw vocals and emotional delivery.  The bridge and outro would feature slightly more intricate fingerstyle.",
  "sounds_like_recording": "A warm, intimate studio recording with acoustic guitar as the foundation, layered with subtle strings, piano, and light percussion.  The production emphasizes the vulnerability of the vocals and builds to a powerful, yet restrained, chorus.",
  "notes": ""
}