{
  "song_id": "phoenix_flight",
  "title": "Phoenix Flight",
  "status": "private",
  "lyrics": "Title:  Phoenix Flight\n(Verse 1)\nDust devils danced on the cracked, dry land\nReflection stared back, a ghost in my hand\nThought I was buried, six feet beneath the shame\nRattlesnake whisperin',  \"Ain't nobody else to blame.\"\nSun beatin' down, a crucible of pain\nBut something shifted, a low rumble in the rain.\n(Chorus)\nThese ashes ain't my ending, they're the fuel for the flame\nBurnin' off the past, risin' up with a new name\nNo more lookin' backward, no more chains to hold me down\nThis ain't a resurrection, this is a phoenix flight outta this town.\n(Verse 2)\nBuilt my own pyre with the regrets I'd held tight\nEvery broken promise, bathed in the fading light\nThe whispers turned to roars, the demons screamed and cried\nAs the flames licked higher, I felt the fear subside.\nLet the judgment fall, let the gossipers spin their lies\n'Cause the only truth that matters is the fire in my eyes.\n(Chorus)\nThese ashes ain't my ending, they're the fuel for the flame\nBurnin' off the past, risin' up with a new name\nNo more lookin' backward, no more chains to hold me down\nThis ain't a resurrection, this is a phoenix flight outta this town.\n(Bridge)\nThey thought they had me broken, thought I'd wither and fade\nBut they underestimated the wildfire I had made\nFrom the embers of heartbreak, a fierce spirit takes flight\nSoaring through the darkness, bathed in the morning light.\n(Chorus)\nThese ashes ain't my ending, they're the fuel for the flame\nBurnin' off the past, risin' up with a new name\nNo more lookin' backward, no more chains to hold me down\nThis ain't a resurrection, this is a phoenix flight outta this town.\n(Outro)\nYeah, a phoenix flight, a phoenix flight\nOutta this town, into the light.\nFlyin' high, leavin' the dust behind\nA phoenix flight, peace of mind.",
  "themes": [
    "heartbreak_loss",
    "nature_outdoors",
    "rebellion_outlaw",
    "resilience_survival"
  ],
  "suggested_venues": [
    "amphitheater",
    "honky_tonk",
    "outdoor_venue",
    "roadhouse"
  ],
  "sounds_like_acoustic": "",
  "sounds_like_recording": "",
  "notes": ""
}