{
  "song_id": "roots_torn_slow",
  "title": "Roots Torn Slow",
  "status": "private",
  "lyrics": "Some folks leave like a gust through the pines,\nFast and loud, gone before the night’s decline.\nBut you left like roots ripped from the ground,\nSlow and breakin’, didn’t make a sound.\nI stood there watchin’, my heart in my hands,\nPieces of me scattered ‘cross this lonesome land.\n(Pre-Chorus)\nEvery step feels like I’m circlin’ a scar,\nA hollow where you were, where you tore me apart.\n(Chorus)\nRoots torn slow, they don’t just fade away,\nThey leave a hole that haunts me every day.\nI walk like I’m growin’ ‘round the pain,\nPlantin’ flowers in the dirt where you remained.\nThey bloom deeper, they know what I’ve lost,\nThey choose sunlight, no matter the cost.\n(Verse 2)\nI used to think love was a fire that burned,\nBut yours was a weight, a lesson I learned.\nEach crack in my soul, it taught me to fight,\nTo find my own spark in the cold, endless night.\nNow I’m sowin’ seeds where the shadows still creep,\nBuildin’ a garden from the hurt runnin’ deep.\n(Pre-Chorus)\nEvery bloom’s a battle, every petal’s a prayer,\nProof I’m still standin’, though you ain’t there.\n(Chorus)\nRoots torn slow, they don’t just fade away,\nThey leave a hole that haunts me every day.\nI walk like I’m growin’ ‘round the pain,\nPlantin’ flowers in the dirt where you remained.\nThey bloom deeper, they know what I’ve lost,\nThey choose sunlight, no matter the cost.\n(Bridge)\nI ain’t the girl you left in the dust,\nMy heart’s got thorns now, forged from the rust.\nBut these hands still dig, they still reach for the sky,\nTurnin’ tears into roses that won’t ever die.\nYour leavin’ broke me, but it made me whole,\nI found my roots in this stubborn soul.\n(Chorus)\nRoots torn slow, they don’t just fade away,\nThey leave a hole that haunts me every day.\nI walk like I’m growin’ ‘round the pain,\nPlantin’ flowers in the dirt where you remained.\nThey bloom deeper, they know what I’ve lost,\nThey choose sunlight, no matter the cost.\n(Outro)\nSome leave like wind, but you left like stone,\nTore out my roots, but I’m growin’ my own.\nThese flowers I plant, they’re my heart’s quiet vow,\nThey bloom deeper… and I’m stronger now.",
  "themes": [
    "abuse_trauma",
    "faith_spirituality",
    "heartbreak_loss",
    "hometown_roots",
    "love_romance",
    "nature_outdoors",
    "resilience_survival",
    "working_class_labor"
  ],
  "suggested_venues": [
    "amphitheater",
    "outdoor_venue"
  ],
  "sounds_like_acoustic": "The song is a mid-tempo country lament, blending traditional and modern elements, designed for a female vocalist with a powerful, emotive range",
  "sounds_like_recording": "",
  "notes": "Written for a female artist"
}