{
  "song_id": "running_free",
  "title": "Running Free",
  "status": "private",
  "lyrics": "Verse 1\nHighway hums low, just me and the sky,\nThat video call’s just a ghost in my mind.\nLeft the roadhouse behind, let the whiskey burn clean,\nI’m carryin’ my scars, but my heart’s runnin’ lean.\nPre-Chorus\nNo chains, no pain, just the road up ahead,\nI’m livin’ for me, not the tears that I shed.\nChorus\nRunnin’ free, with the fire in my soul,\nNo more chasin’ your lies down a dead-end road.\nBuilt a man from the wreckage you left in your wake,\nThis heart’s still alive, and it’s runnin’ free today.\nVerse 2\nPass that old diner where we scratched our dreams,\nNow it’s dust on my boots, just a faded old scene.\nThe jukebox don’t haunt me, the nights don’t bite,\nThese strings sing my freedom in the pale starlight.\nPre-Chorus\nNo ghosts, no grief, just the wind at my back,\nI’m writin’ my story on this endless black track.\nChorus\nRunnin’ free, with the fire in my soul,\nNo more chasin’ your lies down a dead-end road.\nBuilt a man from the wreckage you left in your wake,\nThis heart’s still alive, and it’s runnin’ free today.\nBridge\nI forgave the fool I was for lovin’ you blind,\nFound a steel in my bones that your betrayal refined.\nThe road ain’t salvation, but it’s honest and wide,\nI’m runnin’ toward freedom with my head held high.\nChorus\nRunnin’ free, with the fire in my soul,\nNo more chasin’ your lies down a dead-end road.\nBuilt a man from the wreckage you left in your wake,\nThis heart’s still alive, and it’s runnin’ free today.\nOutro\n*(Slow picking: E|-3---3---|)*\nHighway keeps callin’, I ain’t lookin’ behind,\nRunnin’ free, with a strong, steady mind.",
  "themes": [
    "abuse_trauma",
    "bar_setting",
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "resilience_survival"
  ],
  "suggested_venues": [
    "amphitheater",
    "outdoor_venue",
    "roadhouse"
  ],
  "sounds_like_acoustic": "",
  "sounds_like_recording": "",
  "notes": ""
}