{
  "song_id": "runnin_late_to_church",
  "title": "Runnin’ Late to Church",
  "status": "private",
  "lyrics": "Verse 1\nWoke up with a stranger, tangled in the sheets,\nLipstick on my collar, boots stillMayor’s weight on my feet.\nClock’s tickin’ past nine, preacher’s gonna frown,\nGot a potluck dish to save my soul in this town.\n\nChorus\nRunnin’ late to church, with a sinner’s grin,\nLast night’s whiskey still burnin’ deep within.\nTater casserole’s ridin’ shotgun in my truck,\nPrayin’ for grace, hopin’ for luck.\n\nVerse 2\nHer perfume’s on my shirt, can’t shake the devil’s sway,\nDashboard Jesus judgin’ every mile I stray.\nGravy flies, I’m speedin’ down that old dirt road,\nGotta get to service ‘fore the choir sings.\n\nChorus\nRunnin’ late to church, with a sinner’s grin,\nLast night’s whiskey still burnin’ deep within.\nTater casserole’s ridin’ shotgun in my truck,\nPrayin’ for grace, hopin’ for luck.\n\nBridge\nBarstool confessions won’t cleanse my soul,\nBut a pan of cornbread might make the preacher whole.\nSlide in the back pew, dodge the deacon’s stare,\nLord, forgive me, I’m almost there.\n\nChorus\nRunnin’ late to church, with a sinner’s grin,\nLast night’s whiskey still burnin’ deep within.\nTater casserole’s ridin’ shotgun in my truck,\nPrayin’ for grace, hopin’ for luck.\n\nOutro\n(Claps, hollers, banjo twang)\nLate to church, but I’m here with my dish,\nSaved by the potluck, thank God for this wish!",
  "themes": [
    "bar_setting",
    "faith_spirituality",
    "hometown_roots",
    "love_romance",
    "partying_celebration",
    "rebellion_outlaw"
  ],
  "suggested_venues": [
    "church",
    "honky_tonk",
    "revival"
  ],
  "sounds_like_acoustic": "Bright acoustic guitar strums with a cheeky mixed in riff, gravelly vocals delivering a foot-tapping, gospel-tinged romp, claps adding barroom charm.",
  "sounds_like_recording": "Polished country-rock, jangly guitars, lively fiddle, and driving drums, with group harmonies on the chorus for a radio-ready, singalong vibe.",
  "notes": "Performance Details\n\n\n\n\n\nSound Description (Acoustic): Bright acoustic guitar strums with a cheeky banjo riff, gravelly vocals delivering a foot-tapping, gospel-tinged romp, claps adding barroom charm.\n\nSound Description (Recording): Polished country-rock, jangly guitars, lively fiddle, and driving drums, with group harmonies on the chorus for a radio-ready, singalong vibe."
}