{
  "song_id": "scars_and_smoke",
  "title": "Scars and Smoke",
  "status": "private",
  "lyrics": "Verse 1\nSunrise bleeds red over coal-dust hills, another day’s begun,\nGravel crunches under boots, chasin’ a merciless sun.\nAin’t the life I dreamed, boy, ain’t the hand I aimed to draw,\nBut ghosts of broken yesterdays still claw me raw.\nPre-Chorus\nNo preacher’s words could save me, no bottle drowns the pain,\nJust me and these old scars, walkin’ through the rain.\nChorus\nScars and smoke, heart carved to stone, that’s all they think I am,\nA rambler’s soul, bound to roam, with a rebel’s give-a-damn.\nBut deep beneath this busted shell, a spark still fights to burn,\nScratchin’ through the gates of hell, for peace I’ll never earn.\nVerse 2\nHighway’s a lonesome thread, gray as a miner’s grave,\nEach mile a cut that memory’s blade never forgave.\nBurned my bridges, paid in blood, for choices I can’t mend,\nHuntin’ grace in ghost-town dust, where the lost roads end.\nPre-Chorus\nNo mercy in the mirror, just a boy who learned to fight,\nCarvin’ truth from shattered years, under cold starlight.\nChorus\nScars and smoke, heart carved to stone, that’s all they think I am,\nA rambler’s soul, bound to roam, with a rebel’s give-a-damn.\nBut deep beneath this busted shell, a spark still fights to burn,\nScratchin’ through the gates of hell, for peace I’ll never earn.\nBridge\nThey say time stitches wounds, but mine still bleed and scream,\nEchoes of a daddy’s fist haunt every damn dream.\nI won’t let the dark win, won’t lay down and die,\nGonna claw toward that faint light, till I touch the sky.\nChorus\nScars and smoke, heart carved to stone, that’s all they think I am,\nA rambler’s soul, bound to roam, with a rebel’s give-a-damn.\nBut deep beneath this busted shell, a spark still fights to burn,\nScratchin’ through the gates of hell, for peace I’ll never earn.\nOutro\n*(Slow picking, low E drone)*\nJust a flicker of peace tonight, under this lonesome moon so bright.\nScars and smoke, it’s all I’ve known,\nKeep walkin’ these roads, till I call ‘em home.",
  "themes": [
    "abuse_trauma",
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "nature_outdoors",
    "nostalgia",
    "rebellion_outlaw",
    "resilience_survival",
    "working_class_labor"
  ],
  "suggested_venues": [
    "amphitheater",
    "outdoor_venue",
    "roadhouse"
  ],
  "sounds_like_acoustic": "",
  "sounds_like_recording": "",
  "notes": ""
}