{
  "song_id": "soul_food",
  "title": "Soul Food",
  "status": "private",
  "lyrics": "Verse 1\nWalked through the door, grease poppin’ in the air,\nCornbread steamin’, love’s everywhere.\nMama’s in the kitchen, stirrin’ up a spell,\nPlates piled high, where the heart can dwell.\n\nChorus\nSoul food, oh, it’s lard and grace!\nFills my mind, my soul, my face!\nFrom the skillet to the heart, it’s healin’ me whole,\nSoul food, feedin’ body and soul!\n\nVerse 2\nCollard greens simmer, black-eyed peas sing,\nEvery bite’s a prayer, makes the spirit swing.\nRound that table, laughin’, stories unfold,\nWarmin’ up the weary, worth more than gold.\n\nChorus\nSoul food, oh, it’s lard and grace!\nFills my mind, my soul, my face!\nFrom the skillet to the heart, it’s healin’ me whole,\nSoul food, feedin’ body and soul!\n\nBridge\nPass the biscuits, pour the gravy high,\nFeel the love that lifts you to the sky!\nIn this sacred spot, where the good times roll,\nLard and grace gonna save your soul!\n\nChorus\nSoul food, oh, it’s lard and grace!\nFills my mind, my soul, my face!\nFrom the skillet to the heart, it’s healin’ me whole,\nSoul food, feedin’ body and soul!\n\nOutro\n(Claps, hollers, gospel hum)\nSoul food, yeah, it’s where I’m found,\nLard and grace, in that holy ground!",
  "themes": [
    "family",
    "faith_spirituality",
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "nostalgia",
    "partying_celebration"
  ],
  "suggested_venues": [
    "church",
    "festival",
    "house_concert",
    "revival"
  ],
  "sounds_like_acoustic": "Alex’s rusted guitar strums bright, open chords with a lively, gospel-infused rhythm, his gravelly vocals belting the hook with warm, infectious joy. Claps and a foot-tap pulse add raw, kitchen-jam energy, sparking singalongs.",
  "sounds_like_recording": "A jangly acoustic guitar and soulful electric riffs lead a full band with upbeat drums, a lively piano, and gospel choir harmonies, crafting a polished, radio-ready anthem. Alex’s raspy vocals soar with reverb on the hook, backed by tambourine for a vibrant, crowd-pleasing sound.",
  "notes": ""
}