{
  "song_id": "taco_town",
  "title": "Taco Town",
  "status": "private",
  "lyrics": "Verse 1\nRolled into town with a hunger to tame,\nSaw a food truck sign, didn’t know the name.\n“Taaah-cooows,” I drawled, with a puzzled grin,\nSomethin’ new was callin’, let the feast begin!\n\nChorus\nIt’s taco time, y’all, grab a messy bite!\nCorn and meat, so cheap, lightin’ up the night!\nSpicy kick, hands slick, lovin’ every thrill,\nTaco time, givin’ my heart a fill!\n\nVerse 2\nBit that tortilla, flavors burstin’ free,\nJuice down my chin, felt like heaven to me.\nOnions, cilantro, a little hot sting,\nThis workin’ man’s food makes my soul wanna sing.\n\nChorus\nIt’s taco time, y’all, grab a messy bite!\nCorn and meat, so cheap, lightin’ up the night!\nSpicy kick, hands slick, lovin’ every thrill,\nTaco time, givin’ my heart a fill!\n\nBridge\nPass the salsa, let the good times roll,\nEvery bite’s a fire warmin’ up my soul!\nFrom a stranger’s plate to a lover’s smile,\nTacos bring us closer, country style!\n\nChorus\nIt’s taco time, y’all, grab a messy bite!\nCorn and meat, so cheap, lightin’ up the night!\nSpicy kick, hands slick, lovin’ every thrill,\nTaco time, givin’ my heart a fill!\n\nOutro\n(Claps, hollers, banjo twang)\nTaco time, yeah, it’s my new jam,\nFrom a small-town boy to a taco man!",
  "themes": [
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "partying_celebration",
    "working_class_labor"
  ],
  "suggested_venues": [
    "festival",
    "honky_tonk",
    "house_concert",
    "outdoor_venue",
    "roadhouse"
  ],
  "sounds_like_acoustic": "Alex’s rusted guitar strums bright, open chords with a lively, foot-tapping rhythm, his gravelly vocals belting the hook with a playful grin. Claps and a subtle string buzz add raw, front-porch energy, sparking instant singalongs.",
  "sounds_like_recording": "A jangly acoustic guitar and twangy electric riffs lead a full band with upbeat drums, a zippy fiddle, and banjo plucks, crafting a polished, radio-ready anthem. Alex’s raspy vocals soar with group harmonies on the hook, backed by tambourine for a vibrant, crowd-pleasing sound.",
  "notes": ""
}