{
  "song_id": "tailgate_testament",
  "title": "Tailgate Testament",
  "status": "private",
  "lyrics": "Verse 1\nGolden light on a dirt road’s bend, Two kids dreamin’ where the world don’t end. His old Ford hums with a radio glow, Singin’ soft to the love we know.\nPre-Chorus\nDust swirled around barefoot vows, Horizon stretched beyond our brows, We carved forever in simple vows.\nChorus\nA beat-up truck, a sunset drive, A cooler full of promises we’ll barely survive. In these fields, our hearts confess, This is our tailgate testament.\nPost-Chorus\nSunset fades but our words remain, Etched in gravel and harvested grain, We hold this moment through joy and pain.\nVerse 2\nCrickets hum as the stars ignite, Her hand in mine feels like every right. We dance in the glow of a tailgate throne, Buildin’ a future from dreams we’ve sown.\nPre-Chorus\nDust swirled around barefoot vows, Horizon stretched beyond our brows, We carved forever in simple vows.\nChorus\nA beat-up truck, a sunset drive, A cooler full of promises we’ll barely survive. In these fields, our hearts confess, This is our tailgate testament.\nBridge\nNo chapel walls, no preacher’s call, Just open skies and the truth of it all. We’ll weather storms, we’ll chase the light, Swearin’ our love in the warm summer night.\nChorus\nA beat-up truck, a sunset drive, A cooler full of promises we’ll barely survive. In these fields, our hearts confess, This is our tailgate testament.\nOutro\nBoots in the grass, the night rolls in, Our story’s written where the stars begin. Through every mile, we’ll still profess, This is our tailgate testament.",
  "themes": [
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "partying_celebration",
    "resilience_survival",
    "working_class_labor"
  ],
  "suggested_venues": [
    "amphitheater",
    "coffee_shop",
    "festival",
    "house_concert",
    "listening_room",
    "outdoor_venue"
  ],
  "sounds_like_acoustic": "Gentle fingerpicked acoustic guitar and warm vocal harmonies, evoking a nostalgic and intimate feel.  A light banjo or mandolin might add to the folksy charm.",
  "sounds_like_recording": "A polished country recording with a driving, rhythmic feel, featuring electric guitar, bass, drums, and prominent vocal harmonies. Steel guitar and fiddle could add a classic country texture.",
  "notes": ""
}