{
  "song_id": "tailgate_nights",
  "title": "Tailgate Nights",
  "status": "private",
  "lyrics": "Verse 1\nPickup’s parked where the river runs slow,\nStars are burnin’ like a backroad show.\nCooler’s stocked, and the fire’s alight,\nWe’re kickin’ up dust on a tailgate night.\nPre-Chorus\nNo city lights, no weight to bear,\nJust a small-town heart and the open air.\nChorus\nTailgate nights, where the fiddle sings free,\nDancin’ in the moonlight with the whole world and me.\nFrom the hollers we rise to the dreams we ignite,\nWe’re livin’ for love on these tailgate nights.\nVerse 2\nShe’s laughin’ loud with a spark in her grin,\nSpinnin’ in boots where the wild grass begins.\nI pull that bow, let the strings tell the tale,\nOf a boy and a girl and a love that won’t fail.\nPre-Chorus\nNo past to haunt, no wrongs to right,\nJust her in my arms on a tailgate night.\nChorus\nTailgate nights, where the fiddle sings free,\nDancin’ in the moonlight with the whole world and me.\nFrom the hollers we rise to the dreams we ignite,\nWe’re livin’ for love on these tailgate nights.\nBridge\nEvery scrape of the bow’s a spark in the dark,\nEvery beat of her heart’s a new place to start.\nThis riverbank’s ours, where the future feels right,\nWe’re writin’ our story on a tailgate night.\nChorus\nTailgate nights, where the fiddle sings free,\nDancin’ in the moonlight with the whole world and me.\nFrom the hollers we rise to the dreams we ignite,\nWe’re livin’ for love on these tailgate nights.\nOutro\n*(Fiddle run: G|-3-5-7-5-3-0-|)*\nRiver keeps rollin’, but we’re holdin’ on tight,\nForever’s born here on a tailgate night.",
  "themes": [
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "partying_celebration",
    "resilience_survival"
  ],
  "suggested_venues": [
    "amphitheater",
    "festival",
    "outdoor_venue"
  ],
  "sounds_like_acoustic": "A lively, folksy tune driven by acoustic guitar, fiddle, and hand claps, with a warm, inviting feel.",
  "sounds_like_recording": "A polished country track with prominent fiddle, banjo, and driving drums, featuring a bright, anthemic chorus and a slightly echoey production to evoke the open-air setting.",
  "notes": ""
}