{
  "song_id": "the_mourning_after",
  "title": "The Mourning After",
  "status": "private",
  "lyrics": "Verse 1\nWoke up to a headache and your face in my mind,\nThat video call still burns like cheap red wine.\nI torched your old photos in a rusted tin can,\nBut your laugh keeps echoin’ through this broken man.\nPre-Chorus\nI’m half-dead, but I’m fightin’ to breathe,\nTradin’ tears for the strength to believe.\nChorus\nThe mournin’ after’s a cold, lonesome fight,\nScrapin’ up my heart in the pale morning light.\nI’m chasin’ new shadows where your ghost don’t roam,\nFindin’ my way, but I ain’t yet home.\nVerse 2\nNew bar down the highway, new smoke in the air,\nA girl’s crooked smile says she don’t know my care.\nI’m shakin’ off the weight of your cheatin’ disguise,\nBut your voice still cuts through the neon-lit skies.\nPre-Chorus\nI’m not healed, but I’m startin’ to mend,\nCarvin’ out a road where your lies gotta end.\nChorus\nThe mournin’ after’s a cold, lonesome fight,\nScrapin’ up my heart in the pale morning light.\nI’m chasin’ new shadows where your ghost don’t roam,\nFindin’ my way, but I ain’t yet home.\nBridge\nEvery mile I drive, I bury you deeper in the dust,\nEvery shot I take, I’m weldin’ back my trust.\nYour love was a blade that cut me to the core,\nBut I’m stitchin’ up my soul, I don’t need you no more.\nChorus\nThe mournin’ after’s a cold, lonesome fight,\nScrapin’ up my heart in the pale morning light.\nI’m chasin’ new shadows where your ghost don’t roam,\nFindin’ my way, but I ain’t yet home.\nOutro\nNew dives, new dawns, new battles to win,\nThe mournin’ after’s where I’m learnin’ to begin.\n*(Slow picking: E|-3---3---|)*\nMournin’ after you… I’m startin’ again.",
  "themes": [
    "abuse_trauma",
    "bar_setting",
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "love_romance",
    "nature_outdoors",
    "nostalgia",
    "resilience_survival"
  ],
  "suggested_venues": [
    "dive_bar"
  ],
  "sounds_like_acoustic": "",
  "sounds_like_recording": "",
  "notes": ""
}