{
  "song_id": "the_road_to_nashville",
  "title": "The Road to Nashville",
  "status": "private",
  "lyrics": "Verse 1\nGot a beat-up truck and a guitar case,\nDreams burnin’ hotter than a summer’s blaze.\nLeavin’ small-town dust in my rearview glow,\nHeaded where the neon lights call my soul.\n\nChorus\nOn the road to Nashville, sing it loud and free!\nChasin’ stars and honky-tonks, where I’m meant to be!\nFrom the backroads to the bright lights, feel the thrill,\nOn the road to Nashville, I’m climbin’ that hill!\n\nVerse 2\nSweet tea sippin’, boots tappin’ the floor,\nSingin’ my heart out, knockin’ on doors.\nEvery mile’s a story, every note’s a fight,\nSouthern grit’s pushin’ me through the night.\n\nChorus\nOn the road to Nashville, sing it loud and free!\nChasin’ stars and honky-tonks, where I’m meant to be!\nFrom the backroads to the bright lights, feel the thrill,\nOn the road to Nashville, I’m climbin’ that hill!\n\nBridge\nRaise a bottle, let the fiddle wail,\nEvery dreamer’s got a tale to tell!\nWith a song in my soul and fire in my veins,\nNashville’s callin’, breakin’ all my chains!\n\nChorus\nOn the road to Nashville, sing it loud and free!\nChasin’ stars and honky-tonks, where I’m meant to be!\nFrom the backroads to the bright lights, feel the thrill,\nOn the road to Nashville, I’m climbin’ that hill!\n\nOutro\n(Claps, hollers, banjo rolls)\nOn the road to Nashville, never standin’ still,\nSing it proud, keep pushin’, got a dream to fill!\nFrom the heartland to the stage, I’m risin’ high,\nOn the road to Nashville, reachin’ for the sky!",
  "themes": [
    "bar_setting",
    "faith_spirituality",
    "freedom_wandering",
    "hometown_roots",
    "music_songwriting",
    "nature_outdoors",
    "partying_celebration",
    "resilience_survival"
  ],
  "suggested_venues": [
    "arena",
    "festival",
    "honky_tonk",
    "roadhouse",
    "stadium"
  ],
  "sounds_like_acoustic": "Bright, jangly acoustic and twangy electric guitar riffs kick off this anthem, joined by driving drums, lively fiddle, and crisp banjo plucks, Alex’s raspy vocals ride atop, with bold group harmonies on the infectious hook, Tambourine and organ round out the arrangement, adding energy and warmth",
  "sounds_like_recording": "",
  "notes": ""
}