{
  "song_id": "the_way_you_make_me_feel",
  "title": "The Way You Make Me Feel",
  "status": "private",
  "lyrics": "Verse 1\nYour silhouette’s a spark in the twilight’s glow,\nLeather and lace, where the wild things grow.\nOne look from you, and my defenses all reel,\nYou’re a storm Marie Antoinette, and I’m under your spell.\nChorus\nWhiskey on your lips, sunset on your skin —\nEvery ‘no’ I ever said, you pull it out again.\nThe way you move, the way you steal —\nGod help me, girl, the way you make me feel.\nVerse 2\nBoots on the floor, rhythm slow and unkind,\nYou’re a temptation that’s burnin’ my mind.\nYour touch is a fuse, lightin’ fires I conceal,\nThis heart’s runnin’ hot, and it’s losin’ the wheel.\nChorus\nWhiskey on your lips, sunset on your skin —\nEvery ‘no’ I ever said, you pull it out again.\nThe way you move, the way you steal —\nGod help me, girl, the way you make me feel.\nBridge\nNo salvation in sight, no way to repent,\nYou’re a sin I’d commit, every dollar I’ve spent.\nYour kiss is a chain, and I’m locked in your thrill,\nI’d fall a thousand times just to feel that chill.\nVerse 3\nStarlight’s fadin’, but your eyes still burn,\nEvery curve of you makes my whole world turn.\nYou’re the devil’s own dance, yet you’re all that’s ideal,\nI’m a goner, sweet darlin’, the way you make me feel.\nChorus\nWhiskey on your lips, sunset on your skin —\nEvery ‘no’ I ever said, you pull it out again.\nThe way you move, the way you steal —\nGod help me, girl, the way you make me feel.\nOutro\nWhen the night calls soft, and the shadows get real,\nYou’re the only truth that my soul wants to feel.\nFrom your wicked sweet smile to the heat you reveal,\nI’m yours, my love, the way you make me feel.",
  "themes": [
    "abuse_trauma",
    "bar_setting",
    "faith_spirituality",
    "love_romance",
    "nature_outdoors",
    "rebellion_outlaw"
  ],
  "suggested_venues": [
    "coffee_shop",
    "house_concert",
    "listening_room",
    "small_theater"
  ],
  "sounds_like_acoustic": "Intimate and raw, featuring a fingerpicked acoustic guitar, a steady bass drum beat, and potentially a mournful harmonica, evoking a bluesy, folk-rock feel.",
  "sounds_like_recording": "Sultry and driving, with a blend of electric guitar, bass, and drums creating a dark, bluesy-rock atmosphere, layered with possibly some strings or a Hammond organ for added drama.",
  "notes": ""
}