{
  "song_id": "tumbleweed_promises",
  "title": "Tumbleweed Promises",
  "status": "private",
  "lyrics": "(Verse 1)\nI left my heart in a diner, on a napkin stained with wine,\nScribbled sweet nothins’, swore I’d make you mine.\nBut the road’s a jealous lover, she don’t let me stay,\nNow those vows are driftin’, like tumbleweeds away.\n(Pre-Chorus)\nEvery mile I travel, I’m chasin’ what I lost,\nPayin’ for my freedom, but damn, what a cost.\n(Chorus)\nTumbleweed promises, rollin’ through my mind,\nWords I meant to keep, but left ‘em all behind.\nThey scatter in the wind, where the wild hearts roam,\nTumbleweed promises, never find a home.\n(Verse 2)\nYour laughter haunts the radio, in the static’s hum,\nSingin’ ‘bout forever, but forever never comes.\nI pass ghost-town motels, with their busted neon signs,\nWonderin’ if you’re out there, still callin’ me “mine.”\n(Pre-Chorus)\nThis guitar’s my preacher, strummin’ out my truth,\nCarvin’ out redemption, from the sins of my youth.\n(Chorus)\nTumbleweed promises, rollin’ through my mind,\nWords I meant to keep, but left ‘em all behind.\nThey scatter in the wind, where the wild hearts roam,\nTumbleweed promises, never find a home.\n(Bridge)\nI’ve loved in smoky barrooms, I’ve knelt in desert rain,\nSwore I’d be your shelter, but I brought you pain.\nYet somewhere in this dust, there’s a spark that won’t fade,\nA tumbleweed promise, that I’ll keep someday.\n(Chorus)\nTumbleweed promises, rollin’ through my mind,\nWords I meant to keep, but left ‘em all behind.\nThey scatter in the wind, where the wild hearts roam,\nTumbleweed promises, never find a home.\n(Outro)\nSo I’ll ride these endless highways, with a bottle and a song,\nHopin’ you’re still waitin’, though I’ve been gone too long.\nTill I find my way back, or the stars call me on,\nTumbleweed promises… keep rollin’ along.\nYeah, keep rollin’ along. (Tumbleweed dreams.)\nRollin’ along.\nVibe: The song feels like a late-night drive through a desert, with the narrator grappling with his transient life and lingering hope. It’s less intense than \"Reaper\" but equally compelling, with a balance of grit and melody. Performance: Picture the same artist performing this in a dimly lit roadhouse or on a festival stage, strumming a worn guitar with a band (acoustic, electric, pedal steel, harmonica). The chorus invites quiet singalongs, and the bridge could feature a spotlight on the singer’s raw delivery. Imagery and Themes: Lyrics evoke rural, transient life (diners, highways, tumbleweeds) while touching on universal emotions (love, regret, hope), making it relatable yet authentically country.\nSounds Like\nA soulful, mid-tempo outlaw country anthem with a reflective, road-worn vibe, blending gritty authenticity with radio-friendly hooks.",
  "themes": [
    "bar_setting",
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "rebellion_outlaw"
  ],
  "suggested_venues": [
    "coffee_shop",
    "honky_tonk",
    "house_concert",
    "roadhouse"
  ],
  "sounds_like_acoustic": "A wistful, fingerpicked acoustic guitar melody with a touch of harmonica, conveying a sense of longing and regret.",
  "sounds_like_recording": "A warm, slightly gritty production with electric and acoustic guitars, pedal steel, light drums, and a driving bassline, creating a melancholic yet hopeful atmosphere.",
  "notes": ""
}