{
  "song_id": "under_a_southern_sky",
  "title": "Under a Southern Sky",
  "status": "private",
  "lyrics": "(Verse 1)\nI was runnin’ on empty, down a two-lane road,\nChasin’ whiskey sunsets, with a heavy load.\nLeft my dreams in a dive bar, thought I’d lost my way,\nTill your smile lit the darkness, like a summer day.\n(Pre-Chorus)\nThis old heart was wanderin’, till you called my name,\nNow I’m standin’ in the starlight, and I’ll never be the same.\n(Chorus)\nI find my heart, find my soul, find you under a southern sky,\nWhere the pines whisper secrets, and the fireflies fly.\nWith your hand in mine, I’m alive, I’m whole,\nI find my heart, find my soul, under a southern sky.\n(Verse 2)\nWe danced in the moonlight, by a creek’s soft hum,\nBarefoot on the red dirt, to a banjo’s strum.\nYour laughter’s my compass, through the highs and lows,\nYou’re the home I never knew, where my restless spirit goes.\n(Pre-Chorus)\nNo more lone-star highways, no more lonesome fights,\nYou’re my rebel redemption, in the glow of the night.\n(Chorus)\nI find my heart, find my soul, find you under a southern sky,\nWhere the pines whisper secrets, and the fireflies fly.\nWith your hand in mine, I’m alive, I’m whole,\nI find my heart, find my soul, under a southern sky.\n(Bridge)\nWe’ve got scars from the battles, we’ve got stories to tell,\nFrom the honky-tonk heartaches to the heavens we fell.\nBut under these stars, with you by my side,\nI’ve found my forever, on this wild, sweet ride.\n(Chorus)\nI find my heart, find my soul, find you under a southern sky,\nWhere the pines whisper secrets, and the fireflies fly.\nWith your hand in mine, I’m alive, I’m whole,\nI find my heart, find my soul, under a southern sky.\n(Outro)\nSo let’s chase the horizon, where the dawn breaks wide,\nWith you, I’m unbroken, on this southern sky ride.\nI find my heart, find my soul, forever you and I,\nUnder a southern sky… under a southern sky.",
  "themes": [
    "abuse_trauma",
    "bar_setting",
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "rebellion_outlaw",
    "resilience_survival"
  ],
  "suggested_venues": [
    "amphitheater",
    "dive_bar",
    "honky_tonk",
    "outdoor_venue",
    "roadhouse"
  ],
  "sounds_like_acoustic": "",
  "sounds_like_recording": "",
  "notes": ""
}