{
  "song_id": "when_you_cant_be_near_me",
  "title": "When You Can't Be Near Me",
  "status": "private",
  "lyrics": "(Verse 1) When you can't be near me, please think of me, I'm starin' at the highway, where you used to be. You're gone, my darlin', chasin' some new flame, But my heart's still ramblin', callin' out your name.\n(Pre-Chorus) This whiskey's cold, it don't ease the pain, Without you here, I'm half insane.\n(Chorus) When you can't be near me, oh, my lonesome soul, Keep me in your rearview, where the heartaches roll. Sing my name like a jukebox, broken, wild, and free, When you can't be near me, please think of me.\n(Verse 2) I'm thumbin' through old photos, on this cracked phone screen, Your smile's a ghost now, in this lonesome scene. Got your voice in my head, like a steel guitar's cry, Keeps me holdin' on, beneath this empty sky.\n(Pre-Chorus) The barstool's creakin', but it ain't my home, Without your touch, I'm destined to roam.\n(Chorus) When you can't be near me, oh, my lonesome soul, Keep me in your rearview, where the heartaches roll. Sing my name like a jukebox, broken, wild, and free, When you can't be near me, please think of me.\n(Bridge) So raise a glass, wherever you ride, Send a prayer on the wind, to the lonesome side. We'll cross paths again, down some dusty road, Till then, I'm carryin' this heavy load.\n(Chorus) When you can't be near me, oh, my lonesome soul, Keep me in your rearview, where the heartaches roll. Sing my name like a jukebox, broken, wild, and free, When you can't be near me, please think of me.\n(Outro) So when you're out there, under neon's glow, I'm still your rebel, in the shadows, you know. Till we're back together, where we're meant to be, When you can't be near me... please think of me. Yeah, think of me. (Oh, my lonesome soul.) Think of me.",
  "themes": [
    "abuse_trauma",
    "bar_setting",
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "nostalgia",
    "partying_celebration",
    "rebellion_outlaw"
  ],
  "suggested_venues": [
    "dive_bar",
    "festival",
    "honky_tonk",
    "roadhouse"
  ],
  "sounds_like_acoustic": "",
  "sounds_like_recording": "",
  "notes": ""
}