{
  "song_id": "whiskey_dont_lie",
  "title": "Whiskey Don't Lie",
  "status": "private",
  "lyrics": "(Verse 1)\nI’m sittin’ at this barstool, with a neon glow,\nPourin’ out my heartache, where the jukebox flows.\nThe bartender knows me, he don’t ask my name,\nJust slides another whiskey, to kill the pain.\n(Pre-Chorus)\nThis dive bar’s my church, where the sinners pray,\nSpillin’ out their stories, till the break of day.\n(Chorus)\nWhiskey don’t lie, it tells it straight,\nBurns like the truth, no need to wait!\nRaise your glass high, let the heartache fly,\nSing it loud, boys, whiskey don’t lie!\n(Verse 2)\nThe gal I loved, she’s gone, took my ramblin’ heart,\nLeft me with this bottle, and a brand-new scar.\nBut this amber fire, it don’t judge my sins,\nJust lights up the shadows, where my night begins.\n(Pre-Chorus)\nThe jukebox is wailin’, but it can’t compare,\nTo the truth in this glass, and the pain we share.\n(Chorus)\nWhiskey don’t lie, it tells it straight,\nBurns like the truth, no need to wait!\nRaise your glass high, let the heartache fly,\nSing it loud, boys, whiskey don’t lie!\n(Bridge)\nSo here’s to the lost, and the ones we miss,\nTo the fights and the nights, sealed with a kiss.\nEvery drop’s a preacher, every sip’s a song,\nSing it with me, brothers, we’ll howl all night long!\n(Chorus)\nWhiskey don’t lie, it tells it straight,\nBurns like the truth, no need to wait!\nRaise your glass high, let the heartache fly,\nSing it loud, boys, whiskey don’t lie!\n(Outro)\nWhen the barroom’s empty, and the stars burn low,\nI’ll stumble to the highway, with nowhere to go.\nBut I’ll carry this gospel, till the day I die,\nSing it one more time—whiskey don’t lie!\nYeah, whiskey don’t lie! (Raise ‘em up high!)\nWhiskey don’t lie!\nAcoustic sound: A stripped-down, raw acoustic arrangement with a steady strumming pattern highlights the song's heartache, while a mournful fiddle weaves in and out, emphasizing the lament. The vocal delivery is gritty and vulnerable, carrying the story's emotional weight with a conversational honesty.\nPotential Sound:\nOutlaw Country Vibe: The song channels the raw, rebellious spirit of outlaw country with vivid imagery (neon, jukeboxes, barstools) and a narrator who’s both broken and defiant. The whiskey serves as a metaphor for unfiltered truth, tying into the genre’s honesty. Singalong Energy: The repetitive chorus (“Whiskey don’t lie, it tells it straight”) and simple, anthemic hooks are designed for a crowd to shout along, with gang vocals and a bridge that rallies everyone to join in. Modern Touches: References to phones or modern heartbreak are subtle, keeping the focus on timeless barroom camaraderie, but the tone feels relatable for 2025. Performance: Picture this in a sweaty honky-tonk or a modern country musical, with a charismatic frontman leading a raucous band (electric guitar, fiddle, piano, drums). The crowd stomps boots, clinks bottles, and sings the chorus at the top of their lungs.",
  "themes": [
    "abuse_trauma",
    "bar_setting",
    "faith_spirituality",
    "freedom_wandering",
    "heartbreak_loss",
    "love_romance",
    "music_songwriting",
    "nature_outdoors",
    "partying_celebration",
    "rebellion_outlaw"
  ],
  "suggested_venues": [
    "dive_bar",
    "festival",
    "honky_tonk",
    "roadhouse"
  ],
  "sounds_like_acoustic": "",
  "sounds_like_recording": "",
  "notes": ""
}