{
  "song_id": "wild_la",
  "title": "Wild LA",
  "status": "private",
  "lyrics": "Verse 1\nI’m a red dirt drifter, boots scarred from the clay,\nDropped in this jungle they call LA.\nOat milk in my coffee? That ain’t milk, I reckon,\nOats don’t got nipples, y’all messin’ with my head, son.\n\nPre-Chorus\nKombucha flights and candles with a prayer,\nFarmers market’s a circus, patchouli in the air.\n\nChorus\nWild LA, where the kale’s got a soul,\nI’m a fish outta water, but I’m keepin’ my roll.\nFrom raw almond jerky to goats in a sweater,\nI’m laughin’ through the madness, this heart’s gettin’ better.\nGrounded in the holler, but I’m ridin’ this wave,\nSingin’ my truth in the heart of Wild LA!\n\nVerse 2\nCelery smoothies run eleven bucks a pop,\nMushrooms get a massage ‘fore they hit the shop.\nMan bun’s pluckin’ banjo, bought it off the ‘net,\nBut them bruised-up apples? That’s the realest I’ve met.\n\nPre-Chorus\nCharcoal lavender brew, moonlight in a glass,\nI’m dodgin’ astral vibes, holdin’ onto my sass.\n\nChorus\nWild LA, where the kale’s got a soul,\nI’m a fish outta water, but I’m keepin’ my roll.\nFrom raw almond jerky to goats in a sweater,\nI’m laughin’ through the madness, this heart’s gettin’ better.\nGrounded in the holler, but I’m ridin’ this wave,\nSingin’ my truth in the heart of Wild LA!\n\nBridge\nMet a goat named Harold, sportin’ knitwear fine,\nChewin’ like a sage, got me losin’ my mind.\nShay’s wheezin’ laughter, says I’m too much sense,\nBut this crazy town’s spark’s breakin’ down my defense.\n\nChorus\nWild LA, where the kale’s got a soul,\nI’m a fish outta water, but I’m keepin’ my roll.\nFrom raw almond jerky to goats in a sweater,\nI’m laughin’ through the madness, this heart’s gettin’ better.\nGrounded in the holler, but I’m ridin’ this wave,\nSingin’ my truth in the heart of Wild LA!\n\nOutro\n(Fiddle rips, upbeat strum)\nWild LA, with Harold’s sweater in view,\nThis red dirt boy’s found a home in the zoo.",
  "themes": [
    "bar_setting",
    "family",
    "faith_spirituality",
    "freedom_wandering",
    "hometown_roots",
    "love_romance",
    "music_songwriting",
    "nature_outdoors"
  ],
  "suggested_venues": [
    "coffee_shop",
    "house_concert"
  ],
  "sounds_like_acoustic": "Upbeat, folksy country with a driving acoustic guitar rhythm, banjo plucking, and a prominent fiddle adding a playful, down-home feel.",
  "sounds_like_recording": "A polished country-pop production with bright electric guitars, crisp drums, layered banjo and fiddle, and a touch of steel guitar adding a nostalgic warmth.",
  "notes": ""
}