{
  "song_id": "workin_for_a_living",
  "title": "Workin' for a Living",
  "status": "private",
  "lyrics": "Verse 1\nDawn breaks hard, boots hit the ground,\nSweat’s my pay where the work is found.\nNo silver spoon, just a will to fight,\nPushin’ through the long days into the night.\n\nPre-Chorus\nBlisters on my hands, fire in my chest,\nEvery drop of sweat’s a step toward the best.\n\nChorus\nWorkin’ for a livin’, sunup till the stars burn bright,\nRough hands, tired bones, holdin’ on with all my might.\nAin’t got much, but I got heart, a spark that won’t let go,\nWorkin’ for a livin’, buildin’ dreams from the ground below.\n\nVerse 2\nFields of dust, factory’s hum,\nHaulin’ loads till my body’s numb.\nEvery ache’s a badge, every scar’s a sign,\nI’m carvin’ out a life that’s proud and mine.\n\nPre-Chorus\nNo shortcut’s callin’, no easy way,\nJust the grind that shapes me, day by day.\n\nChorus\nWorkin’ for a livin’, sunup till the stars burn bright,\nRough hands, tired bones, holdin’ on with all my might.\nAin’t got much, but I got heart, a spark that won’t let go,\nWorkin’ for a livin’, buildin’ dreams from the ground below.\n\nBridge\nRound the fire’s glow, we share the load,\nLaughin’ through the hurt, on this long road.\nFor the ones who toil, for the ones who strive,\nThis song’s for the workers keepin’ hope alive.\n\nChorus\nWorkin’ for a livin’, sunup till the stars burn bright,\nRough hands, tired bones, holdin’ on with all my might.\nAin’t got much, but I got heart, a spark that won’t let go,\nWorkin’ for a livin’, buildin’ dreams from the ground below.\n\nOutro\n(Fiddle kicks, steady strum)\nWorkin’ for a livin’, that’s my truth, my fight,\nFrom the break of dawn to the end of night.",
  "themes": [
    "abuse_trauma",
    "freedom_wandering",
    "heartbreak_loss",
    "music_songwriting",
    "nature_outdoors",
    "resilience_survival",
    "working_class_labor"
  ],
  "suggested_venues": [
    "arena",
    "festival",
    "honky_tonk",
    "roadhouse",
    "stadium"
  ],
  "sounds_like_acoustic": "A raw, rootsy acoustic performance with a foot-stomping rhythm, featuring acoustic guitar, lively fiddle, and a bright steel guitar hum, evoking the honest grit and heart of relentless labor.",
  "sounds_like_recording": "A rousing country anthem with a driving beat, layered acoustic and electric guitars, punchy bass, and soaring, gravelly vocals, capturing the unyielding spirit and pride of workers everywhere.",
  "notes": ""
}